<?xml version="1.0" encoding="utf-8"?>
<rss version="2.0"
  xmlns:atom="http://www.w3.org/2005/Atom"
  xmlns:content="http://purl.org/rss/1.0/modules/content/">
  <channel>
    <title>hackyboiz</title>
    <link>https://hackyboiz.github.io/</link>
    
    <atom:link href="https://hackyboiz.github.io/rss2.xml" rel="self" type="application/rss+xml"/>
    
    <description>hack &amp; life</description>
    <pubDate>Thu, 28 Oct 2021 05:18:06 GMT</pubDate>
    <generator>http://hexo.io/</generator>
    
    <item>
      <title>[하루한줄] CVE-2021–38646: MS Office Legacy Library의 원격 코드 실행 취약점</title>
      <link>https://hackyboiz.github.io/2021/10/28/l0ch/2021-10-28/</link>
      <guid>https://hackyboiz.github.io/2021/10/28/l0ch/2021-10-28/</guid>
      <pubDate>Thu, 28 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://googleprojectzero.github.io/0days-in-the-wild/0da</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://googleprojectzero.github.io/0days-in-the-wild/0day-RCAs/2021/CVE-2021-30858.html">CVE-2021-30858: Use-after-free in WebKit</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul><li>Microsoft Office</li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>9&#xC6D4; Patch Tuesday&#xC5D0;&#xC11C; &#xD328;&#xCE58;&#xB41C; Microsoft Office&#xC758; &#xC6D0;&#xACA9; &#xCF54;&#xB4DC; &#xC2E4;&#xD589; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xAD00;&#xD55C; &#xC138;&#xBD80; &#xC815;&#xBCF4;&#xAC00; &#xACF5;&#xAC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC6D0;&#xC778;&#xC740; Office&#xC5D0; &#xD3EC;&#xD568;&#xB41C; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xC11C;&#xBE44;&#xC2A4;&#xC778; Microsoft Access&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xB808;&#xAC70;&#xC2DC; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xC5D4;&#xC9C4; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC785;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c">.text:<span class="hljs-number">1000E1</span>CD                 push    eax             ; phkResult.text:<span class="hljs-number">1000E1</span>CE                 push    <span class="hljs-number">20019</span>h          ; samDesired.text:<span class="hljs-number">1000E1</span>D3                 push    <span class="hljs-number">0</span>               ; ulOptions.text:<span class="hljs-number">1000E1</span>D5                 push    offset SubKey   ; <span class="hljs-string">&quot;Software\\\\Borland\\\\Database Engine&quot;</span>.text:<span class="hljs-number">1000E1</span>DA                 push    <span class="hljs-number">80000002</span>h       ; hKey.text:<span class="hljs-number">1000E1</span>DF                 call    ds:RegOpenKeyExW....text:<span class="hljs-number">1000E2</span>BE                 push    edi.text:<span class="hljs-number">1000E2</span>BF                 push    eax.text:<span class="hljs-number">1000E2</span>C0                 push    offset aIdapi32Dll ; <span class="hljs-string">&quot;\\\\IDAPI32.DLL&quot;</span>.text:<span class="hljs-number">1000E2</span>C5                 call    Mso20Win32Client_1065</code></pre><p>MS Access&#xB294; DBF &#xD30C;&#xC77C;&#xC744; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xC5D4;&#xC9C4; &#xBAA8;&#xB4C8; &#xC911; &#xD558;&#xB098;&#xC778; xBase ISAM&#xC5D0;&#xC11C; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. xBase ISAM&#xC758; <code>ACEXBE.dll</code>&#xC740; DBF &#xD30C;&#xC77C;&#xC744; &#xD30C;&#xC2F1;&#xD560; &#xB54C; Borland DataBase Engine(BDE) &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC778; <code>IDAPI32.dll</code> &#xB97C; &#xB85C;&#xB4DC;&#xD574; BDE &#xD30C;&#xC77C;&#xB85C; &#xBCC0;&#xD658;&#xD55C; &#xB4A4; &#xD30C;&#xC2F1;&#xD569;&#xB2C8;&#xB2E4;.</p><blockquote><p>dBase : &#xD30C;&#xC77C; &#xAE30;&#xBC18; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;(ISAM) &#xC800;&#xC7A5; &#xBC29;&#xC2DD;&#xC758; DBMS&#xB85C;, &#xCD08;&#xAE30; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xC2DC;&#xC7A5;&#xC758; &#xC8FC;&#xB958;&#xC600;&#xC73C;&#xBA70; xBase&#xB77C;&#xB294; &#xC774;&#xB984;&#xC73C;&#xB85C; &#xD45C;&#xC900;&#xD654;&#xB418;&#xC5C8;&#xC73C;&#xB098; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD658;&#xACBD;&#xC5D0; &#xB300;&#xC751;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB2E4;&#xAC00; MySQL, PostgreSQL &#xB4F1;&#xC758; DBMS &#xB4F1;&#xC7A5;&#xC73C;&#xB85C; &#xC0AC;&#xC7A5;&#xB428;</p><p>DBF(dBase Table File Format) : dBase&#xC758; &#xD30C;&#xC77C; &#xD3EC;&#xB9F7;. MS Office, Apache OpenOpffice &#xB4F1;&#xC758; ISAM&#xC5D0;&#xC11C; &#xB808;&#xAC70;&#xC2DC;&#xB85C; &#xC9C0;&#xC6D0;</p><p>BDE(Borland DataBase Engine) : MS Office&#xC5D0;&#xC11C; DBF &#xD30C;&#xC77C;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xD558;&#xB294; Borland&#xC0AC;&#xC758; dBase &#xB808;&#xAC70;&#xC2DC; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4; &#xC5D4;&#xC9C4;</p></blockquote><p><code>IDAPI32.dll</code> &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB294; 2001&#xB144; &#xB9C8;&#xC9C0;&#xB9C9; &#xBC84;&#xC804;&#xC774; &#xB9B4;&#xB9AC;&#xC988;&#xB41C; &#xC774;&#xD6C4; &#xB354; &#xC774;&#xC0C1; &#xC0AC;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC774;&#xBA70; &#xBC84;&#xD37C; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0;, OOB Write &#xB4F1; &#xC5EC;&#xB7EC; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC218;&#xC815;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xCC44;&#xB85C; &#xC874;&#xC7AC;&#xD55C; &#xAC83;&#xC774; &#xD655;&#xC778;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xBC1C;&#xACAC;&#xB41C; &#xCDE8;&#xC57D;&#xC810;&#xB4E4; &#xC911; exploitable&#xD55C; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xD06C;&#xB798;&#xC2DC;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c">(<span class="hljs-number">26</span>ac<span class="hljs-number">.26b</span>0): Access violation - <span class="hljs-function">code <span class="hljs-title">c0000005</span> <span class="hljs-params">(first chance)</span></span>First chance exceptions are reported before any exception handling.This exception may be expected <span class="hljs-keyword">and</span> handled.eax=<span class="hljs-number">00000000</span> ebx=<span class="hljs-number">00000000</span> ecx=<span class="hljs-number">00000008</span> edx=<span class="hljs-number">00000021</span> esi=<span class="hljs-number">6b</span>de36dc edi=<span class="hljs-number">00490000</span>eip=<span class="hljs-number">4</span>de39db2 esp=<span class="hljs-number">00b</span>4d31c ebp=<span class="hljs-number">00b</span>4d324 iopl=<span class="hljs-number">0</span>         nv up ei pl nz na po nccs=<span class="hljs-number">001b</span>  ss=<span class="hljs-number">0023</span>  ds=<span class="hljs-number">0023</span>  es=<span class="hljs-number">0023</span>  fs=<span class="hljs-number">003b</span>  gs=<span class="hljs-number">0000</span>             efl=<span class="hljs-number">00010202</span>IDDBAS32!BL_Exit+<span class="hljs-number">0x102</span>:<span class="hljs-number">4</span>de39db2 f3a5            rep movs dword ptr es:[edi],dword ptr [esi]<span class="hljs-number">0</span>:<span class="hljs-number">000</span>&gt; k # ChildEBP RetAddr  WARNING: Stack unwind information <span class="hljs-keyword">not</span> available. Following frames may be wrong.<span class="hljs-number">00</span> <span class="hljs-number">00b</span>4d324 <span class="hljs-number">4</span>de00cd8 IDDBAS32!BL_Exit+<span class="hljs-number">0x102</span><span class="hljs-number">01</span> <span class="hljs-number">00b</span>4d344 <span class="hljs-number">4</span>de019f6 IDDBAS32!XDrvInit+<span class="hljs-number">0x1fb7c</span><span class="hljs-number">02</span> <span class="hljs-number">00b</span>4d370 <span class="hljs-number">4</span>ddfc2a9 IDDBAS32!XDrvInit+<span class="hljs-number">0x2089a</span><span class="hljs-number">03</span> <span class="hljs-number">00b</span>4d4d0 <span class="hljs-number">4</span>ddee2cd IDDBAS32!XDrvInit+<span class="hljs-number">0x1b14d</span><span class="hljs-number">04</span> <span class="hljs-number">00b</span>4d9d0 <span class="hljs-number">4</span>dde2758 IDDBAS32!XDrvInit+<span class="hljs-number">0xd171</span><span class="hljs-number">05</span> <span class="hljs-number">00b</span>4da0c <span class="hljs-number">4b</span>dff194 IDDBAS32!XDrvInit+<span class="hljs-number">0x15fc</span><span class="hljs-number">06</span> <span class="hljs-number">00b</span>4dcc0 <span class="hljs-number">4b</span>de5019 IDAPI32!ImltCreateTable2+<span class="hljs-number">0x3532</span><span class="hljs-number">07</span> <span class="hljs-number">00b</span>4de18 <span class="hljs-number">79587b</span>b3 IDAPI32!DbiOpenTable+<span class="hljs-number">0xcd</span></code></pre><p>&#xD06C;&#xB798;&#xC2DC;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C; &#xC704;&#xCE58;&#xB294; <code>rep movs</code> &#xB85C;, <code>ESI</code>&#xC5D0;&#xC11C; <code>EDI</code>&#xB85C; <code>ECX</code>&#xC758; &#xD06C;&#xAE30;&#xB9CC;&#xD07C; &#xBCF5;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xAC12;&#xB4E4;&#xC744; &#xD574;&#xCEE4;&#xAC00; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xAC00; &#xD3EC;&#xD568;&#xB41C; BDF &#xD30C;&#xC77C;&#xB85C; &#xBAA8;&#xB450; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xC5B4; write-what-where&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACE0;, <code>IDAPI32.dll</code>&#xC5D0;&#xB294; ASLR&#xACFC; DEP &#xB610;&#xD55C; &#xC801;&#xC6A9;&#xB418;&#xC5B4; &#xC788;&#xC9C0; &#xC54A;&#xC544; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xC6B0;&#xD68C; &#xC5C6;&#xC774; &#xCF54;&#xB4DC; &#xC2E4;&#xD589;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xD574;&#xCEE4;&#xB294; &#xC774;&#xB97C; &#xC545;&#xC6A9;&#xD574; &#xC545;&#xC131; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xAC00; &#xD3EC;&#xD568;&#xB41C; DBF&#xD30C;&#xC77C;&#xC744; &#xD0C0;&#xAC9F; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xBC30;&#xD3EC;&#xD574; &#xC6D0;&#xACA9; &#xCF54;&#xB4DC; &#xC2E4;&#xD589;&#xC744; &#xD2B8;&#xB9AC;&#xAC70;&#xD560; &#xC218;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/cve/">cve</category>
      
      <category domain="https://hackyboiz.github.io/tags/rce/">rce</category>
      
      <category domain="https://hackyboiz.github.io/tags/microsoft/">microsoft</category>
      
      <category domain="https://hackyboiz.github.io/tags/dbase/">dbase</category>
      
      <category domain="https://hackyboiz.github.io/tags/cve-2021-38646/">cve-2021-38646</category>
      
      <category domain="https://hackyboiz.github.io/tags/ms-office/">ms office</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/28/l0ch/2021-10-28/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] Linux의 메모리 보호 기법</title>
      <link>https://hackyboiz.github.io/2021/10/27/y00n_nms/linux-mitigation/</link>
      <guid>https://hackyboiz.github.io/2021/10/27/y00n_nms/linux-mitigation/</guid>
      <pubDate>Wed, 27 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC; &amp;#xBCF4;&amp;#xD638; &amp;#xAE30;&amp;#xBC95;&amp;#xC740; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810; &amp;#xC790;&amp;#xCCB4;&amp;#xB97C; &amp;#xBCF4;&amp;#xC644;&amp;#xD</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xBA54;&#xBAA8;&#xB9AC; &#xBCF4;&#xD638; &#xAE30;&#xBC95;&#xC740; &#xCDE8;&#xC57D;&#xC810; &#xC790;&#xCCB4;&#xB97C; &#xBCF4;&#xC644;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2CC; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD1B5;&#xD55C; &#xACF5;&#xACA9;(exploit)&#xC744; &#xB9C9;&#xB294; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;. </p><p><code>checksec.sh</code> &#xB610;&#xB294; <code>checksec</code> &#xBA85;&#xB839;&#xC5B4;&#xB85C; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xC5D0; &#xC124;&#xC815;&#xB41C; &#xBCF4;&#xD638; &#xAE30;&#xBC95;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p><p><img src="/2021/10/27/y00n_nms/linux-mitigation/image.png" alt="image"></p><ul><li><strong>RELRO(RELocation Read-Only)</strong></li></ul><p>RELRO&#xC5D0;&#xB294; <code>Partial RELRO</code> , <code>FULL RELRO</code> &#xC124;&#xC815;&#xC774; &#xC788;&#xC73C;&#xBA70; ELF &#xBC14;&#xC774;&#xB108;&#xB9AC; / &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xB370;&#xC774;&#xD130; &#xC601;&#xC5ED;&#xC5D0; Read-Only &#xAD8C;&#xD55C;&#xC744; &#xC124;&#xC815;&#xD574; Write &#xD560; &#xC218; &#xC5C6;&#xAC8C; &#xD558;&#xC5EC; &#xBA54;&#xBAA8;&#xB9AC;&#xAC00; &#xBCC0;&#xACBD;&#xB418;&#xB294; &#xAC83;&#xC744; &#xB9C9;&#xB294; &#xBCF4;&#xD638; &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xACB0;&#xB860;&#xC801;&#xC73C;&#xB85C; Partial RELRO&#xC77C; &#xB54C;&#xB294; GOT Overwrite&#xAC00; &#xAC00;&#xB2A5;&#xD558;&#xACE0;, FULL RELRO&#xC77C; &#xB54C;&#xB294; GOT Overwrite&#xAC00; &#xBD88;&#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p><p><strong>Partial RELRO</strong>&#xB294; <code>.ctors(.init_array)</code>, <code>.dtors(.fini_array)</code>, <code>.jcr</code>, <code>.dynamic</code> &#xC601;&#xC5ED;&#xC774; Read-Only&#xBA70;, <code>.got.plt</code>, <code>.data</code>, <code>.bss</code> &#xC601;&#xC5ED;&#xC5D0;&#xB294; Write &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><strong>Full RELRO</strong>&#xB294; <code>.data</code>, <code>.bss</code> &#xC601;&#xC5ED;&#xC744; &#xC81C;&#xC678;&#xD55C; &#xBAA8;&#xB4E0; &#xC601;&#xC5ED;&#xC774; Read-Only&#xB85C; GOT Overwrite&#xAC00; &#xBD88;&#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p><ul><li><strong>Stack Canary</strong></li></ul><p>Stack Canary&#xB294; &#xD568;&#xC218;&#xC758; &#xD504;&#xB864;&#xB85C;&#xADF8;&#xC5D0;&#xC11C; SFP(Stack Frame Pointer)&#xC774;&#xC804;&#xC5D0; &#xC0BD;&#xC785;&#xB418;&#xACE0;, &#xC5D0;&#xD544;&#xB85C;&#xADF8;&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xAC12;&#xC774; &#xBCC0;&#xC870;&#xB418;&#xB294;&#xC9C0; &#xAC80;&#xC0AC;&#xD558;&#xC5EC; Return Address&#xAC00; &#xBCC0;&#xC870;&#xB418;&#xB294; &#xAC83;&#xC744; &#xB9C9;&#xB294; &#xBCF4;&#xD638; &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xD574;&#xB2F9; &#xADF8;&#xB9BC;&#xC740; Stack Buffer Overflow &#xACF5;&#xACA9;&#xC744; &#xC694;&#xC57D;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xC2E4;&#xD589; &#xD750;&#xB984; &#xBCC0;&#xACBD;&#xC744; &#xC704;&#xD574; Return Address &#xC8FC;&#xC18C;&#xB97C; &#xBCC0;&#xACBD;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; Buffer ~ SFP&#xAE4C;&#xC9C0; &#xAC12;&#xC744; &#xCC44;&#xC6B8; &#xB54C; Canary &#xAC12;&#xC774; &#xBCC0;&#xACBD;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/27/y00n_nms/linux-mitigation/image1.png" alt="image1"></p><p>Canary &#xAC12;&#xC774; &#xBCC0;&#xACBD;&#xB418;&#xBA74; <code>__stack_chk_fail()</code> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC5EC; &#x201C;stack smashing detected&#x201D; &#xC624;&#xB958; &#xBA54;&#xC2DC;&#xC9C0; &#xCD9C;&#xB825; &#xD6C4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xAC15;&#xC81C; &#xC885;&#xB8CC;&#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xB300;&#xD45C;&#xC801;&#xC73C;&#xB85C; &#xC6B0;&#xD68C;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC800;&#xC7A5;&#xB41C; Canary&#xAC12;&#xC744; Leak&#xD560; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xD574;&#xB2F9; &#xAC12;&#xC744; &#xADF8;&#xB300;&#xB85C; Canary&#xC5D0; &#xC785;&#xB825;&#xD558;&#xC5EC; &#xBCC0;&#xC870;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xAC83;&#xCC98;&#xB7FC; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li><strong>NX(No-eXecute)</strong></li></ul><p>&#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC5D0;&#xC11C;&#xB9CC; &#xCF54;&#xB4DC;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xAC8C; &#xD558;&#xB294; &#xBCF4;&#xD638; &#xAE30;&#xBC95;&#xC73C;&#xB85C;, &#xC2A4;&#xD0DD;, &#xD799; &#xB4F1; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC774; &#xC544;&#xB2CC; &#xC601;&#xC5ED;&#xC5D0;&#xC11C;&#xB294; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xC2DC;&#xD0AC; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC608;&#xC2DC;&#xB85C; Stack Buffer Overflow&#xC5D0;&#xC11C; &#xC2A4;&#xD0DD; &#xC601;&#xC5ED;&#xC5D0; &#xC258; &#xCF54;&#xB4DC;&#xB97C; &#xC0BD;&#xC785;&#xD558;&#xACE0; &#xD574;&#xB2F9; &#xC8FC;&#xC18C;&#xB97C; Return Address&#xC5D0; &#xC0BD;&#xC785;&#xD558;&#xC5EC; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC744; &#xBCC0;&#xACBD;&#xC2DC;&#xCF1C; &#xC258; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB358; &#xAC83;&#xC740; &#xD574;&#xB2F9; &#xC2A4;&#xD0DD;&#xC5D0; &#xC2E4;&#xD589; &#xAD8C;&#xD55C;&#xC774; &#xC788;&#xC5C8;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. NX&#xAC00; &#xC124;&#xC815;&#xB418;&#xBA74; &#xC2E4;&#xD589; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xC73C;&#xBBC0;&#xB85C; &#xC258;&#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>NX&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC00;&#xC7A5; &#xB300;&#xD45C;&#xC801;&#xC778; &#xBC29;&#xBC95;&#xC740; ROP(Return Oriented Programming)&#xC785;&#xB2C8;&#xB2E4;.</p><ul><li><strong>ASLR(Address Space Layout Randomization)</strong></li></ul><p>&#xB9E4;&#xBC88; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xAC00; &#xC2E4;&#xD589;&#xB420; &#xB54C;&#xB9C8;&#xB2E4; &#xB370;&#xC774;&#xD130; &#xC601;&#xC5ED;(&#xC2A4;&#xD0DD;, &#xD799;, &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xB4F1;)&#xC758; &#xC8FC;&#xC18C;&#xB97C; &#xB79C;&#xB364;&#xC73C;&#xB85C; &#xBCC0;&#xACBD;&#xD558;&#xC5EC; &#xC815;&#xD574;&#xC9C4; &#xC8FC;&#xC18C;&#xB97C; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xCC38;&#xACE0;&#xD558;&#xB294; &#xACF5;&#xACA9;&#xC744; &#xB9C9;&#xB294; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p><p><code>cat /proc/sys/kernel/randomize_va_space</code> &#xBA85;&#xB839;&#xC5B4;&#xB85C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70; 0&#xC740; ASLR &#xD574;&#xC81C;, 1&#xC740; &#xC2A4;&#xD0DD;, &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC; &#xB79C;&#xB364;&#xD654;, 2&#xB294; &#xC2A4;&#xD0DD;, &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;, &#xD799; &#xB79C;&#xB364;&#xD654;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xB300;&#xD45C;&#xC801;&#xC73C;&#xB85C; Buffer OverFlow &#xACF5;&#xACA9;&#xC744; &#xC218;&#xD589;&#xD560; &#xB54C; Return Address&#xC5D0; Shellcode&#xB97C; &#xC800;&#xC7A5;&#xD55C; &#xACF3;&#xC758; &#xC8FC;&#xC18C;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xB824;&#xACE0; &#xD560; &#xB54C;, &#xD574;&#xB2F9; &#xC8FC;&#xC18C;&#xAC00; &#xB9E4;&#xBC88; &#xBCC0;&#xACBD;&#xB418;&#xC5B4; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xC8FC;&#xC18C;&#xB97C; &#xCC38;&#xACE0;&#xD558;&#xC5EC; &#xACF5;&#xACA9;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xD558;&#xC9C0;&#xB9CC;, base address&#xB9CC; &#xBCC0;&#xACBD;&#xB418;&#xACE0; Offset&#xC740; &#xBCC0;&#xD558;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xBCC0;&#xACBD;&#xB41C; base address&#xB97C; &#xC54C;&#xC544;&#xB0B8;&#xB2E4;&#xBA74; Offset&#xC744; &#xB354;&#xD558;&#xC5EC; &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD574; &#xACF5;&#xACA9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><strong>PIE(Position Independent Executable)</strong>&#xC740; &#xB370;&#xC774;&#xD130; &#xC601;&#xC5ED;&#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; &#xCF54;&#xB4DC; &#xC601;&#xC5ED;&#xC5D0;&#xB3C4; ASLR&#xC774; &#xC801;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/linux/">linux</category>
      
      <category domain="https://hackyboiz.github.io/tags/y00n-nms/">y00n_nms</category>
      
      <category domain="https://hackyboiz.github.io/tags/relro/">relro</category>
      
      <category domain="https://hackyboiz.github.io/tags/canary/">canary</category>
      
      <category domain="https://hackyboiz.github.io/tags/nx/">nx</category>
      
      <category domain="https://hackyboiz.github.io/tags/aslr/">aslr</category>
      
      <category domain="https://hackyboiz.github.io/tags/pie/">pie</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/27/y00n_nms/linux-mitigation/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] WinRAR’s vulnerable trialware: when free software isn’t free</title>
      <link>https://hackyboiz.github.io/2021/10/26/fabu1ous/2021-10-26/</link>
      <guid>https://hackyboiz.github.io/2021/10/26/fabu1ous/2021-10-26/</guid>
      <pubDate>Tue, 26 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://movaxbx.ru/2021/10/21/winrars-vulnerable-trialwar</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://movaxbx.ru/2021/10/21/winrars-vulnerable-trialware-when-free-software-isnt-free/">WinRAR&#x2019;s vulnerable trialware: when free software isn&#x2019;t free</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a><strong>Target</strong></h2><p>WinRAR Version 5.70 trial</p><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a><strong>Explain</strong></h2><p>WinRAR&#xC758; &#xBB34;&#xB8CC; &#xCCB4;&#xD5D8;&#xD310;&#xC5D0;&#xC11C; &#xC6D0;&#xACA9; &#xCF54;&#xB4DC; &#xC2E4;&#xD589; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. WinRAR&#xB294; Windows &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC5D0; &#xC800;&#xC7A5;&#xB41C; &#xD30C;&#xC77C;&#xB4E4;&#xC744; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xC751;&#xC6A9;&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC73C;&#xB85C;, RAR&#xB098; ZIP&#xD30C;&#xC77C;&#xC758; &#xC0DD;&#xC131;&#xACFC; &#xC5B8;&#xD328;&#xD0B9; &#xB4F1;&#xC758; &#xAE30;&#xB2A5;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>WinRAR&#xC758; &#xBB34;&#xB8CC; &#xCCB4;&#xD5D8; &#xAE30;&#xAC04;&#xC774; &#xC885;&#xB8CC;&#xB418;&#xBA74; &#xC774;&#xB97C; &#xC54C;&#xB9AC;&#xB294; &#xBA54;&#xC138;&#xC9C0; &#xBC15;&#xC2A4;&#xAC00; &#xD654;&#xBA74;&#xC5D0; &#xB098;&#xD0C0;&#xB098;&#xB294;&#xB370;, &#xD574;&#xB2F9; &#xBA54;&#xC138;&#xC9C0; &#xBC15;&#xC2A4;&#xAC00; &#xD638;&#xCD9C;&#xD558;&#xB294; Internet Explorer instance&#xB97C; &#xD1B5;&#xD574; &#xC6D0;&#xACA9; &#xCF54;&#xB4DC; &#xC2E4;&#xD589;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xCEE4;&#xB294; &#xBA54;&#xC138;&#xC9C0; &#xBC15;&#xC2A4;&#xB97C; WinRAR&#xC758; &#xC11C;&#xBC84;&#xB85C; &#xBD80;&#xD130; &#xC601;&#xAD6C;&#xC801;&#xC73C;&#xB85C; redirection &#xC2DC;&#xD0A4;&#xACE0; &#xBC15;&#xC2A4;&#xC5D0; &#xC6D0;&#xD558;&#xB294; &#xCEE8;&#xD150;&#xCE20;&#xB97C; &#xC0BD;&#xC785;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC545;&#xC131; &#xB3C4;&#xBA54;&#xC778;&#xC73C;&#xB85C; &#xBD80;&#xD130; spoofing&#xB41C; ARP &#xD328;&#xD0B7;&#xC744; &#xD1B5;&#xD574; &#xB85C;&#xCEEC; &#xD638;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C; &#xC784;&#xC758; &#xCF54;&#xB4DC; &#xC2E4;&#xD589;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs awk">&lt;a href=<span class="hljs-string">&quot;file://10.0.12.34/applications/test.jar&quot;</span>&gt;file:<span class="hljs-regexp">//</span><span class="hljs-number">10.0</span>.<span class="hljs-number">12.34</span><span class="hljs-regexp">/applications/</span>test.jar&lt;/a&gt;&lt;br&gt;&lt;a href=<span class="hljs-string">&quot;\\\\10.0.12.34/applications/test.jar&quot;</span>&gt;\\\\<span class="hljs-number">10.0</span>.<span class="hljs-number">12.34</span><span class="hljs-regexp">/applications/</span>test.jar&lt;/a&gt;&lt;br&gt;&lt;a href=<span class="hljs-string">&quot;file://localhost/C:/windows/system32/drivers/etc/hosts&quot;</span>&gt;file:<span class="hljs-regexp">//</span>localhost<span class="hljs-regexp">/C:/</span>windows<span class="hljs-regexp">/system32/</span>drivers<span class="hljs-regexp">/etc/</span>hosts&lt;/a&gt;&lt;br&gt;&lt;a href=<span class="hljs-string">&quot;file:///C:/windows/system32/calc.exe&quot;</span>&gt;file:<span class="hljs-regexp">//</span><span class="hljs-regexp">/C:/</span>windows<span class="hljs-regexp">/system32/</span>calc.exe&lt;/a&gt;&lt;br&gt;&lt;a href=<span class="hljs-string">&quot;file:///C:\\\\windows\\\\system.ini&quot;</span>&gt;file:<span class="hljs-regexp">//</span><span class="hljs-regexp">/C:\\\\windows\\\\system.ini&lt;/</span>a&gt;&lt;br&gt;</code></pre>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/rce/">rce</category>
      
      <category domain="https://hackyboiz.github.io/tags/spoofing/">spoofing</category>
      
      <category domain="https://hackyboiz.github.io/tags/winrar/">winrar</category>
      
      <category domain="https://hackyboiz.github.io/tags/rar/">rar</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/26/fabu1ous/2021-10-26/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[Research] 퍼징 교양 수업 fuzz 101 - part3</title>
      <link>https://hackyboiz.github.io/2021/10/24/fabu1ous/fuzz-3/</link>
      <guid>https://hackyboiz.github.io/2021/10/24/fabu1ous/fuzz-3/</guid>
      <pubDate>Sun, 24 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h1 id=&quot;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&quot;&gt;&lt;a href=&quot;#&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&quot; class=&quot;headerlink&quot; title=&quot;&amp;#xBA38;&amp;#xB9BF;&amp;#xB9D0;&quot;&gt;&lt;/a&gt;&amp;#xBA38;&amp;#xB9B</description>
        
      
      
      
      <content:encoded><![CDATA[<h1 id="&#xBA38;&#xB9BF;&#xB9D0;"><a href="#&#xBA38;&#xB9BF;&#xB9D0;" class="headerlink" title="&#xBA38;&#xB9BF;&#xB9D0;"></a>&#xBA38;&#xB9BF;&#xB9D0;</h1><p><img src="/2021/10/24/fabu1ous/fuzz-3/1.png" alt></p><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;. Fabu1ous&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC800;&#xBC88; Part 2&#xC5D0;&#xC120; &#xD37C;&#xC9D5; &#xC54C;&#xACE0;&#xC9C0;&#xB984;&#xC758; 6&#xB2E8;&#xACC4;&#xC778; Preprocess, Schedule, InputGen, InputEval, ConfUpdate, Continue &#xC911; Preprocess&#xC640; Schedule&#xC744; &#xC54C;&#xC544;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBC88; Part 3&#xC5D0;&#xC120; &#xD604;&#xC7AC; iteration&#xC5D0; &#xC801;&#xC6A9; &#xC2DC;&#xD0AC; input&#xC744; &#xC0DD;&#xC131;&#xD558;&#xB294; InputGen &#xB2E8;&#xACC4;&#xB97C; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p><h1 id="5-Input-Generation"><a href="#5-Input-Generation" class="headerlink" title="5 Input Generation"></a>5 Input Generation</h1><pre><code class="hljs stylus"><span class="hljs-function"><span class="hljs-title">InputGen</span><span class="hljs-params">(conf)</span></span> &#x2192; tcs</code></pre><p><img src="/2021/10/24/fabu1ous/fuzz-3/2.png" alt></p><p>test case&#xC758; &#xB0B4;&#xC6A9;&#xC774; bug trigger&#xC5D0; &#xC9C1;&#xC811;&#xC801;&#xC778; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCE58;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; Input generation&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAE30;&#xC220;&#xC740; &#xD37C;&#xC800;&#xC758; &#xB514;&#xC790;&#xC778; &#xC120;&#xD0DD;&#xC5D0; &#xAC00;&#xC7A5;&#xD070; &#xC601;&#xD5A5;&#xC744; &#xC90D;&#xB2C8;&#xB2E4;. &#xD37C;&#xC800;&#xB294; &#xD06C;&#xAC8C; generation-base, mutation-base &#xB450;&#xAC1C;&#xB85C; &#xB098;&#xB269;&#xB2C8;&#xB2E4;. Generation-based&#xB294; PUT&#xC758; expected input&#xC5D0; &#xB300;&#xD55C; model&#xC744; &#xD1B5;&#xD574; input&#xC744; &#xC0DD;&#xC131;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; model-based fuzzer&#xB77C;&#xACE0;&#xB3C4; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;. mutation-based&#xB294; &#xC81C;&#xACF5;&#xB41C; seed&#xB97C; Mutate(&#xBCC0;&#xC870;) &#xC2DC;&#xCF1C; input&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. Seed&#xAC00; expected input space&#xB97C; &#xB300;&#xD45C;&#xD560; &#xC218; &#xC5C6;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; model-less fuzzer&#xB77C;&#xACE0; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;.</p><h2 id="5-1-Model-based"><a href="#5-1-Model-based" class="headerlink" title="5.1 Model-based"></a>5.1 Model-based</h2><p>model-based&#xB294; PUT&#xC758; expected input space&#xB97C; &#xC124;&#xBA85;&#xD558;&#xB294; model&#xB85C; &#xBD80;&#xD130; test case&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC608;&#xB97C; &#xB4E4;&#xBA74; input format&#xC744; &#xC124;&#xBA85;&#xD558;&#xB294; &#xBB38;&#xBC95;&#xC774;&#xB77C;&#xB358;&#xAC00; &#xD30C;&#xC77C; &#xD0C0;&#xC785;&#xC744; &#xC9C0;&#xCE6D;&#xD558;&#xB294; magic value&#xB4F1;&#xC774; model&#xC774; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="5-1-1-Predefined-Model"><a href="#5-1-1-Predefined-Model" class="headerlink" title="5.1.1 Predefined Model"></a>5.1.1 Predefined Model</h3><p>&#xB2E4;&#xC591;&#xD55C; &#xC885;&#xB958;&#xC758; Model-based &#xD37C;&#xC800; &#xB4E4;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xC911; &#xC0AC;&#xC804; &#xC815;&#xC758;&#xB41C; &#xBAA8;&#xB378;&#xC774;&#xB098; &#xC720;&#xC800;&#xB85C; &#xBD80;&#xD130; &#xBAA8;&#xB378;&#xC744; &#xC81C;&#xACF5;&#xBC1B;&#xB294; &#xD37C;&#xC800;&#xB4E4;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Peach, PROTOS, Dharma&#xB294; &#xC720;&#xC800;&#xB85C; &#xBD80;&#xD130; &#xBAA8;&#xB378;&#xC5D0; &#xB300;&#xD55C; &#xC0C1;&#xC138;&#xC815;&#xBCF4;&#xB97C; &#xC804;&#xB2EC; &#xBC1B;&#xC544; &#xD37C;&#xC9D5;&#xC5D0; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. Autodafe, Sulley, SPIKE, SPIKEfile&#xC740; &#xBD84;&#xC11D;&#xC774; &#xD5C8;&#xC6A9;&#xB41C; API&#xB85C; &#xBD80;&#xD130; &#xC2A4;&#xC2A4;&#xB85C; input model&#xC744; &#xB9CC;&#xB4E4;&#xACE0;,  Tavor&#xB294; Extended Bakcus-Naur Form(EBNF)&#xC5D0; &#xC801;&#xD78C; input&#xC758; &#xC0C1;&#xC138; &#xC815;&#xBCF4;&#xB97C; &#xBC1B;&#xC544; test case&#xB97C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;. &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xD37C;&#xC800;&#xB4E4; PROTOS, SNOOZE, KiF, T-Fuzz&#xB294; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC758; &#xC0C1;&#xC138; &#xC815;&#xBCF4;&#xB97C; &#xC720;&#xC800;&#xB85C; &#xBD80;&#xD130; &#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;. Kernel API &#xD37C;&#xC800;&#xB4E4;&#xC740; &#xC2DC;&#xC2A4;&#xD15C; &#xCF5C; &#xD0EC;&#xD50C;&#xB9BF;&#xC758; &#xD615;&#xD0DC;&#xB97C; &#xB744;&#xB294;&#xB370; &#xC774;&#xB7F0; &#xD0EC;&#xD50C;&#xB9BF;&#xC740; &#xC8FC;&#xB85C; &#xD2B9;&#xC815; system call&#xC774; &#xAE30;&#xB300;&#xD558;&#xB294; arguments&#xC758; &#xC218;&#xC640; &#xD0C0;&#xC785;&#xC744; &#xBA85;&#xC2DC;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xB2E4;&#xB978; model-based &#xD37C;&#xC800;&#xB294; &#xD2B9;&#xC815; &#xBB38;&#xBC95;&#xC774;&#xB098; &#xC5B8;&#xC5B4;&#xB97C; &#xBAA8;&#xB378;&#xB85C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xC5B8;&#xC5B4; &#xBAA8;&#xB378;&#xC740; &#xD37C;&#xC800; &#xB0B4;&#xC5D0;&#xC11C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; cross_fuzz&#xC640; DOMfuzz&#xB294; &#xB79C;&#xB364; Docutment Object Model (DOM) objects&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xBE44;&#xC2B7;&#xD558;&#xAC8C; jsfunfuzz&#xB294; &#xBB38;&#xBC95;&#xC5D0; &#xB9DE;&#xB294; &#xB79C;&#xB364; JavaScript &#xCF54;&#xB4DC;&#xB97C; &#xBB38;&#xBC95; &#xBAA8;&#xB378;&#xC5D0; &#xC0DD;&#xC131;&#xD558;&#xACE0; QuickFuzz&#xB294; test case &#xB97C; &#xC0DD;&#xC131;&#xD560; &#xB54C; &#xD30C;&#xC77C; &#xD3EC;&#xBA67;&#xC744; &#xC124;&#xBA85;&#xD558;&#xB294; Haskell library &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. TLS&#xC640; NFC&#xAC19;&#xC740; &#xD2B9;&#xC815; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xBAA8;&#xB378;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; TLS-Attacker, tlsfuzzer, llfuzzer&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>LangFuzz&#xB294; input&#xC73C;&#xB85C; &#xBC1B;&#xC740; seed&#xB4E4;&#xC744; &#xD30C;&#xC2F1;&#xD574; code &#xC870;&#xAC01;&#xC744; &#xC0DD;&#xC131;, &#xC0DD;&#xC131;&#xB41C; &#xC870;&#xAC01;&#xC744; &#xB79C;&#xB364;&#xC73C;&#xB85C; &#xC870;&#xD569;&#xD574;&#xC11C; seed&#xB97C; mutate &#xC2DC;&#xCF1C; testcase &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xBB38;&#xBC95;&#xC744; &#xD1B5;&#xD574; &#xC0DD;&#xC131;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD56D;&#xC0C1; syntax&#xAC00; &#xC815;&#xC0C1;&#xC801;&#xC778; &#xCF54;&#xB4DC;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294;&#xB370; js&#xB098; php&#xC5D0; &#xC801;&#xC6A9;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>BlendFuzz&#xB294; LangFuzz&#xC640; &#xBE44;&#xC2B7;&#xD55C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; xml&#xC744; &#xBAA8;&#xB378;&#xB85C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="5-1-2-Inferred-Model"><a href="#5-1-2-Inferred-Model" class="headerlink" title="5.1.2 Inferred Model"></a>5.1.2 Inferred Model</h3><p>&#xCD5C;&#xADFC;&#xC5D4; &#xC0AC;&#xC804;&#xC815;&#xC758;&#xB41C; &#xBAA8;&#xB378;&#xC774;&#xB098; &#xC720;&#xC800;&#xB85C; &#xBD80;&#xD130; &#xC81C;&#xACF5; &#xBC1B;&#xB294; &#xBAA8;&#xB378;&#xC5D0; &#xC758;&#xC874;&#xD558;&#xB294; &#xB300;&#xC2E0; infer model&#xC744; &#xC0AC;&#xC6A9;&#xD558; &#xC0AC;&#xB840;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBAA8;&#xB378; &#xCD94;&#xB860;&#xC740; instrumentation&#xACFC; &#xB3D9;&#xC77C;&#xD558;&#xAC8C; Preprocess&#xB098; ConfUpdate &#xB2E8;&#xACC4;&#xC5D0;&#xC11C; &#xC9C4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</p><p>5.1.2.1 Model inference in Preprocess</p><p>TestMiner&#xB294; literal &#xAC12;&#xC744; &#xD1B5;&#xD574; &#xC815;&#xC0C1;&#xC801;&#xC778; input&#xC744; &#xC608;&#xCE21;&#xD569;&#xB2C8;&#xB2E4;.</p><p>Skyfire&#xB294; &#xC2DC;&#xB4DC;&#xB4E4;&#xACFC; &#xBB38;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD55C; data-driven &#xBC29;&#xC2DD;&#xC73C;&#xB85C;, Probabilistic context-sensitive grammer&#xB97C; &#xCD94;&#xB860;&#xD558;&#xACE0; &#xC0C8;&#xB85C;&#xC6B4; &#xC2DC;&#xB4DC;&#xB97C; &#xB9CC;&#xB4DC;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. semantic&#xC774; &#xC720;&#xD6A8;&#xD55C; input&#xC744; &#xC0DD;&#xC131;&#xD558;&#xB294;&#xB370; &#xC9D1;&#xC911;&#xD569;&#xB2C8;&#xB2E4;.</p><p>IMF&#xB294; system API log&#xB97C; &#xBD84;&#xC11D;&#xD574; kernel API &#xBAA8;&#xB378;&#xC744; &#xD559;&#xC2B5;&#xD558;&#xACE0; &#xD2B9;&#xC815; &#xC2DC;&#xD000;&#xC2A4;&#xC758; API&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xAC8C; &#xB9CC;&#xB4DC;&#xB294; C&#xCF54;&#xB4DC;&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p><p>CodeAlchemist&#xB294; &#x201C;code brick&#x201D; &#xB2E8;&#xC704;&#xB85C; JavaScript&#xB97C; &#xBD84;&#xD574; &#xADF8;&#xC5D0; &#xB300;&#xC751;&#xD558;&#xB294; &#xC5B4;&#xC148;&#xBE14;&#xB9AC;&#xB97C; &#xACC4;&#xC0B0;&#xD558;&#xACE0; &#xC778;&#xC811;&#xD55C; brick&#xB07C;&#xB9AC;&#xC758; &#xBD84;&#xB9AC;&#xC640; &#xBCD1;&#xD569;&#xC774; &#xC758;&#xBBF8;&#xC0C1;&#xC73C;&#xB85C; &#xC720;&#xD6A8;&#xD55C;&#xC9C0; &#xAC80;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.</p><p>Neural&#xACFC; Learn&amp;Fuzz&#xB294; &#xC2E0;&#xACBD;&#xB9DD; &#xAE30;&#xBC18; &#xBA38;&#xC2E0; &#xB7EC;&#xB2DD;&#xC744; &#xD1B5;&#xD574; &#xC8FC;&#xC5B4;&#xC9C4; test file&#xB85C; &#xBAA8;&#xB378;&#xC744; &#xD559;&#xC2B5;&#xD558;&#xACE0; test case&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</p><p>5.1.2.2 Model inference in ConfUPDATE</p><p>Preprocess &#xB2E8;&#xACC4;&#xAC00; &#xC544;&#xB2C8;&#xB77C; &#xB9E4; iteration&#xC774; &#xB05D;&#xB0A0; &#xB54C; &#xB9C8;&#xB2E4; &#xBAA8;&#xB378;&#xC744; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD558;&#xB294; &#xBC29;&#xC2DD;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. PULSAR&#xB294; &#xCEA1;&#xCCD0;&#xD55C; network packet&#xC744; &#xD1B5;&#xD574; network protocol&#xC744; &#xCD94;&#xB860;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xD37C;&#xC9D5;&#xC5D0; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. state machine&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xAC01; state&#xC640; message&#xB97C; mapping&#xD558;&#xACE0; &#xC774;&#xB97C; &#xB098;&#xC911;&#xC5D0; test case &#xC0DD;&#xC131;&#xC5D0; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xBE44;&#xC2B7;&#xD55C; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; I/O &#xD589;&#xC704;&#xB97C; &#xAD00;&#xCC30;&#xD574; &#xC6F9; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xCD94;&#xB860;&#xD558;&#xB294; state machine &#xC544;&#xC774;&#xB514;&#xC5B4;&#xAC00; &#xC81C;&#xC2DC;&#xB418;&#xAE30;&#xB3C4; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. GLADE&#xB294; PUT&#xC744; &#xD37C;&#xC9D5;&#xD558;&#xAE30; &#xC704;&#xD574; I/O &#xC0D8;&#xD50C;&#xB4E4;&#xB85C; &#xBD80;&#xD130; context-free grammer&#xB97C; &#xD569;&#xC131;&#xD574;&#xC11C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; inferred &#xBB38;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p><p>go-fuzz&#xB294; grey-box fuzzer&#xB85C; seed pool&#xC5D0; seed&#xAC00; &#xCD94;&#xAC00;&#xB420; &#xB54C;&#xB9C8;&#xB2E4; &#xBAA8;&#xB378;&#xC744; &#xBE4C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xBAA8;&#xB378;&#xC740; &#xC0C8;&#xB85C;&#xC6B4; seed&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p><h3 id="5-1-3-Encoder-Model"><a href="#5-1-3-Encoder-Model" class="headerlink" title="5.1.3 Encoder Model"></a>5.1.3 Encoder Model</h3><p>&#xD37C;&#xC9D5;&#xC740; &#xD2B9;&#xC815; &#xD30C;&#xC77C; &#xD3EC;&#xBA67;&#xC744; &#xD30C;&#xC2F1;&#xD558;&#xB294; &#xB514;&#xCF54;&#xB354; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC5EC;&#xB7EC; &#xD30C;&#xC77C; &#xD3EC;&#xBA67;&#xB4E4;&#xC740; &#xC800;&#xB9C8;&#xB2E4; &#xC778;&#xCF54;&#xB354; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xACE0; &#xC774;&#xB294; &#xD574;&#xB2F9; &#xD30C;&#xC77C; &#xD3EC;&#xBA67;&#xC758; &#xC808;&#xB300;&#xC801;&#xC778; &#xBAA8;&#xB378;&#xC774;&#xB77C; &#xB9D0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>MutaGen&#xC740; &#xC774;&#xB7EC;&#xD55C; &#xC778;&#xCF54;&#xB354; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xB2F4;&#xACA8;&#xC9C4; &#xC808;&#xB300;&#xC801;&#xC778; &#xBAA8;&#xB378;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xC0C8;&#xB85C;&#xC6B4; test case&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xD37C;&#xC800;&#xC785;&#xB2C8;&#xB2E4;. &#xB2E4;&#xB978; &#xBBA4;&#xD14C;&#xC774;&#xC158; &#xAE30;&#xBC18; &#xD37C;&#xC800;&#xB4E4;&#xACFC;&#xC758; &#xCC28;&#xC774;&#xC810;&#xC740; test case&#xB97C; mutate&#xD574; &#xC0C8;&#xB85C;&#xC6B4; test case&#xB97C; &#xB9CC;&#xB4DC;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#xC778;&#xCF54;&#xB354; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; mutate&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC804;&#xCCB4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xC77C;&#xBD80;&#xB9CC; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xBA74; &#xB2F9;&#xC5F0;&#xD788; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB3D9;&#xC791;&#xC774; &#xB2EC;&#xB77C;&#xC9C8; &#xAC70;&#xB77C;&#xB294; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xC5D0;&#xC11C; &#xCD9C;&#xBC1C;&#xD574; &#xC2E4;&#xD589;&#xAC00;&#xB2A5;&#xD55C; &#xC778;&#xCF54;&#xB354;&#xC758; &#xC870;&#xAC01;&#xC744; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p><h2 id="5-2-Model-less-Fuzzer-mutation-based-fuzzer"><a href="#5-2-Model-less-Fuzzer-mutation-based-fuzzer" class="headerlink" title="5.2 Model-less Fuzzer (mutation-based fuzzer)"></a>5.2 Model-less Fuzzer (mutation-based fuzzer)</h2><p>&#xACE0;&#xC804;&#xC801;&#xC778; &#xB79C;&#xB364; &#xD14C;&#xC2A4;&#xD2B8;&#xB294; &#xD2B9;&#xC815; path &#xC0C1;&#xD669;&#xC744; &#xB9CC;&#xC871;&#xD558;&#xB294; test case&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294;&#xB370; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. if (input == 42)&#xB77C;&#xB294; C &#xAD6C;&#xBB38;&#xC774; &#xC788;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD558;&#xBA74; input&#xC774; 32-bit integer&#xB77C;&#xACE0; &#xD560;&#xB54C; &#xB79C;&#xB364;&#xD558;&#xAC8C; input&#xC744; &#xC815;&#xD574; &#xB9DE;&#xCD9C; &#xD655;&#xB960;&#xC740; 1/2^32&#xC785;&#xB2C8;&#xB2E4;. MP3 &#xD30C;&#xC77C; &#xCC98;&#xB7FC; &#xC798;&#xC9DC;&#xC5EC;&#xC9C4; input&#xC758; &#xACBD;&#xC6B0;, &#xC0C1;&#xD669;&#xC740; &#xB354;&#xC6B1; &#xC548;&#xC88B;&#xACA0;&#xC8E0;? &#xC758;&#xBBF8; &#xC788;&#xB294; &#xC2DC;&#xAC04;&#xB0B4;&#xB85C; &#xC628;&#xC804;&#xD55C; mp3&#xD30C;&#xC77C;&#xC744; &#xB79C;&#xB364; &#xC0DD;&#xC131;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC740; &#xB9D0;&#xC774; &#xC548;&#xB429;&#xB2C8;&#xB2E4;. &#xC989;, &#xB79C;&#xB364; &#xD14C;&#xC2A4;&#xD2B8;&#xB85C;&#xB294; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD30C;&#xC2F1; &#xB2E8;&#xACC4; &#xBCF4;&#xB2E4; &#xB354; &#xAE4A;&#xC219;&#xD55C; path&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xAE30; &#xD798;&#xB4ED;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; seed-based &#xC778;&#xD48B; &#xC0DD;&#xC131;&#xACFC; white-box &#xC778;&#xD48B; &#xC0DD;&#xC131;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xB300;&#xBD80;&#xBD84;&#xC758; Model-less &#xD37C;&#xC800;&#xB294; PUT&#xC758; &#xC778;&#xD48B;&#xC774; &#xB418;&#xB294; seed&#xB97C; &#xBCC0;&#xC870;&#xD574; test case&#xB97C; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xD30C;&#xC77C;, &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD328;&#xD0B7;, UI &#xC774;&#xBCA4;&#xD2B8; &#xC2DC;&#xD000;&#xC2A4; &#xB4F1;&#xC774; seed&#xB85C; &#xC4F0;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. seed&#xC758; &#xC77C;&#xBD80;&#xB9CC;&#xC744; &#xBCC0;&#xC870;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xC720;&#xD6A8;&#xD558;&#xBA74;&#xC11C;&#xB3C4; crash&#xB4F1;&#xC744; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0AC; &#xBE44;&#xC815;&#xC0C1;&#xC801;&#xC778; &#xAC12;&#xC744; &#xD3EC;&#xD568;&#xD55C; input&#xC744; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>seed&#xB97C; Mutate &#xD558;&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="5-2-1-Bit-Flipping"><a href="#5-2-1-Bit-Flipping" class="headerlink" title="5.2.1 Bit-Flipping"></a>5.2.1 Bit-Flipping</h3><p>bit-flipping&#xC740; &#xB9CE;&#xC740; model-less &#xD37C;&#xC800;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBCF4;&#xD3B8;&#xC801;&#xC778; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;. &#xACE0;&#xC815;&#xB41C; &#xAE38;&#xC774;&#xC758; bit&#xB97C; flip&#xD558;&#xAC70;&#xB098; flip&#xD560; &#xAE38;&#xC774;&#xB97C; &#xB79C;&#xB364;&#xC73C;&#xB85C; &#xC815;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBA87;&#xBA87; &#xD37C;&#xC800;&#xB4E4;&#xC740; seed&#xB97C; mutate &#xD560; &#xB54C; mutation-ratio&#xC640; &#xAC19;&#xC740; user-configurable parameter&#xB97C; &#xBC1B;&#xC544; InputGen &#xD55C;&#xBC88; &#xB2F9; flip&#xD560; &#xBE44;&#xD2B8; &#xC218;&#xB97C; &#xC815;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; N-bit &#xD06C;&#xAE30;&#xC758; seed&#xC5D0;&#xC11C; K-bit &#xB9CC;&#xD07C; &#xB79C;&#xB364;&#xD558;&#xAC8C; flip&#xD560;&#xB54C; mutation-ratio&#xB294; K/N&#xC774; &#xB429;&#xB2C8;&#xB2E4;. SymFuzz&#xB294; &#xD37C;&#xC9D5; &#xD6A8;&#xC728;&#xC740; &#xC774; mutation-ratio&#xC5D0; &#xBBFC;&#xAC10;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;. &#xBAA8;&#xB4E0; PUT&#xC5D0; &#xC801;&#xD569;&#xD55C; ratio &#xB530;&#xC708; &#xC5C6;&#xB294;&#xB370;, &#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xC88B;&#xC740; mutation-ratio&#xB97C; &#xCC3E;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xBB50;&#xAC00; &#xC788;&#xC744;&#xAE4C;&#xC694;?</p><p>BFF&#xC640; FOE&#xB294; mutation-ratio &#xC9D1;&#xD569;&#xC758; &#xC9C0;&#xC218; &#xBD84;&#xD3EC;&#xB97C; &#xD1B5;&#xD574; &#xD1B5;&#xACC4;&#xC801;&#xC73C;&#xB85C; &#xD6A8;&#xC728;&#xC801;&#xC778; ratio&#xC5D0; &#xB354; &#xB9CE;&#xC740; iteration&#xC744; &#xD560;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</p><p>SymFuzz&#xB294; white-box &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xAC01; &#xC2DC;&#xB4DC;&#xBCC4; &#xC801;&#xC808;&#xD55C; mutation-raito&#xB97C; &#xCD94;&#xB860;&#xD558;&#xACE0; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="5-2-2-Arithmetic-Mutation"><a href="#5-2-2-Arithmetic-Mutation" class="headerlink" title="5.2.2 Arithmetic Mutation"></a>5.2.2 Arithmetic Mutation</h3><p>AFL&#xACFC; honggfuzz&#xB294; mutate&#xD560; &#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xC120;&#xD0DD;&#xD574; integer&#xB85C; &#xCDE8;&#xAE09;&#xD558;&#xACE0; &#xC0B0;&#xC220; &#xC5F0;&#xC0B0;&#xC744; &#xD1B5;&#xD574; &#xD574;&#xB2F9; &#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xBCC0;&#xC870;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xB54C; mutation&#xC758; &#xC601;&#xD5A5;&#xC744; &#xC81C;&#xD55C;&#xD558;&#xB294; &#xAC83;&#xC774; &#xD575;&#xC2EC;&#xC785;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; AFL&#xC740; seed&#xC5D0;&#xC11C; 4byte&#xB97C; &#xC120;&#xD0DD;&#xD574; &#xB79C;&#xB364; &#xC0DD;&#xC131;&#xB41C; integer&#xC640; &#xB367;&#xC148; &#xD639;&#xC740; &#xBE84;&#xC148;&#xC744; &#xD574;&#xC11C; mutate&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xB79C;&#xB364; &#xC0DD;&#xC131;&#xB418;&#xB294; integer&#xC758; &#xBC94;&#xC704;&#xB294; fuzzer&#xB9C8;&#xB2E4; &#xB2E4;&#xB974;&#xACE0; user-configurable &#xAC12;&#xC778; &#xACBD;&#xC6B0;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. AFL&#xC758; &#xACBD;&#xC6B0;&#xC5D4; &#xC774; &#xBC94;&#xC704;&#xAC00; 0~35&#xC785;&#xB2C8;&#xB2E4;.</p><h3 id="5-2-3-Block-based-Mutation"><a href="#5-2-3-Block-based-Mutation" class="headerlink" title="5.2.3 Block-based Mutation"></a>5.2.3 Block-based Mutation</h3><p>&#xBA87;&#xAC00;&#xC9C0; block-based mutation &#xBC29;&#xBC95;&#xB860;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. block&#xC740; seed&#xC758; byte &#xC2DC;&#xD000;&#xC2A4;&#xB97C; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</p><ol><li>&#xBE14;&#xB85D;&#xC744; seed&#xC758; &#xC784;&#xC758; &#xC704;&#xCE58;&#xC5D0; &#xC0BD;&#xC785;</li><li>seed&#xC5D0;&#xC11C; &#xC784;&#xC758;&#xC758; &#xBE14;&#xB85D;&#xC744; &#xC0AD;&#xC81C;</li><li>seed&#xC5D0;&#xC11C; &#xC784;&#xC758;&#xC758; &#xBE14;&#xB85D; &#xAD50;&#xCCB4;</li><li>&#xC5EC;&#xB7EC; &#xBE14;&#xB85D;&#xC758; &#xC21C;&#xC11C;&#xB97C; &#xC7AC;&#xBC30;&#xCE58;</li><li>&#xC784;&#xC758;&#xC758; &#xBE14;&#xB85D; &#xD06C;&#xAE30; resize &#xBC0F; &#xC0C8;&#xB85C;&#xC6B4; &#xBE14;&#xB85D; &#xCCA8;&#xAC00;</li></ol><h3 id="5-2-4-Dictionary-based-Mutation"><a href="#5-2-4-Dictionary-based-Mutation" class="headerlink" title="5.2.4 Dictionary-based Mutation"></a>5.2.4 Dictionary-based Mutation</h3><p>&#xC758;&#xBBF8; &#xAC00;&#xC911;&#xCE58;&#xAC00; &#xB192;&#xC740; &#xC0C1;&#xC218;&#xAC12;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD37C;&#xC800;&#xB3C4; &#xC874;&#xC7AC;&#xD568;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; 0 &#xD639;&#xC740; -1, &#xD3EC;&#xBA67;&#xC2A4;&#xD2B8;&#xB9C1;&#xB4F1;&#xC774; mutation&#xC758; &#xB300;&#xC0C1;&#xC774; &#xB41C;&#xB2E4;. AFL&#xACFC; honggfuzz, libfuzzer&#xB294; 0&#xACFC; -1, &#xADF8;&#xB9AC;&#xACE0; 1&#xB4F1;&#xC758; &#xAC12;&#xC744; &#xC0AC;&#xC6A9;&#xD574; Integer&#xB97C; mutation&#xD569;&#xB2C8;&#xB2E4;. Radamsa&#xB294; unicode&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0;, GPF&#xB294; %x, %s &#xB4F1; &#xD3EC;&#xBA67; &#xBB38;&#xC790;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xBB38;&#xC790;&#xC5F4;&#xC744; mutate&#xD569;&#xB2C8;&#xB2E4;.</p><h2 id="5-3-White-box-Fuzzers"><a href="#5-3-White-box-Fuzzers" class="headerlink" title="5.3 White-box Fuzzers"></a>5.3 White-box Fuzzers</h2><p>white-box fuzzer &#xB610;&#xD55C; model-based&#xC640; model-less&#xB85C; &#xBD84;&#xB958;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; dynamic symbolic execution&#xACFC; mutation &#xAE30;&#xBC18; &#xD37C;&#xC800;&#xB294; &#xBAA8;&#xB378;&#xC774; &#xD544;&#xC694; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC77C;&#xBD80; symbolic executor&#xB294; input grammer&#xB85C; symbolic executor&#xB97C; &#xAC00;&#xC774;&#xB4DC; &#xD558;&#xB294; &#xB4F1; input model&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;. &#xB9CE;&#xC740; white-box &#xD37C;&#xC800;&#xB4E4;&#xC774; test case&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xAE30; &#xC704;&#xD574; dynamic symbolic execution&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0;&#xB9CC;, &#xBAA8;&#xB4E0; white-box fuzzer&#xB4E4;&#xC774; dynamic symbolic executor&#xC778; &#xAC83;&#xC740; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xC77C;&#xBD80; &#xD37C;&#xC800;&#xB4E4;&#xC740; white-box &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; PUT&#xC774; &#xC218;&#xC6A9;&#xD558;&#xB294; input&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC5BB;&#xC5B4; &#xC774;&#xB97C; &#xD1B5;&#xD574; black-box, grey-box &#xD37C;&#xC9D5;&#xC744; &#xC218;&#xD589;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="5-3-1-Dynamic-Symbolic-Execution"><a href="#5-3-1-Dynamic-Symbolic-Execution" class="headerlink" title="5.3.1 Dynamic Symbolic Execution"></a>5.3.1 Dynamic Symbolic Execution</h3><p>high level&#xC5D0;&#xC11C;&#xC758; &#xACE0;&#xC804;&#xC801; symbolic execution&#xC740; &#xBAA8;&#xB4E0; &#xAC00;&#xC9C0;&#xC218;&#xC758; input&#xC744; &#xC758;&#xBBF8;&#xD558;&#xB294; &#xBBF8;&#xC9C0;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. PUT&#xC744; &#xC2E4;&#xD589;&#xD558;&#xBA74;&#xC11C; &#xC0C1;&#xC218;&#xAC12;&#xC744; &#xD3C9;&#xAC00;&#xD558;&#xB294; &#xB300;&#xC2E0; symbolic expression&#xC744; &#xBE4C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;. &#xC870;&#xAC74; &#xBD84;&#xAE30;&#xBB38;&#xC5D0; &#xB3C4;&#xB2EC;&#xD560; &#xB54C; &#xB9C8;&#xB2E4; &#xB450;&#xAC1C;&#xC758; sybolic interpreter&#xB97C; fork&#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xB098;&#xB294; true, &#xB2E4;&#xB978; &#xD558;&#xB098;&#xB294; false branch&#xC5D0; &#xB3C4;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xBAA8;&#xB4E0; path&#xB9C8;&#xB2E4; sybolic interpreter&#xB294; path formula&#xB97C; &#xBE4C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;. &#xD558;&#xB098;&#xC758; concrete input&#xC774; &#xC6D0;&#xD558;&#xB294; path&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xBA74; path fomula&#xB294; &#xC801;&#xD569;&#xD558;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;. SMT solver&#xC5D0; path fomula&#xC5D0; &#xB300;&#xD55C; &#xD574;&#xB2F5;&#xC744; &#xC694;&#xCCAD;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; concrete input&#xC744; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Dynamic symbolic execution&#xC740; symbolic execution&#xACFC; concrete execution&#xC774; &#xB3D9;&#xC2DC;&#xC5D0; &#xC9C4;&#xD589;&#xB41C;&#xB2E4;&#xB294; &#xC810;&#xC5D0;&#xC11C; &#xC804;&#xD1B5;&#xC801;&#xC778; symbolic execution&#xACFC; &#xCC28;&#xC774;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; dynmaic symbolic execution&#xC744; concolic ( concrete + symbolic ) testing&#xC774;&#xB77C;&#xACE0;&#xB3C4; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;. &#xD575;&#xC2EC; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB294; concrete execution state&#xAC00; symbolic constraints&#xC758; &#xBCF5;&#xC7A1;&#xB3C4;&#xB97C; &#xAC10;&#xC18C;&#xD558;&#xB294;&#xB370; &#xB3C4;&#xC6C0;&#xC774; &#xB41C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xD37C;&#xC9D5; &#xB9D0;&#xACE0;&#xB3C4; dynamic synbolic execution&#xB294; &#xC5EC;&#xB7EC; &#xACF3;&#xC5D0; &#xC801;&#xC6A9; &#xB418;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Dynamic symbolic exection&#xC740; PUT&#xC758; &#xBAA8;&#xB4E0; Instruction &#xD558;&#xB098;&#xD558;&#xB098; instrument&#xD558;&#xACE0; &#xBD84;&#xC11D;&#xD574;&#xC57C;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; grey-box, black-box &#xBCF4;&#xB2E4; &#xB290;&#xB9BD;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xB192;&#xC740; &#xBE44;&#xC6A9;&#xC744; &#xAC10;&#xB2F9;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC881;&#xC740; &#xBC94;&#xC704;&#xC5D0;&#xB9CC; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC804;&#xB7B5;&#xC774; &#xB300;&#xD45C;&#xC801;&#xC785;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; &#xC720;&#xC800;&#xAC00; &#xD2B9;&#xC815; &#xCF54;&#xB4DC;&#xB97C; &#xC801;&#xC6A9; &#xBC94;&#xC704;&#xC5D0;&#xC11C; &#xC81C;&#xC678; &#xC2DC;&#xD0A8;&#xB2E4;&#xB358;&#xAC00;, grey-box &#xD37C;&#xC9D5;&#xACFC; concolic testing&#xC744; &#xBC88;&#xAC08;&#xC544;&#xAC00;&#xBA70; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Driller&#xC640; Cyberdyne&#xC740; &#xBE60;&#xB978; concolic execution engine&#xC744; &#xAD6C;&#xD604;&#xD574; grey-box&#xC640; white-box &#xD37C;&#xC9D5;&#xC744; &#xD569;&#xCCE4;&#xC2B5;&#xB2C8;&#xB2E4;. DigFuzz&#xB294; grey-box&#xC640; white-box&#xD37C;&#xC9D5;&#xC744; &#xAD50;&#xB300;&#xD558;&#xBA70; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC744; &#xCD5C;&#xC801;&#xD654;&#xD588;&#xB294;&#xB370;, &#xC6B0;&#xC120; grey-box&#xB85C; &#xAC01; path &#xBCC4; &#xB3C4;&#xB2EC; &#xD655;&#xB960;&#xC744; &#xACC4;&#xC0B0;&#xD558;&#xACE0;, &#xADF8;&#xC911; grey-box&#xB85C; &#xB3C4;&#xB2EC;&#xD558;&#xAE30; &#xAC00;&#xC7A5; &#xD798;&#xB4E0; path&#xB4E4;&#xC740; white-box&#xAC00; &#xACF5;&#xB7B5;&#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="5-3-2-Guided-Fuzzing"><a href="#5-3-2-Guided-Fuzzing" class="headerlink" title="5.3.2 Guided Fuzzing"></a>5.3.2 Guided Fuzzing</h3><p>&#xC77C;&#xBD80; &#xD37C;&#xC800;&#xB4E4;&#xC740; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xACFC; &#xB3D9;&#xC801;&#xBD84;&#xC11D; &#xAE30;&#xC220;&#xC744; &#xD1B5;&#xD574; &#xD37C;&#xC9D5;&#xC758; &#xD6A8;&#xC728;&#xC744; &#xB192;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xAE30;&#xC220;&#xB4E4;&#xC740; &#xB450; &#xB2E8;&#xACC4;&#xB97C; &#xAC70;&#xCE58;&#xB294;&#xB370;, &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ol><li>PUT&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC5BB;&#xB294; &#xBE44;&#xC6A9; &#xB192;&#xC740; &#xC791;&#xC5C5;</li><li>&#xC774;&#xC804; &#xB2E8;&#xACC4;&#xB85C; &#xBD80;&#xD130; &#xC5BB;&#xC740; &#xC815;&#xBCF4;&#xB97C; &#xD1A0;&#xB300;&#xB85C; test case&#xB97C; &#xC0DD;&#xC131;</li></ol><p>TaintScope&#xB294; fine-grained taint analysis&#xB97C; &#xD1B5;&#xD574; &#xCE58;&#xBA85;&#xC801;&#xC778; system call&#xC774;&#xB098; API&#xC5D0; &#xD758;&#xB7EC;&#xB4E4;&#xC5B4;&#xAC00;&#xB294; &#xB370;&#xC774;&#xD130;, &#x201C;Hot bytes&#x201D;&#xB97C; &#xCC3E;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Dowser&#xB294; &#xCEF4;&#xD30C;&#xC77C; &#xB3C4;&#xC911; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; heuristic &#xC0C1; &#xBC84;&#xADF8;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xC744; &#xB9CC;&#xD55C; loop(&#xC608;&#xB97C; &#xB4E4;&#xBA74;Pointer derefernce&#xB97C; &#xD3EC;&#xD568;&#xD55C; loop)&#xB97C; &#xCC3E;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; taint analysis&#xB97C; &#xD1B5;&#xD574; input bytes&#xC640; loop&#xB4E4; &#xC0AC;&#xC774;&#xC758; &#xAD00;&#xACC4;&#xB97C; &#xACC4;&#xC0B0;&#xD569;&#xB2C8;&#xB2E4;. &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; ciritical bytes&#xB9CC;&#xC744; symbolic&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4; dynamic symbolic execution&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p><p>VUzzer&#xC640; GRT&#xB294; input generation&#xC744; &#xAC00;&#xC774;&#xB4DC; &#xD558;&#xAE30; &#xC704;&#xD55C; PUT&#xC758; data-flow&#xC815;&#xBCF4;&#xB97C; &#xC5BB;&#xAE30; &#xC704;&#xD574; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xACFC; &#xB3D9;&#xC801; &#xBD84;&#xC11D; &#xB458; &#xB2E4; &#xC0AC;&#xC6A9;&#xD574; &#xC5BB;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Angora &#xC640; Read Queen&#xB294; &#xCC98;&#xC74C;&#xC5D4; &#xB192;&#xC740; &#xBE44;&#xC6A9;&#xC744; &#xC9C0;&#xBD88;&#xD558;&#xBA70; instrumentaion&#xC744; &#xC218;&#xD589;&#xD558;&#xACE0; Input&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xC5BB;&#xC740; &#xC815;&#xBCF4;&#xB97C; &#xD1A0;&#xB300;&#xB3C4; &#xC11C;&#xC11C;&#xD788; instrumentation&#xC758; &#xBE44;&#xC6A9;&#xC744; &#xC904;&#xC774;&#xACE0; hot bytes &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB97C; &#xC218;&#xC6A9;&#xD574; taint analysis&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="5-3-3-PUT-Mutation"><a href="#5-3-3-PUT-Mutation" class="headerlink" title="5.3.3 PUT Mutation"></a>5.3.3 PUT Mutation</h3><p>Fuzzing&#xC744; &#xC2E4;&#xC6A9;&#xC801;&#xC778; &#xBB38;&#xC81C;&#xC911; &#xD558;&#xB098;&#xB294; &#xBC14;&#xB85C; checksum &#xAC80;&#xC0AC;&#xB97C; &#xD1B5;&#xD654;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xBA74; PUT&#xC774; input&#xC744; &#xD30C;&#xC2F1;&#xD558;&#xAE30; &#xC804;&#xC5D0; checksum&#xC744; &#xACC4;&#xC0B0;&#xD55C;&#xB2E4;&#xBA74; PUT&#xC740; &#xB9CE;&#xC740; &#xC218;&#xC758; test case&#xB97C; &#xAC70;&#xBD80;&#xD560;  &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; TaintScope&#xB294; checksum-aware fuzzing &#xAE30;&#xC220;&#xC744; &#xC81C;&#xC548;&#xD569;&#xB2C8;&#xB2E4;. taint analysis&#xB97C; &#xD1B5;&#xD574; checksum test instruction&#xC744; &#xAD6C;&#xBCC4;&#xD558;&#xACE0; PUT&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xD328;&#xCE58;&#xD574; checksum &#xAC80;&#xC0AC;&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; crash&#xB97C; &#xCC3E;&#xC558;&#xB2E4;&#xBA74; &#xCF54;&#xB4DC; &#xD328;&#xCE58; &#xC804; PUT&#xC758; &#xC633;&#xBC14;&#xB978; checksum&#xC744; &#xACC4;&#xC0B0;&#xD574; Input&#xC744; &#xC218;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. T-Fuzz&#xB294; grey-box &#xD37C;&#xC9D5;&#xC744; &#xD1B5;&#xD574; &#xC5B4;&#xB5A0;&#xD55C; &#xC885;&#xB958;&#xC758; &#xC870;&#xAC74;&#xBD80; branch&#xB77C;&#xB3C4; &#xD1B5;&#xACFC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xC120; NCC (Non-Critical Cehcks: &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB85C;&#xC9C1;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xC9C0; &#xC54A;&#xACE0; &#xD328;&#xCE58;&#xD560; &#xC218; &#xC788;&#xB294; branch&#xB4E4;)&#xB97C; &#xBE4C;&#xB4DC;&#xD569;&#xB2C8;&#xB2E4;. fuzzing campaign&#xC774; &#xC0C8;&#xB85C;&#xC6B4; Path&#xB97C; &#xB354;&#xC774;&#xC0C1; &#xCC3E;&#xC9C0; &#xBABB;&#xD558;&#xBA74; NCC&#xB97C; &#xD558;&#xB098; &#xC120;&#xD0DD;&#xD574; PUT&#xC744; &#xBCC0;&#xC870;&#xD558;&#xACE0; fuzzing&#xC744; &#xC7AC;&#xAC1C;&#xD569;&#xB2C8;&#xB2E4;.</p><h1 id="&#xB9C8;&#xCE58;&#xBA70;"><a href="#&#xB9C8;&#xCE58;&#xBA70;" class="headerlink" title="&#xB9C8;&#xCE58;&#xBA70;"></a>&#xB9C8;&#xCE58;&#xBA70;</h1><p><img src="/2021/10/24/fabu1ous/fuzz-3/3.png" alt></p><p>&#xC774;&#xBC88; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C; InputGen &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; InputEval &#xB2E8;&#xACC4;&#xAE4C;&#xC9C0; &#xB2E4;&#xB8F0; &#xC608;&#xC815;&#xC774;&#xC5C8;&#xC73C;&#xB098; &#xC544;&#xC27D;&#xAC8C;&#xB3C4; InputGen&#xAE4C;&#xC9C0;&#xB9CC; &#xC791;&#xC131;&#xD558;&#xAC8C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC800;&#xB9CC;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#xC694;&#xC998; hackyboiz &#xD300;&#xC6D0; &#xBAA8;&#xB450;&#xAC00; &#xC815;&#xC2E0; &#xC5C6;&#xC774; &#xC0B4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC65C; &#xC5F0;&#xB9D0;&#xB9CC; &#xB418;&#xBA74; &#xBC14;&#xC05C; &#xAC78;&#xAE4C;&#xC694;? &#xC544;&#xBB34;&#xD2BC; &#xB2E4;&#xC74C; Part&#xC5D0;&#xC120; &#xB098;&#xBA38;&#xC9C0; InputEval, ConfUpdate, Continue&#xB97C; &#xB2E4;&#xB8E8;&#xACE0; &#xC2DC;&#xB9AC;&#xC988;&#xB97C; &#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;!</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Research/">Research</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/fuzzing/">fuzzing</category>
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/fuzzer/">fuzzer</category>
      
      <category domain="https://hackyboiz.github.io/tags/servey/">servey</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/24/fabu1ous/fuzz-3/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] RPC(Remote Procedure Call)</title>
      <link>https://hackyboiz.github.io/2021/10/22/poosic/rpc/</link>
      <guid>https://hackyboiz.github.io/2021/10/22/poosic/rpc/</guid>
      <pubDate>Fri, 22 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;RPC(Remote Procedure Call) &amp;#xCEE8;&amp;#xD2B8;&amp;#xB864;&amp;#xC744; &amp;#xC704;&amp;#xD55C; &amp;#xCF54;&amp;#xB529; &amp;#xC5C6;&amp;#xC774;  &amp;#xB2E4;&amp;#xB978; &amp;#xACF5;</description>
        
      
      
      
      <content:encoded><![CDATA[<p>RPC(Remote Procedure Call) &#xCEE8;&#xD2B8;&#xB864;&#xC744; &#xC704;&#xD55C; &#xCF54;&#xB529; &#xC5C6;&#xC774;  &#xB2E4;&#xB978; &#xACF5;&#xAC04;&#xC5D0; &#xD568;&#xC218; &#xD639;&#xC740; &#xD504;&#xB85C;&#xC2DC;&#xC800;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xD1B5;&#xC2E0; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;. &#xC989;, &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC811;&#xADFC;&#xD574; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xD504;&#xB85C;&#xC2DC;&#xC800;&#xB098; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD574; &#xC790;&#xC2E0;&#xC758; &#xAC83;&#xCC98;&#xB7FC; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xAE30;&#xC220;&#xC774;&#xB77C;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="&#xC65C;-&#xAC1C;&#xBC1C;&#xB418;&#xC5C8;&#xC744;&#xAE4C;&#xC694;"><a href="#&#xC65C;-&#xAC1C;&#xBC1C;&#xB418;&#xC5C8;&#xC744;&#xAE4C;&#xC694;" class="headerlink" title="&#xC65C; &#xAC1C;&#xBC1C;&#xB418;&#xC5C8;&#xC744;&#xAE4C;&#xC694;?"></a><strong>&#xC65C; &#xAC1C;&#xBC1C;&#xB418;&#xC5C8;&#xC744;&#xAE4C;&#xC694;?</strong></h3><p>&#xD56D;&#xC0C1; &#x2018;&#xC65C; &#xB098;&#xC628; &#xAC70;&#xC9C0;?&#x2019;&#xB77C;&#xB294; &#xC758;&#xBB38;&#xC5D0; &#xB300;&#xD55C; &#xB2F5;&#xC740; &#xAE30;&#xB2A5; &#xADF8; &#xC790;&#xCCB4;&#xC5D0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC778;&#xD130;&#xB137;&#xC774; &#xB4F1;&#xC7A5;&#xD558;&#xBA70; &#xC0AC;&#xB78C;&#xB4E4;&#xC740; &#x2018;&#xC5EC;&#xB7EC; &#xCEF4;&#xD4E8;&#xD130;&#xB97C; &#xBB36;&#xC5B4; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xC744;&#xAE4C;?&#x2019;&#xB77C;&#xB294; &#xC758;&#xBB38;&#xC744; &#xAC00;&#xC9C0;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xACE0; &#xC774;&#xB85C;&#xBD80;&#xD130; &#xC5EC;&#xB7EC; &#xCEF4;&#xD4E8;&#xD130;&#xB4E4;&#xC774; &#xC5F0;&#xACB0;&#xB418;&#xC5B4; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBD84;&#xC0B0; &#xCEF4;&#xD4E8;&#xD305; &#xAE30;&#xC220;&#xC774; &#xBC1C;&#xB2EC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; RPC&#xB294; &#xBD84;&#xC0B0; &#xCEF4;&#xD4E8;&#xD305; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC04; &#xC0C1;&#xD638; &#xD1B5;&#xC2E0; &#xBC0F; &#xCEF4;&#xD4E8;&#xD305; &#xC790;&#xC6D0;&#xC758; &#xD6A8;&#xC728;&#xC801;&#xC778; &#xC0AC;&#xC6A9;&#xC744; &#xC704;&#xD574; &#xBC1C;&#xC804;&#xB41C; &#xAE30;&#xC220;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xD604;&#xC7AC; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xC791;&#xACE0;, &#xB3C5;&#xB9BD;&#xC801;&#xC73C;&#xB85C; &#xBC30;&#xD3EC; &#xAC00;&#xB2A5;&#xD55C; &#xAC01;&#xAC01;&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xC11C;&#xBE44;&#xC2A4;&#xB85C; &#xAD6C;&#xC131;&#xB41C; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xC778; MSA(Micro Service Architecture &#xD615;&#xD0DC;&#xB85C; &#xAC1C;&#xBC1C;&#xB418;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774; &#xACBD;&#xC6B0; RPC&#xB97C; &#xC774;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="&#xC791;&#xB3D9;&#xACFC;&#xC815;"><a href="#&#xC791;&#xB3D9;&#xACFC;&#xC815;" class="headerlink" title="&#xC791;&#xB3D9;&#xACFC;&#xC815;"></a>&#xC791;&#xB3D9;&#xACFC;&#xC815;</h3><p>&#xC774;&#xC81C; RPC&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xC2DC;&#xC800;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xAC04;&#xB2E8;&#xD788; &#xC0B4;&#xD3B4; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/22/poosic/rpc/image1.png" alt></p><ol><li>Client&#xCE21;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xC2DC;&#xC800; &#xD638;&#xCD9C;&#xC744; &#xC704;&#xD55C; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;(parameter)&#xC744; <code>Client stub</code>&#xC5D0; &#xC804;&#xB2EC;.</li><li>Client stub&#xC5D0;&#xC11C; &#xBC1B;&#xC740; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB4E4;&#xC744; Server&#xCE21;&#xC5D0; &#xC804;&#xB2EC;&#xD558;&#xAE30; &#xC704;&#xD574; Packet&#xC73C;&#xB85C; &#xBCC0;&#xD658;</li><li>&#xD574;&#xB2F9; Packet&#xC744; Trasport layer(<code>RPC runtime</code>)&#xC73C;&#xB85C; &#xC8FC;&#xACE0; Server &#xCE21;&#xC5D0; &#xC804;&#xB2EC;.</li><li>Server&#xCE21; Trasport layer&#xC5D0;&#xC11C; &#xC774;&#xB97C; &#xC804;&#xB2EC; &#xBC1B;&#xC544; Server stub&#xC73C;&#xB85C; &#xC804;&#xB2EC;.</li><li><code>Server stub</code>&#xB294; &#xD574;&#xB2F9; Packet&#xC744; &#xBCC0;&#xD658;&#xD574; &#xC804;&#xB2EC;&#xD558;&#xBA70; Server&#xC5D0; Client&#xCE21;&#xC774; &#xC694;&#xAD6C;&#xD55C; &#xD504;&#xB85C;&#xC2DC;&#xC800; &#xD638;&#xCD9C;.</li><li>Server&#xB294; &#xC694;&#xAD6C;&#xD55C; &#xD504;&#xB85C;&#xC2DC;&#xC800;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xACE0; &#xACB0;&#xACFC; &#xAC12;&#xC744; &#xB2E4;&#xC2DC; <code>Server stub</code>&#xC5D0; &#xC804;&#xB2EC;</li><li><code>Server stub</code>&#xB294; &#xACB0;&#xACFC; &#xAC12;&#xC744; Packet&#xC73C;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4; Transport layer&#xB97C;  &#xD1B5;&#xD574; Client&#xC5D0; &#xC804;&#xB2EC;.</li><li><code>Client stub</code>&#xB294; &#xC804;&#xB2EC; &#xBC1B;&#xC740; Packet&#xC5D0;&#xC11C; &#xACB0;&#xACFC; &#xAC12;&#xC744; &#xCD94;&#xCD9C;&#xD574; Client&#xCE21;&#xC774; &#xACB0;&#xACFC; &#xAC12; &#xD68D;&#xB4DD;</li></ol><h3 id="Stub"><a href="#Stub" class="headerlink" title="Stub"></a>Stub</h3><p>&#xC704;&#xC758; &#xACFC;&#xC815;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xB2E4; &#xBCF4;&#xBA74; stub&#xC774;&#xB77C;&#xB294; &#xAC1C;&#xB150;&#xC774; &#xC0DD;&#xC18C;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. stub&#xC774;&#xB780; Client&#xC640; Server &#xAC04;&#xC758; &#xB9E4;&#xAC1C; &#xBCC0;&#xC218;&#xC640; &#xAC19;&#xC740; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAC01; &#xBA38;&#xC2E0;&#xC5D0; &#xB9DE;&#xAC8C; &#xBCC0;&#xD658;&#xD574;&#xC8FC;&#xB294; &#xCF54;&#xB4DC;&#xC758; &#xC870;&#xAC01;&#xC785;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; stub&#xC774; &#xC5C6;&#xC774; &#xD3EC;&#xC778;&#xD130;&#xAC00; Client&#xCE21;&#xC5D0;&#xC11C;  &#xC804;&#xB2EC;&#xB418;&#xB294; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xB420;&#xAE4C;&#xC694;? Client&#xC640; Server&#xB294; &#xC804;&#xD600; &#xB2E4;&#xB978; &#xBA54;&#xBAA8;&#xB9AC; &#xACF5;&#xAC04;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; Client&#xCE21; &#xC5D0;&#xC11C; &#xAC00;&#xB9AC;&#xD0A4;&#xB358; &#xD3EC;&#xC778;&#xD130;&#xAC00; Server&#xCE21;&#xC73C;&#xB85C; &#xB118;&#xC5B4;&#xAC00;&#xAC8C; &#xB418;&#xBA74;&#xC11C; &#xC804;&#xD600;&#xB2E4;&#xB978; &#xACF3;&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0; &#xC788;&#xAC8C; &#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xB610; &#xB9CC;&#xC57D; Client&#xB294; &#xB9AC;&#xD2C0; &#xC5D4;&#xB514;&#xC548; &#xD615;&#xC2DD;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0;&#xB9CC; Server&#xCE21;&#xC740; &#xBE45; &#xC5D4;&#xB514;&#xC548; &#xD615;&#xC2DD;&#xC744; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xBA74; &#xC5B4;&#xB5A8;&#xAE4C;&#xC694;? &#xC758;&#xB3C4;&#xD55C; &#xBC14;&#xC640; &#xC804;&#xD600; &#xB2E4;&#xB978; &#xB370;&#xC774;&#xD130;&#xB4E4;&#xC774; &#xC804;&#xB2EC;&#xC774; &#xB420; &#xAC83; &#xC785;&#xB2C8;&#xB2E4;. &#xB54C;&#xBB38;&#xC5D0; &#xAC01; &#xB370;&#xC774;&#xD130;&#xB4E4;&#xC740; stub&#xC744; &#xAC70;&#xCCD0; Packet&#xC758; &#xD615;&#xD0DC;&#xB85C; &#xC804;&#xB2EC;&#xC774; &#xB418;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><h3 id="RPC-runtime"><a href="#RPC-runtime" class="headerlink" title="RPC runtime"></a>RPC runtime</h3><p><code>RPC runtime</code>&#xC774;&#xB77C;&#xB294; &#xBD80;&#xBD84;&#xB3C4; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;. <code>RPC runtime</code>&#xC740; RPC &#xC0AC;&#xC6A9;&#xC744; &#xC704;&#xD574; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD1B5;&#xC2E0;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD568;&#xC218;&#xC640; &#xB8E8;&#xD2F4;&#xC744; &#xBAA8;&#xC544;&#xB193;&#xC740; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xC785;&#xB2C8;&#xB2E4;. &#xC8FC;&#xB85C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xAC04; &#xC8FC;&#xACE0;&#xBC1B;&#xC740; Packet&#xB4E4;&#xC744; &#xAD00;&#xB9AC;&#xD558;&#xACE0; &#xC804;&#xC1A1;, &#xC2B9;&#xC778;, &#xB77C;&#xC6B0;&#xD305; &#xBC0F; &#xC554;&#xD638;&#xD654;, &#xC624;&#xB958; &#xCC98;&#xB9AC; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xC791;&#xC5C5;&#xC774; &#xCC98;&#xB9AC; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="&#xC7A5;&#xC810;&#xACFC;-&#xB2E8;&#xC810;"><a href="#&#xC7A5;&#xC810;&#xACFC;-&#xB2E8;&#xC810;" class="headerlink" title="&#xC7A5;&#xC810;&#xACFC; &#xB2E8;&#xC810;"></a>&#xC7A5;&#xC810;&#xACFC; &#xB2E8;&#xC810;</h3><p>RPC&#xC758; &#xC7A5;&#xB2E8;&#xC810;&#xC5D0; &#xB300;&#xD574; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA70; &#xB9C8;&#xBB34;&#xB9AC;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC7A5;&#xC810;&#xBD80;&#xD130; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xB2F9;&#xC5F0;&#xD788; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xD568;&#xC218;&#xB098; &#xD504;&#xB85C;&#xC2DC;&#xC800;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC5B4; &#xAC1C;&#xBC1C;&#xC790; &#xC785;&#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xB2E4;&#xB978; &#xD558;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC5D0; &#xC2E0;&#xACBD;&#xC744; &#xC4F0;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xB418;&#xC5B4; &#xD3B8;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, &#xB2E4;&#xC591;&#xD55C; &#xC5B8;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC57C; &#xD558;&#xB294; MSA&#xAD6C;&#xC870;&#xC5D0;&#xC11C;&#xB3C4; &#xC27D;&#xAC8C; &#xC5B8;&#xC5B4;&#xB97C; &#xD655;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xACE0; &#xCF54;&#xB4DC;&#xB97C; &#xC7AC;&#xC791;&#xC131;&#xD574;&#xC57C; &#xD558;&#xB294; &#xBC88;&#xAC70;&#xB85C;&#xC6C0;&#xB3C4; &#xC0AC;&#xB77C;&#xC9C4;&#xB2E4;&#xB294; &#xAC83;&#xB3C4; &#xD070; &#xC7A5;&#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC774;&#xC81C; &#xB2E8;&#xC810;&#xB3C4; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. stub&#xC5D0;&#xC11C; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC5C6;&#xAC70;&#xB098; &#xD5C8;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB97C; &#xC804;&#xB2EC;&#xD560; &#xACBD;&#xC6B0;&#xAC00; &#xC874;&#xC7AC;&#xD574; RPC&#xB97C; &#xC774;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC0C1;&#xD669;&#xC5D0; &#xB530;&#xB77C; &#xD504;&#xB85C;&#xC2DC;&#xC800; &#xD638;&#xCD9C;&#xACFC; &#xBC18;&#xD658;&#xC5D0; &#xB300;&#xD55C; &#xC2DC;&#xAC04;&#xC774; &#xBCF4;&#xC7A5;&#xB418;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788;, &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xD1B5;&#xD574; RPC &#xD1B5;&#xC2E0;&#xC744; &#xD560; &#xB54C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xAC00; &#xB04A;&#xAE30;&#xAC8C; &#xB41C;&#xB2E4;&#xBA74; RPC&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC9C0; &#xBABB;&#xD569;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/rpc/">rpc</category>
      
      <category domain="https://hackyboiz.github.io/tags/poosic/">poosic</category>
      
      <category domain="https://hackyboiz.github.io/tags/remote-procedure-call/">remote procedure call</category>
      
      <category domain="https://hackyboiz.github.io/tags/stub/">stub</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/22/poosic/rpc/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021-30858: Webkit의 UAF 취약점</title>
      <link>https://hackyboiz.github.io/2021/10/21/l0ch/2021-10-21/</link>
      <guid>https://hackyboiz.github.io/2021/10/21/l0ch/2021-10-21/</guid>
      <pubDate>Thu, 21 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://googleprojectzero.github.io/0days-in-the-wild/0da</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://googleprojectzero.github.io/0days-in-the-wild/0day-RCAs/2021/CVE-2021-30858.html">CVE-2021-30858: Use-after-free in WebKit</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul><li>iOS &lt; 14.8, Safari &lt; 14.1.2</li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>&#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xC5D4;&#xC9C4;&#xC778; Webkit&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xB41C; UAF &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC138;&#xBD80; &#xC815;&#xBCF4;&#xAC00; &#xACF5;&#xAC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC6F9;&#xD398;&#xC774;&#xC9C0;&#xC5D0; &#xD3F0;&#xD2B8; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xB85C;&#xB4DC;&#xD558;&#xB294; CSS Font Loading API&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. FontFace Lookup Table&#xC5D0; &#xB4F1;&#xB85D;&#xB41C; &#xD3F0;&#xD2B8;&#xB97C; &#xC81C;&#xAC70;&#xD558;&#xB294; <code>CSSFontFaceSet::removeFromFacesLookupTable</code> &#xBA54;&#xC11C;&#xB4DC;&#xC758; &#xCF54;&#xB4DC;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">CSSFontFaceSet::removeFromFacesLookupTable</span><span class="hljs-params">(<span class="hljs-keyword">const</span> CSSFontFace&amp; face, <span class="hljs-keyword">const</span> CSSValueList&amp; familiesToSearchFor)</span></span><span class="hljs-function"></span>{...        <span class="hljs-keyword">auto</span> iterator = m_facesLookupTable.find(familyName);        ASSERT(iterator != m_facesLookupTable.end()); <span class="hljs-comment">// Release &#xBAA8;&#xB4DC; &#xCEF4;&#xD30C;&#xC77C; &#xC2DC; &#xC8FC;&#xC11D;&#xCC98;&#xB9AC;</span>        <span class="hljs-keyword">bool</span> found = <span class="hljs-literal">false</span>;        <span class="hljs-keyword">for</span> (<span class="hljs-keyword">size_t</span> i = <span class="hljs-number">0</span>; i &lt; iterator-&gt;value.size(); ++i) {            <span class="hljs-keyword">if</span> (iterator-&gt;value[i].ptr() == &amp;face) {                found = <span class="hljs-literal">true</span>;                iterator-&gt;value.remove(i);                <span class="hljs-keyword">break</span>;            }        }        ASSERT_UNUSED(found, found);        <span class="hljs-keyword">if</span> (!iterator-&gt;value.size())            m_facesLookupTable.remove(iterator);    }}</code></pre><p>Lookup Table&#xC5D0;&#xC11C; &#xD3F0;&#xD2B8;&#xB97C; &#xC81C;&#xAC70;&#xD560; &#xB54C; &#xC77C;&#xCE58;&#xD558;&#xB294; &#xD3F0;&#xD2B8;&#xAC00; &#xC5C6;&#xC73C;&#xBA74; &#xC870;&#xAC74;&#xC774; &#xC77C;&#xCE58;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xACBD;&#xC6B0; &#xC608;&#xC678;&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xB294;  <code>ASSERT</code> &#xBB38;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xC885;&#xB8CC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.  &#xADF8;&#xB7EC;&#xB098; <code>ASSERT</code>&#xB294; &#xB514;&#xBC84;&#xAE45; &#xC6A9;&#xB3C4;&#xB85C;, &#xB514;&#xBC84;&#xADF8; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C;&#xB9CC; &#xC791;&#xB3D9;&#xD558;&#xBA70; &#xB9B4;&#xB9AC;&#xC988; &#xBAA8;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xC8FC;&#xC11D; &#xCC98;&#xB9AC;&#xB418;&#xC5B4; &#xC791;&#xB3D9;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xD3F0;&#xD2B8;&#xB97C; Lookup Table&#xC5D0;&#xC11C; &#xCC3E;&#xC9C0; &#xBABB;&#xD574;&#xB3C4; &#xC774;&#xB97C; &#xC81C;&#xAC70;&#xD558;&#xB824;&#xACE0; &#xC2DC;&#xB3C4;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC544;&#xB798;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC758; PoC&#xC785;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c">var fontFace1 = <span class="hljs-keyword">new</span> FontFace(<span class="hljs-string">&quot;font1&quot;</span>, <span class="hljs-string">&quot;&quot;</span>, {});var fontFaceSet = <span class="hljs-keyword">new</span> FontFaceSet([fontFace1]);fontFace1.family = <span class="hljs-string">&quot;font2&quot;</span>;</code></pre><p>&#xC704;&#xC640; &#xAC19;&#xC774; &#xC720;&#xD6A8;&#xD558;&#xC9C0; &#xC54A;&#xC740; <code>FontFace</code> &#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131;&#xD55C; &#xB4A4; <code>FontFaceSet</code>&#xC73C;&#xB85C; &#xB4F1;&#xB85D;&#xD574;&#xB3C4; Lookup Table&#xC5D0; &#xD3F0;&#xD2B8;&#xAC00; &#xCD94;&#xAC00;&#xB418;&#xC9C0; &#xC54A;&#xC9C0;&#xB9CC; <code>removeFromFacesLookupTable</code>&#xC5D0;&#xC11C;&#xB294; <code>ASSERT</code>&#xAC00; &#xC791;&#xB3D9;&#xD558;&#xC9C0; &#xC54A;&#xC544; &#xC5D0;&#xB7EC; &#xC5C6;&#xC774; &#xCD94;&#xAC00;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xD3F0;&#xD2B8;&#xB97C; &#xC81C;&#xAC70;&#xD558;&#xB824;&#xACE0; &#xC2DC;&#xB3C4;&#xD558;&#xAC8C; &#xB418;&#xACE0; UAF&#xAC00; &#xD2B8;&#xB9AC;&#xAC70;&#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xCDE8;&#xC57D;&#xC810;&#xC740; <code>ASSERT</code>&#xB97C; <code>if</code>&#xBB38;&#xC73C;&#xB85C; &#xB300;&#xCCB4;&#xD574; <code>iterator == m_facesLookupTable.end()</code> &#xC778;&#xACBD;&#xC6B0; &#xD3F0;&#xD2B8; &#xC81C;&#xAC70;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xD568;&#xC218;&#xB97C; &#xC885;&#xB8CC;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xD328;&#xCE58;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c">- ASSERT(iterator != m_facesLookupTable.end());+ <span class="hljs-keyword">if</span> (iterator == m_facesLookupTable.end()) {  <span class="hljs-keyword">return</span>;}</code></pre><h3 id="&#xCD94;&#xAC00;-&#xC815;&#xBCF4;"><a href="#&#xCD94;&#xAC00;-&#xC815;&#xBCF4;" class="headerlink" title="&#xCD94;&#xAC00; &#xC815;&#xBCF4;"></a>&#xCD94;&#xAC00; &#xC815;&#xBCF4;</h3><p>(21/10/21) &#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC740; CVE-2021-30858&#xB85C; &#xBA85;&#xBA85;&#xB41C; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC544;&#xB2CC; &#xB2E4;&#xB978; &#xCDE8;&#xC57D;&#xC810;&#xC774;&#xB77C;&#xB294; &#xC815;&#xBCF4;&#xAC00; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/cve/">cve</category>
      
      <category domain="https://hackyboiz.github.io/tags/uaf/">uaf</category>
      
      <category domain="https://hackyboiz.github.io/tags/ios/">ios</category>
      
      <category domain="https://hackyboiz.github.io/tags/use-after-free/">use after free</category>
      
      <category domain="https://hackyboiz.github.io/tags/webkit/">webkit</category>
      
      <category domain="https://hackyboiz.github.io/tags/apple/">apple</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/21/l0ch/2021-10-21/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] 완전 비밀성(perfect secrecy)</title>
      <link>https://hackyboiz.github.io/2021/10/20/y00n_nms/perfect-secrecy/</link>
      <guid>https://hackyboiz.github.io/2021/10/20/y00n_nms/perfect-secrecy/</guid>
      <pubDate>Wed, 20 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xB9D0;&amp;#xD574;&amp;#xC11C; &lt;strong&gt;&amp;#x201C;&amp;#xACF5;&amp;#xACA9;&amp;#xC790;&amp;#xAC00; &amp;#xC544;&amp;#xBB34;&amp;#xB9AC; &amp;#xB6F0;&amp;#xC5</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xAC04;&#xB2E8;&#xD788; &#xB9D0;&#xD574;&#xC11C; <strong>&#x201C;&#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC544;&#xBB34;&#xB9AC; &#xB6F0;&#xC5B4;&#xB09C; &#xACC4;&#xC0B0; &#xB2A5;&#xB825;&#xACFC; &#xBB34;&#xD55C;&#xD55C; &#xC2DC;&#xAC04;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC5B4;&#xB3C4;, &#xC554;&#xD638;&#xBB38;&#xC5D0;&#xC11C; &#xD3C9;&#xBB38;&#xC5D0; &#xB300;&#xD55C; &#xC5B4;&#xB5A0;&#xD55C; &#xC815;&#xBCF4;&#xB3C4; &#xC5BB;&#xC744; &#xC218; &#xC5C6;&#xC744; &#xB54C;&#x201D;</strong> &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xC548;&#xC804;&#xD558;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC815;&#xBCF4; &#xC774;&#xB860;(Information theory)&#xC758; &#xC544;&#xBC84;&#xC9C0;&#xB77C;&#xACE0; &#xBD88;&#xB9AC;&#xB294; &#xD074;&#xB85C;&#xB4DC; &#xC100;&#xB10C;(Claude Shannon)&#xC740; &#xC644;&#xC804; &#xBE44;&#xBC00;&#xC131;&#xC744; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC815;&#xC758;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><blockquote><p>&#xC784;&#xC758;&#xC758; &#xBA54;&#xC138;&#xC9C0; M0&#xACFC; M1&#xC5D0; &#xB300;&#xD558;&#xC5EC;, M0&#xACFC; M1&#xC758; &#xAE38;&#xC774;&#xAC00; len(M0) == len(M1)&#xB85C; &#xC11C;&#xB85C; &#xAC19;&#xACE0;, &#xADF8; &#xAC01;&#xAC01;&#xC744; &#xC554;&#xD638;&#xD654;&#xD55C; E(K, M0)&#xC640;  E(K, M1)&#xC758; &#xACB0;&#xACFC;&#xAC00; C&#xAC00; &#xB420; &#xD655;&#xB960;&#xC774; &#xC11C;&#xB85C; &#xB3D9;&#xC77C;&#xD558;&#xACE0;, K&#xAC00; &#xADE0;&#xB4F1; &#xBD84;&#xD3EC;&#xC77C; &#xB54C; &#xADF8; &#xC554;&#xD638;&#xBB38;&#xC740; &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xC548;&#xC804;(perfect secrecy)&#xD569;&#xB2C8;&#xB2E4;.</p></blockquote><p>&#xB9CC;&#xC57D; Alice 1&#xBD80;&#xD130; 26&#xAE4C;&#xC9C0; &#xC911; &#xD55C; &#xC22B;&#xC790;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xC2DC;&#xD504;&#xD2B8;&#xC5F0;&#xC0B0;&#xC744; &#xD55C;&#xB2E4;&#xACE0; &#xD588;&#xC744; &#xB54C;, 26&#xAC1C;&#xC758; &#xC554;&#xD638; &#xC911; &#xD558;&#xB098;&#xC758; &#xACB0;&#xACFC;&#xB85C; &#xB098;&#xD0C0;&#xB0A9;&#xB2C8;&#xB2E4;. (ex. BMJDF, CNKEG &#xB4F1;)</p><p>&#xD558;&#xC9C0;&#xB9CC; &#xB9CC;&#xC57D; 5&#xAE00;&#xC790;&#xC778; Alice&#xB97C; 1&#xBD80;&#xD130; 25&#xAE4C;&#xC9C0; &#xC22B;&#xC790; &#xC911; &#xBB34;&#xC791;&#xC704;&#xB85C; 5&#xAC1C;&#xB97C; &#xACE8;&#xB77C; &#xD55C; &#xAE00;&#xC790;&#xC529; &#xC2DC;&#xD504;&#xD2B8; &#xD560; &#xB54C; &#xAC00;&#xB2A5;&#xD55C; &#xC554;&#xD638;&#xBB38;&#xC758; &#xC218;&#xB294; 26&#xC758; 5&#xC81C;&#xACF1;&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xC608;&#xB85C; 1,2,3,4,5&#xB97C; &#xC120;&#xD0DD;&#xD558;&#xBA74; alice&#xB294; bnlgj&#xAC00; &#xB418;&#xC9C0;&#xB9CC;, &#xC5B4;&#xB5A4; &#xC22B;&#xC790;&#xC5F4;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB0D0;&#xC5D0; &#xB530;&#xB77C; aaaaa, aaaab, aaaac, aaaad, &#x2026; zzzza, zzzzb, zzzzz&#xAE4C;&#xC9C0; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; yoona&#xB97C; &#xC554;&#xD638;&#xD654;&#xD574;&#xB3C4; aaaaa&#xBD80;&#xD130; zzzzz&#xAE4C;&#xC9C0;&#xC758; &#xACB0;&#xACFC;&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4;&#xB0B4;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC554;&#xD638;&#xBB38; aaaaa&#xB97C; &#xC5BB;&#xC5B4;&#xB3C4; &#xC774;&#xB85C;&#xBD80;&#xD130; &#xD3C9;&#xBB38;&#xC774; alice&#xC778;&#xC9C0;, yoona&#xC778;&#xC9C0; &#xC54C; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>OTP&#xB85C; &#xC54C;&#xB824;&#xC9C4; One Time Pad&#xB294; &#xC774; &#xC644;&#xC804; &#xBE44;&#xBC00;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xB9CC;&#xC57D; &#xD0A4;&#xAC00; &#xBB34;&#xC791;&#xC704;&#xD558;&#xB2E4;&#xBA74;, &#xD3C9;&#xBB38;&#xACFC; &#xD0A4;&#xB97C; XOR &#xC5F0;&#xC0B0;&#xD55C; &#xC554;&#xD638;&#xBB38; &#xC5ED;&#xC2DC; &#xD0A4;&#xB9CC;&#xD07C; &#xBB34;&#xC791;&#xC704;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD0A4;&#xB97C; &#xBAA8;&#xB974;&#xB294; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC554;&#xD638;&#xBB38;&#xB9CC; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC744; &#xB54C; &#xD3C9;&#xBB38;&#xC5D0; &#xB300;&#xD55C; &#xC5B4;&#xB5A0;&#xD55C; &#xC815;&#xBCF4;&#xB3C4; &#xC5BB;&#xC744; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>4&#xBE44;&#xD2B8;&#xB97C; &#xC608;&#xC2DC;&#xB85C; &#xB4E4;&#xBA74; &#xD3C9;&#xBB38;&#xC774; 1010&#xC774;&#xACE0; &#xD0A4;&#xAC00; 1111&#xC77C; &#xB54C; &#xC554;&#xD638;&#xBB38;&#xC740; 0101&#xC785;&#xB2C8;&#xB2E4;. &#xD0A4;&#xB97C; &#xBAA8;&#xB974;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC804;&#xC218;&#xC870;&#xC0AC;&#xB85C; &#xAC00;&#xB2A5;&#xD55C; &#xD0A4;&#xB97C; &#xC0DD;&#xAC01;&#xD558;&#xBA74; 0000, 0001, 0010 &#xB4F1; 16&#xAC00;&#xC9C0;&#xAC00; &#xB098;&#xC635;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD3C9;&#xBB38;&#xC73C;&#xB85C; &#xBCF5;&#xD638;&#xD654;&#xD558;&#xBA74; &#xB611;&#xAC19;&#xC774; 0101, 0100, 0111 &#xB4F1; 16&#xAC00;&#xC9C0;&#xC758; &#xD3C9;&#xBB38;&#xC774; &#xB098;&#xC624;&#xC9C0;&#xB9CC;, &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC5B4;&#xB5A4; &#xAC83;&#xC774; &#xD3C9;&#xBB38;&#xC778;&#xC9C0; &#xC54C; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. </p><p>&#xC544;&#xBB34;&#xB9AC; &#xACC4;&#xC0B0;&#xC744; &#xC798;&#xD558;&#xB294; &#xACF5;&#xACA9;&#xC790;&#xB77C;&#xB3C4; 1111&#xC744; &#xC554;&#xD638;&#xBB38;&#xC73C;&#xB85C; &#xBC1B;&#xC73C;&#xBA74;, &#xC774; &#xC554;&#xD638;&#xBB38;&#xC758; &#xD3C9;&#xBB38;&#xC774; 1010&#xC778;&#xC9C0;, 0101&#xC778;&#xC9C0; &#xC54C; &#xC218; &#xC5C6;&#xC8E0;.</p><p>&#xC100;&#xB10C;&#xC758; &#xC815;&#xC758;&#xC5D0; &#xB300;&#xC785;&#xD574;&#xBCF4;&#xBA74;, &#xC784;&#xC758;&#xC758; &#xBA54;&#xC138;&#xC9C0; M0(1010)&#xACFC; M1(0101)&#xC5D0; &#xB300;&#xD558;&#xC5EC; &#xB458;&#xC758; &#xAE38;&#xC774;&#xAC00; &#xAC19;&#xACE0;, K&#xAC00; &#xADE0;&#xB4F1; &#xBD84;&#xD3EC;&#xC774;&#xBA70; &#xAC01;&#xAC01;&#xC744; &#xC554;&#xD638;&#xD654;&#xD55C; &#xACB0;&#xACFC;&#xAC00; 1111&#xC774; &#xB420; &#xD655;&#xB960;&#xC774; &#xB3D9;&#xC77C;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xC644;&#xC804;&#xD558;&#xAC8C; &#xC548;&#xC804;&#xD558;&#xB2E4;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/otp/">otp</category>
      
      <category domain="https://hackyboiz.github.io/tags/crypto/">crypto</category>
      
      <category domain="https://hackyboiz.github.io/tags/y00n-nms/">y00n_nms</category>
      
      <category domain="https://hackyboiz.github.io/tags/perfect-secrecy/">perfect secrecy</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/20/y00n_nms/perfect-secrecy/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] Bypassing required reviews using GitHub Actions</title>
      <link>https://hackyboiz.github.io/2021/10/19/fabu1ous/2021-10-19/</link>
      <guid>https://hackyboiz.github.io/2021/10/19/fabu1ous/2021-10-19/</guid>
      <pubDate>Tue, 19 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://medium.com/cider-sec/bypassing-required-reviews-u</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://medium.com/cider-sec/bypassing-required-reviews-using-github-actions-6e1b29135cc7">Bypassing required reviews using GitHub Actions</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a><strong>Target</strong></h2><p>GitHub</p><p>GitHub action</p><p>GitHub organization</p><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a><strong>Explain</strong></h2><p>GitHub action&#xC744; &#xC0AC;&#xC6A9;&#xD574; GitHub organization&#xC758; branch protection rule&#xC744; &#xBB34;&#xC2DC;&#xD558;&#xACE0; repo&#xC5D0; &#xC9C1;&#xC811; &#xCF54;&#xB4DC;&#xB97C; push&#xD560; &#xC218; &#xC788;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p><p>GitHub organization&#xC740; &#xB3D9;&#xC2DC;&#xC5D0; &#xC5EC;&#xB7EC; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xAC78;&#xCCD0; &#xD611;&#xC5C5;&#xD560; &#xC218; &#xC788;&#xB294; &#xACF5;&#xC720; &#xACC4;&#xC815;&#xC785;&#xB2C8;&#xB2E4;. &#xB9CE;&#xC740; &#xC720;&#xC800;&#xB4E4;&#xC774; &#xC800;&#xB9C8;&#xB2E4; &#xAD8C;&#xD55C;&#xC744; &#xAC16;&#xACE0; organization &#xBA64;&#xBC84;&#xB85C; &#xD3EC;&#xD568;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Write &#xAD8C;&#xD55C;&#xC744; &#xAC16;&#xB294; &#xC720;&#xC800;&#xB294; repo&#xC5D0; &#xC9C1;&#xC811; &#xCF54;&#xB4DC;&#xB97C; push&#xD560; &#xC218; &#xC788;&#xB294; &#xAD8C;&#xD55C;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xD558;&#xC9C0;&#xB9CC; &#xD574;&#xCEE4;&#xAC00; Wrtie &#xAD8C;&#xD55C;&#xC744; &#xAC16;&#xB294; &#xACC4;&#xC815;&#xC744; &#xD0C8;&#xCDE8;&#xD558;&#xACE0; repo&#xC5D0; &#xC9C1;&#xC811; &#xCF54;&#xB4DC;&#xB97C; push&#xD558;&#xB294; &#xC0C1;&#xD669;&#xC744; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; pull request&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xD2B9;&#xC815; &#xBA64;&#xBC84;&#xAC00; &#xD574;&#xB2F9; pull request&#xB97C; review &#xD55C;&#xB4A4; merge &#xD558;&#xB294; branch protection rule&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  &#xB2F9;&#xC5F0;&#xD788; &#xC790;&#xC2E0;&#xC774; &#xC0DD;&#xC131;&#xD55C; pull request&#xB97C; &#xC9C1;&#xC811; &#xB9AC;&#xBDF0;&#xD558;&#xACE0; &#xC2B9;&#xC778;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xD558;&#xC9C0;&#xB9CC; &#xBB38;&#xC81C;&#xB294; Write &#xAD8C;&#xD55C;&#xC774; &#xC788;&#xB294; &#xC720;&#xC800;&#xB77C;&#xBA74; GitHub action&#xC744; &#xC0AC;&#xC6A9;&#xD574; repo&#xC5D0; &#xB300;&#xD574; workflow &#xD30C;&#xC77C;&#xC744; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xACE0;, &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xB0B4;&#xC6A9;&#xC774; &#xD3EC;&#xD568;&#xB41C; &#xC6CC;&#xD06C;&#xD50C;&#xB85C;&#xC6B0;&#xC640; &#xD568;&#xAED8; &#xCF54;&#xB4DC;&#xB97C; &#xC0C8;&#xB85C;&#xC6B4; remote branch&#xC5D0; &#xD478;&#xC2DC;&#xD558;&#xBA74; &#xC790;&#xAE30; &#xC790;&#xC2E0;&#xC758; pull request&#xB97C; &#xC9C1;&#xC811; &#xC2B9;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs yaml"><span class="hljs-attr">name:</span> <span class="hljs-string">APPROVE</span> <span class="hljs-attr">on:</span> <span class="hljs-string">pull_request</span> <span class="hljs-comment"># run on pull request events</span> <span class="hljs-attr">permissions:</span> <span class="hljs-attr">pull-requests:</span> <span class="hljs-string">write</span> <span class="hljs-comment"># grant write permission on the pull-requests endpoint</span><span class="hljs-attr">jobs:</span> <span class="hljs-attr">approve:</span>   <span class="hljs-attr">runs-on:</span> <span class="hljs-string">ubuntu-latest</span>    <span class="hljs-attr">steps:</span>     <span class="hljs-bullet">-</span> <span class="hljs-attr">run:</span> <span class="hljs-string">|</span> <span class="hljs-comment"># approve the pull request</span>         <span class="hljs-string">curl</span> <span class="hljs-string">--request</span> <span class="hljs-string">POST</span> <span class="hljs-string">\\</span>         <span class="hljs-string">--url</span> <span class="hljs-string">&lt;https://api.github.com/repos/${{github.repository}&gt;}/pulls/${{github.event.number}}/reviews</span> <span class="hljs-string">\\</span>         <span class="hljs-string">--header</span> <span class="hljs-string">&apos;authorization: Bearer $<span class="hljs-template-variable">{{ secrets.GITHUB_TOKEN }}</span>&apos;</span> <span class="hljs-string">\\</span>         <span class="hljs-string">--header</span> <span class="hljs-string">&apos;content-type: application/json&apos;</span> <span class="hljs-string">\\</span>         <span class="hljs-string">-d</span> <span class="hljs-string">&apos;{&quot;event&quot;:&quot;APPROVE&quot;}&apos;</span></code></pre><p>&#xD0C0;&#xAC9F; repo&#xC758; &#xC4F0;&#xAE30;&#xAD8C;&#xD55C; &#xACC4;&#xC815;&#xC744; &#xD0C8;&#xCDE8;&#xD55C; &#xD574;&#xCEE4;&#xB294; &#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC545;&#xC6A9;&#xD574; &#xC545;&#xC131; &#xCF54;&#xB4DC;&#xB97C; push&#xD558;&#xACE0; &#xC9C1;&#xC811; merge&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/github/">github</category>
      
      <category domain="https://hackyboiz.github.io/tags/organization/">organization</category>
      
      <category domain="https://hackyboiz.github.io/tags/action/">action</category>
      
      <category domain="https://hackyboiz.github.io/tags/workflow/">workflow</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/19/fabu1ous/2021-10-19/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[Translation] Fuzzing RDP: Holding the Stick at Both Ends (1)</title>
      <link>https://hackyboiz.github.io/2021/10/17/j0ker/rdp_fuzzing1/</link>
      <guid>https://hackyboiz.github.io/2021/10/17/j0ker/rdp_fuzzing1/</guid>
      <pubDate>Sun, 17 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xC6D0;&amp;#xBB38; &amp;#xB9C1;&amp;#xD06C; : &lt;a href=&quot;https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-bot</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xC6D0;&#xBB38; &#xB9C1;&#xD06C; : <a href="https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends">https://www.cyberark.com/resources/threat-research-blog/fuzzing-rdp-holding-the-stick-at-both-ends</a></p><p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;. j0ker&#xC785;&#xB2C8;&#xB2E4;! &#xC624;&#xB298;&#xC740; &#xC624;&#xB79C;&#xB9CC;&#xC5D0; &#xBC88;&#xC5ED;&#xAE00;&#xC744; &#xAC00;&#xC838;&#xC640;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD3C9;&#xC18C;&#xC5D0; &#xD37C;&#xC9D5;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB3C4; &#xAD00;&#xC2EC;&#xC774; &#xB9CE;&#xC558;&#xACE0; &#xD30C;&#xC77C; &#xD37C;&#xC9D5;&#xB9CC; &#xD574;&#xBD24;&#xC9C0; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD37C;&#xC9D5;&#xC740; &#xC548;&#xD574;&#xBD24;&#xC5C8;&#xB294;&#xB370; &#xAD1C;&#xCC2E;&#xC740; &#xAE00;&#xC774; &#xC788;&#xC5B4;&#xC11C; &#xBC88;&#xC5ED;&#xD574;&#xBD05;&#xB2C8;&#xB2E4;. &#xC758;&#xC5ED;&#xC744; &#xB9CE;&#xC774; &#xD588;&#xB294;&#xB370; &#xC624;&#xD0C0;&#xB098; &#xBC88;&#xC5ED;&#xC774; &#xC5B4;&#xC0C9;&#xD55C; &#xBD80;&#xBD84;&#xC740; &#xB313;&#xAE00;&#xB85C; &#xC9C0;&#xC801;&#xD574;&#xC8FC;&#xC138;&#xC694;. &#xD639;&#xC2DC;&#xB098; &#xBC88;&#xC5ED;&#xD574;&#xC92C;&#xC73C;&#xBA74; &#xD558;&#xB294; &#xAE00;&#xC774; &#xC788;&#xB2E4;&#xBA74; &#xCD94;&#xCC9C; &#xBD80;&#xD0C1;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;! &#xCD5C;&#xB300;&#xD55C; &#xBE68;&#xB9AC; &#xD574;&#xBCFC;&#xAC8C;&#xC694;!</p><hr><h1 id="&#xC778;&#xC0AC;&#xB9D0;"><a href="#&#xC778;&#xC0AC;&#xB9D0;" class="headerlink" title="&#xC778;&#xC0AC;&#xB9D0;"></a>&#xC778;&#xC0AC;&#xB9D0;</h1><p>&#xC774; &#xD3EC;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; &#xC6B0;&#xB9AC;&#xAC00; Windows RDP &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84;&#xB4E4;&#xC744; &#xD37C;&#xC9D5;&#xD558;&#xBA74;&#xC11C; &#xACAA;&#xC740; &#xB0B4;&#xC6A9;&#xB4E4;&#xACFC; &#xADF8; &#xACB0;&#xACFC;&#xC5D0; &#xB300;&#xD574; &#xB2E4;&#xB8F0; &#xC608;&#xC815;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xBCF4;&#xC548; &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0;&#xB294; Microsoft&#xC758; Remote Desktop Protocol(RDP)&#xB97C; &#xC608;&#xC804;&#xBD80;&#xD130; &#xAD00;&#xC2EC;&#xC788;&#xAC8C; &#xC9C0;&#xCF1C;&#xBD10;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;. 2019&#xB144;&#xC5D0;&#xB294; <a href="https://www.bankinfosecurity.com/top-ransomware-attack-vectors-rdp-drive-by-phishing-a-14353">&#xBA87; &#xBC31;&#xB9CC;&#xB300;&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB294; &#xD06C;&#xB9AC;&#xD2F0;&#xCEEC;&#xD55C; &#xCDE8;&#xC57D;&#xC810;</a>&#xB4E4;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xACE0;, &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC740; &#xD32C;&#xB300;&#xBBF9; &#xC2DC;&#xAE30;&#xC5D0; &#xB9DE;&#xCDB0; &#xC7AC;&#xD0DD;&#xADFC;&#xBB34;&#xB97C; &#xD558;&#xB294; &#xD68C;&#xC0AC;&#xB4E4;&#xC5D0;&#xAC8C;&#xB294; &#xBA87; &#xBC30;&#xB85C; &#xB354; &#xD070; &#xC704;&#xD611;&#xC73C;&#xB85C; &#xB2E4;&#xAC00;&#xC654;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC0AC;&#xC2E4; &#xC800;&#xD76C;&#xAC00; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xCC98;&#xC74C; &#xC2DC;&#xC791;&#xD560; &#xB54C;&#xC5D0;&#xB294; VM&#xC5D0; &#xAD00;&#xB828;&#xB41C; &#xB0B4;&#xC6A9;&#xC5D0; &#xAD00;&#xC2EC;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; Azure&#xC758; Windows &#xBA38;&#xC2E0; &#xD639;&#xC740; Hyper-V &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC5D0; &#xC811;&#xC18D;&#xD560; &#xB54C; RDP&#xB97C; &#xC8FC;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, RDP&#xC5D0; &#xB208;&#xC744; &#xB3CC;&#xB9AC;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC800;&#xD76C;&#xB294; &#xB2E4;&#xB978; &#xC131;&#xACF5;&#xC801;&#xC778; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB4E4;&#xACFC; &#xB611;&#xAC19;&#xC774; &#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xAD6C;&#xAE00;&#xB9C1;&#xC744; &#xD558;&#xB2E4;&#xAC00; <a href="https://www.youtube.com/watch?v=dGLrK8tUAFs">&#xBC15;&#xCC9C;&#xC131;&#xB2D8;, &#xC7A5;&#xC601;&#xC9C4;&#xB2D8;, &#xAE40;&#xC2B9;&#xC8FC;&#xB2D8;, &#xC774;&#xAE30;&#xD0DD;&#xB2D8;&#xC758; RDP fuzzing&#xC5D0; &#xAD00;&#xB828;&#xB41C; BlackHat Europe 2019 &#xBC1C;&#xD45C;</a>&#xB97C; &#xC811;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC1C;&#xD45C;&#xC790;&#xB4E4;&#xC740; &#xADF8;&#xB807;&#xAC8C; &#xBE60;&#xB974;&#xC9C0; &#xC54A;&#xC740; &#xD37C;&#xC800;&#xB97C; &#xD65C;&#xC6A9;&#xD588;&#xC74C;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0; &#xBA87; &#xC2DC;&#xAC04;&#xB9CC;&#xC5D0; &#xC5EC;&#xB7EC; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC744; &#xCC3E;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; &#xADF8;&#xB4E4;&#xC758; &#xC5F0;&#xAD6C;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD37C;&#xC9D5; &#xAE30;&#xB2A5;&#xC744; &#xD655;&#xC7A5;&#xD558;&#xACE0; &#xD37C;&#xD3EC;&#xBA3C;&#xC2A4;&#xB97C; &#xAC1C;&#xC120;&#xD558;&#xC5EC; RDP&#xC5D0;&#xC11C; Remote Code Execution(RCE) &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xAE30;&#xB85C; &#xACB0;&#xC815;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. </p><p>&#xBD88;&#xD589;&#xD788;&#xB3C4;(&#xD639;&#xC740; &#xC6B4;&#xC774; &#xC88B;&#xAC8C;&#xB3C4;, &#xBCF4;&#xB294; &#xC2DC;&#xAC01;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB97C; &#xC218; &#xC788;&#xC74C;), &#xBAA8;&#xB4E0; &#xD37C;&#xC9D5; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xACB0;&#xACFC;&#xBB3C;&#xB4E4;&#xC774; &#xD06C;&#xB9AC;&#xD2F0;&#xCEEC;&#xD55C; &#xAC83;&#xC740; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;(<a href="https://en.wikipedia.org/wiki/Survivorship_bias">Survivorship Bias</a> &#xCC38;&#xACE0;). &#xC544;&#xC9C1; RDP RCE&#xB97C; &#xCC3E;&#xC9C0; &#xBABB;&#xD588;&#xC9C0;&#xB9CC; &#xC5EC;&#xB7EC; &#xBC84;&#xADF8;&#xB4E4;&#xC744; &#xCC3E;&#xC558;&#xACE0; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xACFC; &#xAD6C;&#xC131; &#xADF8;&#xB9AC;&#xACE0; &#xD37C;&#xC9D5; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBC0F; &#xD234;&#xC744; &#xC774;&#xD574;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xAC00; &#xB9CC;&#xB4E0; &#xD37C;&#xC9D5; &#xC778;&#xD504;&#xB77C;&#xB294; &#xB2E4;&#xB978; &#xD0C0;&#xAC9F;&#xB4E4;&#xC744; &#xD37C;&#xC9D5;&#xD560; &#xC218; &#xC788;&#xC744; &#xC815;&#xB3C4;&#xB85D; &#xC81C;&#xB124;&#xB7F4;&#xD558;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC774; &#xD3EC;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; &#xC55E;&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD55C; &#xBAA8;&#xB4E0; &#xB0B4;&#xC6A9;&#xB4E4;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xB300;&#xD574; &#xACF5;&#xC720;&#xD558;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800; RDP&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xAC04;&#xB2E8;&#xD788; &#xC54C;&#xC544;&#xBCF4;&#xACE0; &#xD37C;&#xC9D5;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xD588;&#xB294;&#xC9C0;, &#xC5B4;&#xB5A4; &#xBB38;&#xC81C;&#xC810;&#xB4E4;&#xC744; &#xD574;&#xCCD0;&#xB098;&#xAC14;&#xB294;&#xC9C0; &#xADF8;&#xB9AC;&#xACE0; &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xC774;&#xB7EC;&#xD55C; &#xACFC;&#xC815;&#xB4E4;&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xD558;&#xAC8C;&#xB41C; &#xBC84;&#xADF8;&#xB4E4;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC598;&#xAE30;&#xD574; &#xBCF4;&#xACE0;&#xC790; &#xD569;&#xB2C8;&#xB2E4;.</p><h1 id="RDP-Overview"><a href="#RDP-Overview" class="headerlink" title="RDP Overview"></a>RDP Overview</h1><p>Remote Desktop Protocol&#xC740; Windows &#xBA38;&#xC2E0;&#xC5D0; &#xC811;&#xC18D;&#xD560; &#xB54C; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xCD5C;&#xADFC; Malwaretech&#xB294; RDP&#xB97C; &#xB450;&#xACE0; &#x201C;&#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xB4E4;&#xC744; &#xC704;&#xD55C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#x201D;&#xC774;&#xB77C;&#xACE0; &#xD45C;&#xD604;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. RDP&#xB294; &#xBAA8;&#xB4E0; &#xCEE4;&#xB125;&#xC158;&#xC744; &#xC870;&#xC791;&#xD558;&#xC5EC; &#xC5EC;&#xB7EC; &#xCC44;&#xB110; &#xB3D9;&#xC2DC;&#xC811;&#xC18D;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xACE0; &#xC11C;&#xB85C; &#xB2E4;&#xB978; &#xB3D9;&#xC791;&#xC744; &#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xB9D0;&#xC740; &#xC989;&#xC2A8;, &#xAC01;&#xAC01;&#xC758; &#xCC44;&#xB110;&#xB4E4;&#xC740; &#xAC01;&#xC790; &#xB370;&#xC774;&#xD130;, &#xC784;&#xC758; &#xC815;&#xC758; &#xAD6C;&#xC870;&#xCCB4; &#xADF8;&#xB9AC;&#xACE0; &#xB370;&#xC774;&#xD130; &#xD50C;&#xB85C;&#xC6B0;&#xB97C; &#xC54C;&#xC544;&#xC11C; &#xD578;&#xB4E4;&#xB9C1;&#xD55C;&#xB2E4;&#xB294; &#xC758;&#xBBF8;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xADFC;&#xBCF8;&#xC801;&#xC73C;&#xB85C; RDP&#xAC00; &#xC5EC;&#xB7EC; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xC9C0;&#xC6D0;&#xD55C;&#xB2E4;&#xB294; &#xC758;&#xBBF8;&#xAC00; &#xB429;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/17/j0ker/rdp_fuzzing1/Untitled.png" alt="Untitled"></p><blockquote><p>RDP &#xC5F0;&#xACB0; &#xC2DC;&#xC758; &#xCC44;&#xB110;&#xB4E4;</p></blockquote><p>RDP &#xD328;&#xB110;&#xC740; &#xC815;&#xC801;&#xC77C; &#xC218; &#xC788;&#xACE0; &#xB3D9;&#xC801;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xB458;&#xC758; &#xCC28;&#xC774;&#xC810;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xAE00;&#xC758; &#xC694;&#xC9C0;&#xC5D0;&#xC11C; &#xBC97;&#xC5B4;&#xB098;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC598;&#xAE30;&#xD558;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; RDP&#xC758; &#xB0B4;&#xBD80; &#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC5D0; &#xB300;&#xD574; &#xC880; &#xB354; &#xC54C;&#xACE0; &#xC2F6;&#xC73C;&#xC2DC;&#xB2E4;&#xBA74;, <a href="https://www.cyberark.com/resources/threat-research-blog/explain-like-i-m-5-remote-desktop-protocol-rdp">&#xC774; &#xAE00;</a>&#xC744; &#xC77D;&#xC73C;&#xC2DC;&#xB294;&#xAC78; &#xCD94;&#xCC9C;&#xB4DC;&#xB824;&#xC694;. &#xBC18;&#xBA74;&#xC5D0; &#xD37C;&#xC9D5; &#xACFC;&#xC815;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC880; &#xB354; &#xC54C;&#xACE0; &#xC2F6;&#xC73C;&#xC168;&#xB2E4;&#xBA74; &#xC81C;&#xB300;&#xB85C; &#xCC3E;&#xC544;&#xC624;&#xC168;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB4E4;&#xC5B4;&#xAC08;&#xAC8C;&#xC694;.</p><h1 id="Challenges-in-RDP-Fuzzing"><a href="#Challenges-in-RDP-Fuzzing" class="headerlink" title="Challenges in RDP Fuzzing"></a>Challenges in RDP Fuzzing</h1><p>&#xC77C;&#xBC18;&#xC801;&#xC778; &#xD37C;&#xC9D5;&#xC5D0;&#xC11C;&#xB294; &#xD30C;&#xC77C; &#xD639;&#xC740; &#xC2A4;&#xD2B8;&#xB9BC;&#xC73C;&#xB85C; &#xB418;&#xC5B4; &#xC788;&#xB294; &#xC778;&#xD48B; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD37C;&#xC800;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xC77D;&#xC5B4;&#xB4E4;&#xC774;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB364;&#xACA8;&#xBC1B;&#xC544; &#xCC98;&#xB9AC;&#xD558;&#xACE0; &#xD37C;&#xC800;&#xAC00; &#xC774; &#xACFC;&#xC815;&#xC758; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1; &#xD569;&#xB2C8;&#xB2E4;. &#xCE21;&#xC815;&#xD55C; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; &#xD37C;&#xC800;&#xB294; &#xB2E4;&#xC2DC; &#xC778;&#xD48B;&#xC744; &#xBCC0;&#xC870;&#xD558;&#xACE0; &#xBCC0;&#xC870;&#xB41C; &#xC778;&#xD48B;&#xC744; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC744; &#xBC18;&#xBCF5;&#xD569;&#xB2C8;&#xB2E4;.</p><p>RDP &#xD37C;&#xC9D5;&#xC740; RDP &#xC5F0;&#xACB0;&#xC774; &#xD56D;&#xC0C1; &#xC874;&#xC7AC;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xC640;&#xB294; &#xC0AC;&#xBB47; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;. &#xD37C;&#xC800;&#xAC00; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xB123;&#xB294; &#xC778;&#xD48B;&#xC740; &#xCEE4;&#xB125;&#xC158;&#xC758; &#xD2B9;&#xC815; &#xCC44;&#xB110;(&#xD37C;&#xC9D5; &#xACFC;&#xC815;&#xC5D0;&#xC11C;&#xB3C4; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xC74C;)&#xC758; &#xCD5C;&#xC0C1;&#xC704;&#xC5D0;&#xC11C; Protocol Data Unit(PDU)&#xB85C;&#xC368; &#xBCF4;&#xB0B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xC55E;&#xC5D0;&#xC11C; &#xC548;&#xAE09;&#xD588;&#xB358; &#xAC83;&#xCC98;&#xB7FC;, &#xBAA8;&#xB4E0; &#xCC44;&#xB110;&#xC740; &#xAC01;&#xC790; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBAA8;&#xB4E0; &#xCC44;&#xB110;&#xC5D0; &#xD37C;&#xC9D5;&#xC744; &#xC9C4;&#xD589;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xC774;&#xC720; &#xB54C;&#xBB38;&#xC5D0; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xCCBC;&#xB9B0;&#xC9C0;&#xB4E4;&#xC774; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.(&#xC774;&#xB294; &#xB2E4;&#xB978; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;/&#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xD37C;&#xC800;&#xB4E4;&#xC5D0;&#xAC8C;&#xB3C4; &#xD574;&#xB2F9;&#xB420; &#xC218; &#xC788;&#xC74C;)</p><ul><li>Client-Server architecture : &#xC804;&#xD1B5;&#xC801;&#xC778; &#xD37C;&#xC9D5;&#xC5D0;&#xC11C; &#xD37C;&#xC800;&#xB294; &#xC2EC;&#xD50C;&#xD558;&#xAC8C; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xACE0; &#xC778;&#xD48B;&#xC744; &#xB123;&#xB294; &#xC5ED;&#xD560;&#xB9CC; &#xD55C;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;-&#xC11C;&#xBC84; &#xAD6C;&#xC870;&#xC5D0;&#xC11C;&#xB294; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xD55C; &#xCABD;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xACE0; &#xC788;&#xACE0; &#xC778;&#xD48B;&#xC740; &#xB2E4;&#xB978; &#xD55C;&#xCABD;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xB418;&#xC5B4; &#xC804;&#xB2EC;&#xB41C;&#xB2E4;. RDP&#xC758; &#xACBD;&#xC6B0;, &#xB300;&#xBD80;&#xBD84; &#xC591;&#xCABD;&#xC740; &#xB2E4;&#xB978; &#xBA38;&#xC2E0;(&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84; &#xC758;&#xBBF8;)&#xC774;&#xB2E4;.</li><li>Statefulness : RDP&#xB294; &#xC0C1;&#xD0DC; &#xAE30;&#xBC18; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;(&#xC5F0;&#xACB0; &#xC0C1;&#xD0DC;&#xAC00; &#xC9C0;&#xC18D;&#xB418;&#xB294;? &#xAC19;&#xC740; &#xC758;&#xBBF8;&#xC778;&#xAC70; &#xAC19;&#xB124;&#xC694;)&#xC785;&#xB2C8;&#xB2E4;. &#xC774; &#xB9D0;&#xC740; &#xD37C;&#xD37C;&#xC9D5;&#xC744; &#xD558;&#xB294; &#xC640;&#xC911;&#xC5D0;&#xB3C4; &#xC5F0;&#xACB0; &#xC0C1;&#xD0DC;&#xB97C; &#xACE0;&#xB824;&#xD574;&#xC57C;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xD37C;&#xC815; &#xC548;&#xC815;&#xC131;&#xC5D0; &#xC2EC;&#xAC01;&#xD55C; &#xC601;&#xD5A5;&#xC744; &#xC904; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.<ul><li>&#xD37C;&#xC9D5; &#xACFC;&#xC815;&#xC5D0;&#xC11C;&#xC758; &#xC548;&#xC815;&#xC131;&#xC740; &#xBCF4;&#xD1B5; &#xC77C;&#xAD00;&#xC131;, &#xC989; &#xB3D9;&#xC77C;&#xD55C; &#xC778;&#xD48B;&#xC744; &#xB123;&#xC73C;&#xBA74; &#xB3D9;&#xC77C;&#xD55C; &#xCF54;&#xB4DC; &#xACBD;&#xB85C;&#xB97C; &#xC0DD;&#xC131;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</li></ul></li><li>Multi-input fuzzing : &#xB9CC;&#xC57D; &#xD30C;&#xC77C;&#xC744; &#xC778;&#xD48B;&#xC73C;&#xB85C; &#xBC1B;&#xB294; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xD37C;&#xC9D5;&#xD560; &#xACBD;&#xC6B0;(file-format fuzzing), &#xD0C0;&#xAC9F;&#xC5D0; &#xC804;&#xB2EC;&#xB418;&#xB294; &#xD37C;&#xC800;&#xC758; &#xC778;&#xD48B;&#xC740; &#xD558;&#xB098;&#xC758; &#xD30C;&#xC77C; &#xC548;&#xC5D0; &#xBAA8;&#xB450; &#xB2F4;&#xACA8;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBC18;&#xB300;&#xB85C;, &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC744; &#xD37C;&#xC9D5;&#xD560; &#xB54C;&#xC5D0;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xCF54;&#xB4DC; &#xACBD;&#xB85C;&#xB97C; &#xBC1C;&#xAD74;&#xD574;&#xB0B4;&#xAE30; &#xC704;&#xD574; &#xC5EC;&#xB7EC; &#xC5F0;&#xC18D;&#xC801;&#xC778; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xBCF4;&#xB0B4;&#xC57C;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>Finding the target code : coverage-guided fuzzing&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xB54C;&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC778;&#xD48B;&#xC744; &#xD578;&#xB4E4;&#xB9C1;&#xD558;&#xB294; &#xD0C0;&#xAC9F; &#xD568;&#xC218; &#xAC19;&#xC774; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0; &#xCE21;&#xC815; &#xC2DC;&#xC791; &#xC9C0;&#xC810;&#xC744; &#xD37C;&#xC800;&#xC5D0;&#xAC8C; &#xC54C;&#xB824;&#xC918;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. RDP&#xC5D0;&#xB294; &#xB3D9;&#xC791;&#xC5D0; &#xAD00;&#xC5EC;&#xD558;&#xB294; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB4E4;&#xC774; &#xB9E4;&#xC6B0; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC815;&#xD655;&#xD55C; &#xC9C0;&#xC810;&#xC744; &#xC9C0;&#xC815;&#xD558;&#xB294;&#xAC8C; &#xC0DD;&#xAC01;&#xBCF4;&#xB2E4; &#xC5B4;&#xB835;&#xC6B8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul><p>&#xC774;&#xB807;&#xAC8C; 4 &#xAC00;&#xC9C0;&#xAC00; &#xC800;&#xD76C;&#xAC00; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC2DC;&#xC791;&#xD560; &#xB54C; &#xC608;&#xC0C1;&#xD588;&#xB358; &#xCC4C;&#xB9B0;&#xC9C0;&#xB4E4;&#xC785;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C; &#xC139;&#xC158;&#xC5D0;&#xC11C;&#xB294; &#xC6B0;&#xB9AC;&#xAC00; &#xC774; &#xCC4C;&#xB9B0;&#xC9C0;&#xB4E4;&#xACFC; &#xCD94;&#xD6C4;&#xC5D0; &#xBC1C;&#xC0DD;&#xD55C; &#xB610; &#xD558;&#xB098;&#xC758; &#xCC4C;&#xB9B0;&#xC9C0;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xD574;&#xACB0;&#xD588;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD574; &#xB2E4;&#xB8F0; &#xC608;&#xC815;&#xC785;&#xB2C8;&#xB2E4;.</p><h1 id="Techincal-Details-The-Challenges-and-How-to-Overcome-Them"><a href="#Techincal-Details-The-Challenges-and-How-to-Overcome-Them" class="headerlink" title="Techincal Details : The Challenges and How to Overcome Them"></a>Techincal Details : The Challenges and How to Overcome Them</h1><p>&#xC774; &#xC139;&#xC158;&#xC5D0;&#xC11C;&#xB294; &#xC6B0;&#xB9AC;&#xC758; &#xAC1C;&#xBC1C; &#xC138;&#xBD80; &#xB0B4;&#xC6A9;&#xACFC; &#xB9C8;&#xC8FC;&#xCE58;&#xAC8C;&#xB41C; &#xCC4C;&#xB9B0;&#xC9C0;&#xB4E4;&#xC5D0; &#xB300;&#xD574; &#xB2E4;&#xB8E8;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; &#xC6B0;&#xB9AC;&#xAC00; &#xD37C;&#xC9D5; &#xC14B;&#xC5C5;&#xC744; &#xAC16;&#xCD94;&#xAE30; &#xC704;&#xD574; &#xC5B4;&#xB5BB;&#xAC8C; &#xB300;&#xCC98;&#xD588;&#xB294; &#xC9C0;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB3C4; &#xC598;&#xAE30;&#xD574;&#xBCFC;&#xAC8C;&#xC694;. &#xC774; <a href="https://github.com/cyberark/rdpfuzz">&#xB808;&#xD3EC;</a>&#xC5D0; &#xB4E4;&#xC5B4;&#xAC00;&#xC2DC;&#xBA74; &#xC6B0;&#xB9AC;&#xAC00; &#xC774; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC9C4;&#xD589;&#xD558;&#xBA74;&#xC11C; &#xC791;&#xC131;&#xD55C; &#xCF54;&#xB4DC;&#xB4E4;&#xC774; &#xBAA8;&#xB450; &#xB4E4;&#xC5B4;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD639;&#xC2DC; &#xC774; &#xCABD;&#xC5D0; &#xAD00;&#xC2EC;&#xC774; &#xC788;&#xB2E4;&#xBA74;, &#xCC98;&#xC74C; &#xC2DC;&#xC791;&#xD560; &#xB54C; &#xB9CE;&#xC740; &#xB3C4;&#xC6C0;&#xC774; &#xB420;&#xAC81;&#xB2C8;&#xB2E4;.</p><h2 id="Client-Server-Architecture"><a href="#Client-Server-Architecture" class="headerlink" title="Client-Server Architecture"></a>Client-Server Architecture</h2><p>&#xC774; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; Windows&#xC758; RDP &#xC11C;&#xBC84;&#xC640; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xBAA8;&#xB450;&#xB97C; &#xD37C;&#xC9D5;&#xD558;&#xACE0; &#xC2F6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. RDP &#xC11C;&#xBC84;&#xB97C; &#xD37C;&#xC9D5;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xBAA9;&#xD45C;&#xB294; &#xBA85;&#xD655;&#xD569;&#xB2C8;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC774;&#xB97C; &#xC774;&#xC6A9;&#xD574; Windows &#xC11C;&#xBC84;&#xB97C; &#xC6D0;&#xACA9;&#xC5D0;&#xC11C; &#xACF5;&#xACA9;&#xD574; &#xC811;&#xADFC; &#xAD8C;&#xD55C;&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xC8E0;. RDP &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xD37C;&#xC9D5;&#xD558;&#xACE0;&#xC790; &#xD588;&#xB358; &#xC774;&#xC720;&#xB294; &#xC880; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC774;&#xBBF8; &#xC11C;&#xBC84;&#xB97C; &#xD0C8;&#xCDE8;&#xD588;&#xB2E4;&#xBA74; &#xADF8;&#xB4E4;&#xC740; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xC900;&#xBE44;&#xD558;&#xACE0; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC811;&#xC18D;&#xD558;&#xAE30;&#xB9CC;&#xC744; &#xAE30;&#xB2E4;&#xB9B4; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xC8E0;. &#xD53C;&#xD574;&#xC790;&#xAC00; &#xC811;&#xC18D;&#xD558;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xACF5;&#xACA9;&#xD574; &#xD53C;&#xD574;&#xC790;&#xC758; &#xBA38;&#xC2E0;&#xC744; &#xC7A5;&#xC545;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xAD00;&#xB9AC;&#xC790;&#xAC00; &#xADF8;&#xB4E4;&#xC774; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xC11C;&#xBC84;&#xC5D0; &#xC811;&#xC18D;&#xD558;&#xBA74; &#xC774;&#xB7F0; &#xC0C1;&#xD669;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xACE0;, Hyper-V&#xAC00; &#xAC00;&#xC0C1;&#xBA38;&#xC2E0;&#xC744; &#xC811;&#xC18D;&#xD560; &#xB54C; RDP&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; VM Escape&#xC5D0;&#xB3C4; &#xD65C;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>RDP &#xD37C;&#xC800;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB85C; &#xAD6C;&#xC131;&#xB429;&#xB2C8;&#xB2E4;.</p><ul><li>Instrumentation engine : &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xCE21;&#xC815;&#xD558;&#xACE0; &#xD06C;&#xB798;&#xC2DC;&#xB97C; &#xD0D0;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;.</li><li>Mutation engine : &#xC0C8;&#xB85C;&#xC6B4; &#xC778;&#xD48B;&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;.</li><li>Input sender : &#xC801;&#xC808;&#xD560; &#xD0C0;&#xAC9F; &#xCC44;&#xB110;&#xC5D0;&#xAC8C; &#xD37C;&#xC800;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xB41C; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB97C; &#xC804;&#xC1A1;&#xD569;&#xB2C8;&#xB2E4;.</li><li>Target binary : intrumentation engine&#xC5D0; &#xC758;&#xD574; &#xD2B8;&#xB798;&#xD0B9;&#xB429;&#xB2C8;&#xB2E4;.</li></ul><p>&#xC544;&#xB9C8; &#xC0C1;&#xC0C1;&#xB418;&#xC2DC;&#xACA0;&#xC9C0;&#xB9CC;, &#xC11C;&#xBC84;&#xC640; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xB300;&#xC0C1;&#xC758; &#xD37C;&#xC9D5; &#xC14B;&#xC5C5;&#xC740; &#xC880; &#xB2E4;&#xB974;&#xC9C0;&#xB9CC; &#xBA87; &#xAC00;&#xC9C0; &#xC720;&#xC0AC;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xBD80;&#xBD84;&#xBD80;&#xD130; &#xBCF4;&#xC2DC;&#xC8E0;.</p><p><img src="/2021/10/17/j0ker/rdp_fuzzing1/1.png" alt="Untitled"></p><blockquote><p>&#xAE30;&#xBCF8;&#xC801;&#xC778; &#xD37C;&#xC9D5; &#xC14B;&#xC5C5;(&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84; &#xBAA8;&#xB450;)</p></blockquote><p>&#xD0C0;&#xAC9F; &#xBD80;&#xBD84;&#xC758; &#xAD6C;&#xC131;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li>Fuzzer : &#xCEE4;&#xC2A4;&#xD140; afl-fuzz.exe</li><li>Instrumentation engine : in-app instrumentation &#xBAA8;&#xB4DC;&#xC758; DynamoRIO&#xB97C; &#xC0AC;&#xC6A9;&#xD55C; &#xCEE4;&#xC2A4;&#xD140; winafl.dll<ul><li>&#xCEE4;&#xC2A4;&#xD140; &#xBE4C;&#xB4DC;&#xC5D0;&#xC11C; WinAFL&#xACFC; DynamoRIO&#xC5D0; &#xCD94;&#xAC00;&#xB41C; &#xAE30;&#xB2A5;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xB2E4;&#xC74C; &#xC139;&#xC158;&#xC744; &#xCC38;&#xACE0;&#xD574; &#xC8FC;&#xC138;&#xC694;.</li></ul></li><li>Inputs(&#xD639;&#xC740; test cases) : &#xD0C0;&#xAC9F;&#xACFC; &#xC778;&#xD48B; &#xC13C;&#xB354; &#xC0AC;&#xC774;&#xC5D0; &#xACF5;&#xC720;&#xB418;&#xB294; &#xB514;&#xB809;&#xD1A0;&#xB9AC; &#xC548; &#xC784;&#xC2DC; &#xD30C;&#xC77C;&#xC5D0; &#xC4F0;&#xC774;&#xB294; &#xBCC0;&#xC870;&#xB41C; PDU&#xB4E4;</li></ul><p>&#xC778;&#xD48B; &#xC13C;&#xB354;&#xC5D0;&#xB294; &#xD558;&#xB098;&#xC758; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB9CC; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p><ul><li>Agent : &#xC784;&#xC2DC; &#xD30C;&#xC77C;&#xB4E4;&#xC744; &#xC77D;&#xACE0; &#xD0C0;&#xAC9F; &#xD328;&#xB110;&#xC5D0; &#xC778;&#xD48B;&#xB4E4;&#xC744; &#xC804;&#xB2EC;</li></ul><p>&#xC774;&#xB7F0; &#xC138;&#xD305;&#xC744; &#xD55C; &#xC774;&#xC720;&#xB294; &#xAC04;&#xB2E8;&#xD569;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xB294; &#xD37C;&#xC9D5; &#xC778;&#xD48B;&#xC744; &#xAC00;&#xC0C1;&#xD658;&#xACBD;&#xC744; &#xB300;&#xC0C1;&#xC73C;&#xB85C; &#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2CC; &#x201C;&#xB77C;&#xC774;&#xBE0C;&#x201D;&#xD55C; RDP &#xC5F0;&#xACB0; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xC9C4;&#xD589;&#xD558;&#xACE0; &#xC2F6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xB530;&#xB77C;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; &#xC778;&#xD48B; &#xC0DD;&#xC131; &#xBD80;&#xBD84;&#xC744; &#xD0C0;&#xAC9F;&#xC5D0; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xACFC; &#xBD84;&#xB9AC;&#xC2DC;&#xCF1C; &#xD0C0;&#xAC9F;&#xC774; &#xC778;&#xD48B;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xAE30; &#xC804;&#xC5D0; RDP &#xD55C;&#xCABD;&#xC5D0;&#xC11C;&#xBD80;&#xD130; &#xB2E4;&#xB978; &#xD55C;&#xCABD;&#xC778; &#xD0C0;&#xAC9F;&#xC5D0;&#xAC8C;&#xAE4C;&#xC9C0; &#xC804;&#xB2EC; &#xB420; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD94;&#xAC00;&#xC801;&#xC73C;&#xB85C; &#xC6B0;&#xB9AC;&#xB294; WinAFL&#xC758; in-app instrumentation mode&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC5D0; &#xC601;&#xD5A5;&#xC744; &#xC8FC;&#xC9C0; &#xC54A;&#xB3C4;&#xB85D; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Coverage-guided fuzzing&#xC774; &#xB3D9;&#xC791;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xC785;&#xB825;&#xACFC; &#xC785;&#xB825;&#xC73C;&#xB85C; &#xC778;&#xD574; &#xD2B8;&#xB9AC;&#xAC70;&#xB41C; &#xCF54;&#xB4DC; &#xACBD;&#xB85C;&#xAC00; &#xC77C;&#xB300;&#xC77C; &#xB300;&#xC751;&#xC774; &#xB418;&#xC5B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; &#xD37C;&#xC800;&#xC758; PDU&#xB4E4;&#xACFC; &#xC77C;&#xBC18;&#xC801;&#xC778; PDU&#xB4E4;&#xC744; &#xAD6C;&#xBD84;&#xD558;&#xACE0; &#xD37C;&#xC800;&#xC758; PDU&#xB4E4;&#xC758; &#xCF54;&#xB4DC; &#xACBD;&#xB85C;&#xB9CC; &#xD2B8;&#xB798;&#xD0B9;&#xD558;&#xB294; &#x201C;background fuzzing&#x201D;&#xC744; &#xAC1C;&#xBC1C;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xB294; &#xC5F0;&#xACB0; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C;&#xC758; &#xB79C;&#xB364;&#xD55C; PDU&#xAC00; &#xC544;&#xB2C8;&#xB77C; &#xD37C;&#xC800;&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xD55C; PDU&#xB4E4;&#xC5D0; &#xB300;&#xD55C; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB9CC; &#xD2B8;&#xB798;&#xD0B9;&#xD558;&#xAE30;&#xB97C; &#xC6D0;&#xD588;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB294; &#xC911;&#xC694;&#xD55C; &#xC791;&#xC5C5;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC774;&#xD574;&#xB97C; &#xB3D5;&#xAE30; &#xC704;&#xD574;&#xC11C; RDP &#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB85C; &#xC624;&#xB514;&#xC624;&#xB97C; &#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xD2B8;&#xD558;&#xB294; RDPSND &#xAC00;&#xC0C1; &#xCC44;&#xB110;&#xC744; &#xD37C;&#xC9D5;&#xD560; &#xB54C; &#xC5B4;&#xB5A4;&#xC9C0; &#xD55C;&#xBC88; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. <a href="https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpea/bea2d5cf-e3b9-4419-92e5-0e074ff9bc5b">&#xACF5;&#xC2DD; &#xBB38;&#xC11C;</a>&#xC5D0; &#xB530;&#xB974;&#xBA74; PDU &#xC74C;&#xB2F5;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xBC14;&#xC774;&#xD2B8;&#xB294; &#xBA54;&#xC2DC;&#xC9C0;&#xC758; &#xD0C0;&#xC785;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/17/j0ker/rdp_fuzzing1/2.png" alt="Untitled"></p><p><code>msgType</code> &#xD544;&#xB4DC;&#xC5D0;&#xC11C; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xAC12;&#xC740; 0x01 ~ 0x0D &#xC785;&#xB2C8;&#xB2E4;.&#xC5EC;&#xAE30;&#xC5D0;&#xC11C;&#xB294; &#xCCAB; &#xBC14;&#xC774;&#xD2B8;&#xC758; &#xCD5C;&#xC0C1;&#xC704; &#xBE44;&#xD2B8;&#xB97C; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD37C;&#xC9D5; &#xB9C8;&#xCEE4;&#xB85C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.  </p><ul><li>&#xC5D0;&#xC774;&#xC804;&#xD2B8;&#xC5D0;&#xC11C; PDU&#xB97C; &#xBCF4;&#xB0BC; &#xB54C; &#xCCAB; &#xBC14;&#xC774;&#xD2B8;&#xC758; &#xCD5C;&#xC0C1;&#xC704; &#xBE44;&#xD2B8;&#xB97C; &#xC870;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</li><li>WinAFL&#xC5D0;&#xC11C;&#xB294; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xD578;&#xB4E4;&#xB9C1;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xCD5C;&#xC0C1;&#xC704; &#xBE44;&#xD2B8;&#xB97C; &#xCCB4;&#xD06C;&#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xD574;&#xB2F9; &#xBE44;&#xD2B8;&#xAC00; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xB2E4;&#xBA74;(&#xAC12;&#xC774; &#xC788;&#xB2E4;&#xBA74;), WinAFL&#xC740; &#xD574;&#xB2F9; &#xBE44;&#xD2B8;&#xB97C; &#xB2E4;&#xC2DC; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xD558;&#xACE0; &#xD574;&#xB2F9; &#xBA54;&#xC2DC;&#xC9C0;&#xC758; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xCE21;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xD574;&#xB2F9; &#xBE44;&#xD2B8;&#xAC00; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xB2E4;&#xBA74; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xBB34;&#xC2DC;&#xD558;&#xACE0; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xCE21;&#xC815;&#xD569;&#xB2C8;&#xB2E4;.</li></ul><p>&#xC5EC;&#xAE30;&#xAE4C;&#xC9C0; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84; &#xC14B;&#xC5C5;&#xC758; &#xBE44;&#xC2B7;&#xD55C; &#xC810;&#xB4E4;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC54C;&#xC544;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC; &#xC774;&#xC81C; &#xB2E4;&#xB978; &#xC810;&#xB4E4;&#xC744; &#xBCF4;&#xC8E0;. &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB97C; &#xBA3C;&#xC800; &#xBD05;&#xC2DC;&#xB2E4;.</p><h2 id="Client-Fuzzing-Setup"><a href="#Client-Fuzzing-Setup" class="headerlink" title="Client Fuzzing Setup"></a>Client Fuzzing Setup</h2><p>Windwos RDP client&#xB294; mstsc.exe&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xAC00;&#xC0C1; &#xCC44;&#xB110; &#xB370;&#xC774;&#xD130;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xB85C;&#xC9C1;&#xC740; mstscax.dll&#xC5D0; &#xB4E4;&#xC5B4;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Hyper-V &#xAC00;&#xC0C1; &#xBA38;&#xC2E0;&#xC758; &#xC6D0;&#xACA9; &#xC811;&#xADFC; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC778; vmconnect.exe&#xB3C4; &#xB611;&#xAC19;&#xC774; mstscax.dll&#xC5D0; &#xCF54;&#xC5B4; &#xAE30;&#xB2A5;&#xB4E4;&#xC774; &#xB4E4;&#xC5B4;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/17/j0ker/rdp_fuzzing1/3.png" alt="Untitled"></p><blockquote><p>Windows RDP Client</p></blockquote><p>&#xB2E8;&#xC21C;&#xC131;&#xACFC; &#xD6A8;&#xC728;&#xC131;&#xC744; &#xC704; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBC84;(&#xD0C0;&#xAC9F;&#xACFC; &#xC5D0;&#xC774;&#xC804;&#xD2B8;)&#xB97C; &#xAC19;&#xC740; &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.(&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; localhost/127.0.0.1&#xC5D0; &#xC811;&#xC18D;) &#xB610;&#xD55C; &#xBCD1;&#xB839; &#xD37C;&#xC9D5;&#xC744; &#xD560; &#xC218; &#xC787;&#xAC8C; mimikatz&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC5EC;&#xB7EC; RDP &#xC5F0;&#xACB0;&#xC744; &#xD5C8;&#xC6A9;&#xD558;&#xB3C4;&#xB85D; &#xC11C;&#xBC84;&#xB97C; &#xD328;&#xCE58;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/17/j0ker/rdp_fuzzing1/4.png" alt="Untitled"></p><p>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xD37C;&#xC9D5;&#xC744; &#xC704;&#xD55C; &#xC14B;&#xC5C5; &#xAD6C;&#xC131;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li>Target : mstsc.exe&#xC640; &#xD0C0;&#xAC9F; &#xBAA8;&#xB4C8;&#xC778; mstscax.dll</li><li>Instrumentation : &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; DynamoRIO&#xC640; &#xCF54;&#xB4DC;&#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB294; &#xC804;&#xB2EC;&#xD558;&#xB294; DynamoRIO &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC778; winafl.dll</li><li>Mutation engine : &#xAC19;&#xC740; &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xD30C;&#xC77C;&#xC5D0; &#xC0C8;&#xB85C;&#xC6B4; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB97C; &#xC4F0;&#xB294; AFL-Fuzzer</li><li>Input sender : &#xC11C;&#xBC84;&#xC5D0; &#xB300;&#xD55C; &#xD578;&#xB4E4;&#xC744; &#xC624;&#xD508;&#xD558;&#xACE0; &#xC120;&#xD0DD;&#xB41C; &#xAC00;&#xC0C1; &#xCC44;&#xB110;&#xB85C; PDU&#xB97C; &#xC804;&#xB2EC;&#xD558;&#xB294; RDPFuzzAgent. &#xC774; &#xC5D0;&#xC774;&#xC804;&#xD2B8;&#xB294; AFL-Fuzz&#xC5D0;&#xC11C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xD30C;&#xC77C;&#xC73C;&#xB85C;&#xBD80;&#xD130; &#xC77D;&#xC5B4;&#xC624;&#xB294; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB4E4;&#xC744; &#xD0C0;&#xCF13; &#xCC44;&#xB110;&#xC5D0; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.</li></ul><p>&#xC774;&#xB807;&#xAC8C; &#xAD6C;&#xC131;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xC6B0;&#xB9AC;&#xB294; &#xCD08;&#xB2F9; 50 ~ 100 &#xBC88; &#xC2E4;&#xD589;&#xC774;&#xB77C;&#xB294; &#xC18D;&#xB3C4;&#xB97C; &#xB0BC; &#xC218; &#xC788;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAC8C; &#xBE60;&#xB978; &#xC18D;&#xB3C4;&#xB294; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC; &#xC55E;&#xC11C; &#xC5B8;&#xAE09;&#xD55C; &#xC5F0;&#xAD6C;&#xC5D0;&#xC11C;&#xC758; &#xC18D;&#xB3C4;&#xBCF4;&#xB2E4;&#xB294; &#xBE68;&#xB790;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC6B0;&#xB9AC;&#xB294; &#xB9CC;&#xC871;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h2 id="Server-Fuzzing-Setup"><a href="#Server-Fuzzing-Setup" class="headerlink" title="Server Fuzzing Setup"></a>Server Fuzzing Setup</h2><p>RDP &#xC11C;&#xBC84;&#xC758; &#xBA54;&#xC778; &#xB85C;&#xC9C1;&#xC744; &#xB2F4;&#xACE0; &#xC788;&#xB294; &#xD0C0;&#xAC9F; &#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xCC3E;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC7A0;&#xAE50; <code>Remote Desktop Service</code> &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xD6D1;&#xACE0; &#xAC00;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs powershell"><span class="hljs-built_in">PS</span> C:\&gt; <span class="hljs-built_in">gci</span> HKLM:\SYSTEM\CurrentControlSet\Services\<span class="hljs-variable">$</span>((<span class="hljs-built_in">Get-Service</span> <span class="hljs-literal">-Name</span> <span class="hljs-string">&quot;Remote Desktop Services&quot;</span>).Name)    Hive: HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\TermServiceName                           Property----                           --------Parameters                     ServiceDll             : C:\Windows\System32\termsrv.dll. . .</code></pre><p>RDP &#xC11C;&#xBC84;&#xC758; &#xBA54;&#xC778; &#xB85C;&#xC9C1;&#xC740; termsrv.dll&#xC5D0; &#xB4E4;&#xC5B4; &#xC788;&#xB294;&#xB370;, &#xC774; dll&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xCEE4;&#xB9E8;&#xB4DC; &#xB77C;&#xC778;&#xC73C;&#xB85C; svchost.exe&#xC5D0; &#xB85C;&#xB4DC;&#xB429;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs latex">C:<span class="hljs-tag">\<span class="hljs-name">Windows</span></span><span class="hljs-tag">\<span class="hljs-name">System</span></span>32<span class="hljs-tag">\<span class="hljs-name">svchost</span></span>.exe -k NetworkService -s TermService</code></pre><p>&#xC11C;&#xBC84; &#xD37C;&#xC9D5; &#xBC29;&#xBC95;&#xC740; &#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC720;&#xC0AC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. <code>TermService</code>&#xC758; &#xC5EC;&#xB7EC; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xAC19;&#xC740; &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xC5EC;&#xB7EC; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xBCD1;&#xB82C;&#xC801;&#xC73C;&#xB85C; &#xD37C;&#xC9D5;&#xD558;&#xB294; &#xAC83;&#xC774;&#xC5C8;&#xC8E0;. &#xD558;&#xC9C0;&#xB9CC; Windows&#xC5D0;&#xC11C; &#xC774;&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xC544;&#xC11C; &#xAF64;&#xB098; &#xD070; &#xCC4C;&#xB9B0;&#xC9C0;&#xAC00; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6B0;&#xB9AC;&#xB294; &#xC774;&#xB97C; &#xACE0;&#xCE58;&#xAE30; &#xC704;&#xD574; &#xB178;&#xB825;&#xD588;&#xC9C0;&#xB9CC; <code>termsrv.dll</code>&#xC5D0;&#xC11C; <code>TermService</code>&#xC640; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xB4E4;&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xD558;&#xB4DC;&#xCF54;&#xB529;&#xB41C; &#xBB38;&#xC790;&#xC5F4;&#xB4E4;&#xC744; &#xBC1C;&#xACAC;&#xD558;&#xC600;&#xACE0;, &#xB530;&#xB77C;&#xC11C; &#xADF8;&#xB0E5; &#xC5EC;&#xB7EC; VM&#xC744; &#xD65C;&#xC6A9;&#xD574; &#xC11C;&#xBC84;&#xB97C; &#xBCD1;&#xB82C; &#xD37C;&#xC9D5;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xACB0;&#xC815;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xD37C;&#xC9D5; &#xC14B;&#xC5C5;&#xC5D0;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; &#xC11C;&#xBC84; &#xC0AC;&#xC774;&#xB4DC; API&#xB97C; &#xD65C;&#xC6A9;&#xD574; <a href="https://docs.microsoft.com/en-us/windows/win32/api/wtsapi32/nf-wtsapi32-wtsvirtualchannelwrite"><code>WTSVirtualChannelWrite()</code></a> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC5EC; &#xD37C;&#xC9D5; &#xC778;&#xD48B;&#xC744; &#xD0C0;&#xAC9F;&#xC5D0;&#xAC8C; &#xC804;&#xC1A1;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; RDP &#xC5F0;&#xACB0; &#xC0C1;&#xD669;&#xC5D0;&#xC11C; &#xC11C;&#xBC84;&#xB85C; &#xC778;&#xD48B;&#xC744; &#xC804;&#xB2EC;&#xD560; &#xC218; &#xC788;&#xB294; API&#xB294; &#xCC3E;&#xC9C0; &#xBABB;&#xD558;&#xC600;&#xC8E0;. &#xC774;&#xB85C; &#xC778;&#xD574; &#xC800;&#xD76C;&#xB294; &#xCEE4;&#xC2A4;&#xD140;&#xD55C; <a href="https://www.freerdp.com/">FreeRDP</a>(&#xC778;&#xC2DC;&#xC788;&#xB294; &#xC624;&#xD508;&#xC18C;&#xC2A4; RDP &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC8E0;)&#xB97C; &#xD65C;&#xC6A9;&#xD574; &#xC6B0;&#xBD84;&#xD22C; &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xC11C;&#xBC84;&#xB85C; &#xC778;&#xD48B;&#xC744; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC120;&#xD0DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; &#xBC29;&#xBC95;&#xC740; &#xC774;&#xC0C1;&#xC801;&#xC778; &#xD37C;&#xC9D5; &#xC14B;&#xC5C5;&#xC774; &#xC544;&#xB2C8;&#xACE0; &#xC774;&#xB7F0; &#xC81C;&#xC57D;&#xC870;&#xAC74; &#xB54C;&#xBB38;&#xC5D0; &#xC11C;&#xBC84; &#xD37C;&#xC9D5; &#xC2A4;&#xD53C;&#xB4DC;&#xAC00; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xD37C;&#xC9D5; &#xC2A4;&#xD53C;&#xB4DC;&#xC758; 1/10 &#xC815;&#xB3C4;&#xB418;&#xB294; &#xACB0;&#xACFC;&#xB97C; &#xB0B3;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/17/j0ker/rdp_fuzzing1/5.png" alt="Untitled"></p><blockquote><p>&#xC11C;&#xBC84; &#xD37C;&#xC9D5; &#xC0C1;&#xD669;</p></blockquote><p>&#xC11C;&#xBC84; &#xD37C;&#xC9D5; &#xC14B;&#xC5C5;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/17/j0ker/rdp_fuzzing1/6.png" alt="Untitled"></p><ul><li>Target : &#xD37C;&#xC9D5;&#xD560; &#xCC44;&#xB110;&#xC5D0; &#xB530;&#xB77C; &#xB2EC;&#xB77C;&#xC9D1;&#xB2C8;&#xB2E4;. tarmsrv.dll, audiodg.exe, rdpinput.exe &#xB4F1;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.(&#xB2E4;&#xC74C; &#xC139;&#xC158;&#xC5D0; &#xC788;&#xB294; &#x201C;Locating the relevant code&#x201D; &#xBD80;&#xBD84;&#xC744; &#xCC38;&#xACE0;&#xD574;&#xC8FC;&#xC138;&#xC694;. &#xAC01; &#xCC44;&#xB110;&#xC758; &#xD0C0;&#xAC9F;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xC774;&#xD574;&#xD558;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.)</li><li>Instrumentation : &#xC774;&#xB7F0; &#xC14B;&#xC5C5;&#xC5D0;&#xC11C;&#xB294; &#xD37C;&#xC800;&#xAC00; &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xCD08;&#xAE30;&#xD654;&#xB97C; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC800;&#xD76C;&#xB294; &#xCF54;&#xB4DC; &#xCEE4;&#xBC84;&#xB9AC;&#xC9C0;&#xB97C; &#xCE21;&#xC815;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xACE0; &#xC788;&#xB294; &#xD0C0;&#xAC9F;&#xC744; instrument&#xD560; &#xC218; &#xBC16;&#xC5D0; &#xC5C6;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; WinAFL&#xC744; &#xC120;&#xD0DD;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xACE0; &#xD655;&#xC7A5;&#xC131;&#xACFC; &#xC548;&#xC815;&#xC131;&#xC744; &#xC704;&#xD574; DynamoRIO&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>DynamoRIO : DynamoRIO&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBC16;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; attach&#xD558;&#xB294; &#xAC83;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC6B0;&#xB9AC;&#xB294; &#xC774; <a href="https://github.com/DynamoRIO/dynamorio/pull/3328">pull request</a>&#xB97C; &#xC218;&#xC815; &#xBC0F; &#xAC1C;&#xBC1C;&#xD558;&#xC600;&#xACE0; &#xC774;&#xB97C; WinAFL&#xC5D0; &#xBD99;&#xC5EC; &#xD65C;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>Mutation engine : Windows &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xACF5;&#xC720; &#xD3F4;&#xB354;&#xC5D0; &#xC788;&#xB294; &#xD30C;&#xC77C;&#xC5D0; &#xC0C8;&#xB85C;&#xC6B4; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB97C; &#xC4F0;&#xB294; AFL-Fuzzer</li><li>Input sender : Windows &#xBA38;&#xC2E0;&#xC5D0; &#xC788;&#xB294; &#xC11C;&#xBC84;&#xC5D0; &#xC5F0;&#xACB0;&#xD558;&#xB294; FreeRDP&#xB85C; &#xACF5;&#xC720; &#xD3F4;&#xB354;&#xC5D0; &#xC788;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xD14C;&#xC2A4;&#xD2B8; &#xCF00;&#xC774;&#xC2A4;&#xB4E4;&#xC744; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1;&#xD558;&#xACE0; &#xD0C0;&#xAC9F; RDP &#xCC44;&#xB110;&#xC5D0; &#xC804;&#xC1A1;</li></ul>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Translation/">Translation</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/fuzzing/">fuzzing</category>
      
      <category domain="https://hackyboiz.github.io/tags/network/">network</category>
      
      <category domain="https://hackyboiz.github.io/tags/winafl/">winafl</category>
      
      <category domain="https://hackyboiz.github.io/tags/j0ker/">j0ker</category>
      
      <category domain="https://hackyboiz.github.io/tags/server/">server</category>
      
      <category domain="https://hackyboiz.github.io/tags/rdp/">rdp</category>
      
      <category domain="https://hackyboiz.github.io/tags/instrumentation/">instrumentation</category>
      
      <category domain="https://hackyboiz.github.io/tags/dynamorio/">dynamorio</category>
      
      <category domain="https://hackyboiz.github.io/tags/client/">client</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/17/j0ker/rdp_fuzzing1/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] Broadcom SDK의 Buffer Overflow 취약점</title>
      <link>https://hackyboiz.github.io/2021/10/16/l0ch/2021-10-16/</link>
      <guid>https://hackyboiz.github.io/2021/10/16/l0ch/2021-10-16/</guid>
      <pubDate>Sat, 16 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://www.iot-inspector.com/blog/broadcom-sdk-vulnerabi</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://www.iot-inspector.com/blog/broadcom-sdk-vulnerabilities-bug-reports/">Swimming Upstream: Uncovering Broadcom SDK Vulnerabilities from Bug Reports</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul><li>Broadcom SDK</li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>&#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xAE30;&#xAE30;&#xC5D0; UPnP &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xAD6C;&#xD604;&#xD558;&#xB294; Broadcom SDK&#xC5D0;&#xC11C; &#xBC1C;&#xACAC;&#xB41C; &#xC2A4;&#xD0DD; &#xBC0F; &#xD799; &#xBC84;&#xD37C; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC138;&#xBD80; &#xC815;&#xBCF4;&#xAC00; &#xACF5;&#xAC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC740; &#xC57D; 10&#xB144; &#xC804; Broadcom SDK&#xB97C; &#xC0AC;&#xC6A9;&#xD55C; &#xBA87;&#xBA87; &#xAE30;&#xAE30;&#xC5D0;&#xC11C; &#xC774;&#xBBF8; &#xACF5;&#xAC1C;&#xB418;&#xC5B4; &#xD328;&#xCE58;&#xB410;&#xC9C0;&#xB9CC;, &#xADFC;&#xBCF8;&#xC801;&#xC778; &#xC6D0;&#xC778;&#xC778; Broadcom SDK&#xC5D0; &#xB300;&#xD55C; &#xC870;&#xCE58;&#xAC00; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xC9C0; &#xC54A;&#xC544; &#xC5EC;&#xC804;&#xD788; &#xB2E4;&#xB978; &#xC81C;&#xD488;&#xC5D0;&#xC11C;&#xB3C4; &#xC874;&#xC7AC;&#xD588;&#xB358; &#xAC83;&#xC73C;&#xB85C; &#xC54C;&#xB824;&#xC84C;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xBB38;&#xC81C;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xCC3E;&#xB294; &#xAC83;&#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC0AC;&#xD6C4; &#xAD00;&#xB9AC;&#xC640; &#xCEE4;&#xBBA4;&#xB2C8;&#xCF00;&#xC774;&#xC158;, &#xACF5;&#xAC1C; &#xAD8C;&#xACE0;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC778;&#xC2DD; &#xB610;&#xD55C; &#xC911;&#xC694;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC2DC;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="Stack-Buffer-Overflow"><a href="#Stack-Buffer-Overflow" class="headerlink" title="Stack Buffer Overflow"></a>Stack Buffer Overflow</h3><p>&#xC2A4;&#xD0DD; BOF &#xCDE8;&#xC57D;&#xC810;&#xC740; UPnP &#xAC80;&#xC0C9; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC774; &#xC0AC;&#xC6A9;&#xD558;&#xB294; HTTP &#xD615;&#xC2DD;&#xC758; UDP &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC778; SSDP(Simple Service Discovery Protocol) &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xCC98;&#xB9AC;&#xD560; &#xB54C; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p><p>SSDP&#xB97C; &#xD1B5;&#xD574; &#xB2E4;&#xC74C; &#xB450; &#xAC00;&#xC9C0; &#xC885;&#xB958;&#xC758; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xBCF4;&#xB0BC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li><strong>M-SEARCH :</strong> &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xAC80;&#xC0C9;&#xD560; &#xB54C; &#xC804;&#xC1A1;&#xD569;&#xB2C8;&#xB2E4;.</li><li><strong>NOTIFY :</strong> UPnP &#xC11C;&#xBC84;&#xAC00; &#xBA40;&#xD2F0;&#xCE90;&#xC2A4;&#xD2B8; &#xADF8;&#xB8F9;&#xC5D0; &#xC11C;&#xBE44;&#xC2A4; &#xC815;&#xBCF4;&#xC758; &#xC124;&#xC815; &#xB4F1;&#xC744; &#xC54C;&#xB9AC;&#xAE30; &#xC704;&#xD574; &#xC804;&#xC1A1;&#xD569;&#xB2C8;&#xB2E4;.</li></ul><p>&#xC774;&#xC911; M-SEARCH &#xBA54;&#xC2DC;&#xC9C0;&#xB294; <code>ssdp_msearch</code> &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xCC98;&#xB9AC;&#xB429;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">ssdp_msearch</span><span class="hljs-params">(UPNP_CONTEXT *context)</span> </span>{        <span class="hljs-keyword">char</span> name[<span class="hljs-number">128</span>]; ...        host = context-&gt;HOST;         <span class="hljs-keyword">if</span> (!host || <span class="hljs-built_in">strcmp</span>(host, <span class="hljs-string">&quot;239.255.255.250:1900&quot;</span>) != <span class="hljs-number">0</span>)                 <span class="hljs-keyword">return</span> <span class="hljs-number">-1</span>;         man = context-&gt;MAN;         <span class="hljs-keyword">if</span> (!man || <span class="hljs-built_in">strcmp</span>(man, <span class="hljs-string">&quot;\\&quot;</span>ssdp:discover\\<span class="hljs-string">&quot;&quot;</span>) != <span class="hljs-number">0</span>)                 <span class="hljs-keyword">return</span> <span class="hljs-number">-1</span>;          st = context-&gt;ST; ...        <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (<span class="hljs-built_in">memcmp</span>(st, <span class="hljs-string">&quot;uuid:&quot;</span>, <span class="hljs-number">5</span>) == <span class="hljs-number">0</span>) { <span class="hljs-comment">// Vuln!</span>                <span class="hljs-comment">/* uuid */</span>                 type = MSEARCH_UUID;                 st += <span class="hljs-number">5</span>;                 <span class="hljs-built_in">strcpy</span>(name, st);         } }</code></pre><p>HTTP &#xC694;&#xCCAD;&#xC758; <code>ST</code> &#xD544;&#xB4DC;&#xAC00; &#x201C;uuid:&#x201D;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xACBD;&#xC6B0; <code>strcpy()</code>&#xB85C; <code>name[128]</code>&#xC5D0; <code>ST</code> &#xD544;&#xB4DC;&#xC758; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xBCF5;&#xC0AC;&#xD558;&#xB294;&#xB370;, &#xAE38;&#xC774; &#xAC80;&#xC0AC;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xC9C0; &#xC54A;&#xC544; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740; &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0B4;&#xBA74; Stack Buffer Overflow&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c">M-SEARCH * HTTP/<span class="hljs-number">1.1</span>HOST:<span class="hljs-number">239.255</span><span class="hljs-number">.255</span><span class="hljs-number">.250</span>:<span class="hljs-number">1900</span>ST:uuid:AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA...MX:<span class="hljs-number">2</span>MAN:<span class="hljs-string">&quot;ssdp:discover&quot;</span></code></pre><h3 id="Heap-Buffer-Overflow"><a href="#Heap-Buffer-Overflow" class="headerlink" title="Heap Buffer Overflow"></a>Heap Buffer Overflow</h3><p>UPnP&#xB294; SOAP(Simple Object Access Protocol) &#xC694;&#xCCAD;&#xC744; UPnP &#xC81C;&#xC5B4; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xC804;&#xC1A1;&#xD574; port forwarding &#xADDC;&#xCE59;&#xC744; &#xC124;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. SOAP &#xC694;&#xCCAD;&#xC5D0;&#xB294; &#xB0B4;&#xBD80; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;, &#xB0B4;&#xBD80; &#xD3EC;&#xD2B8;, &#xC6D0;&#xACA9; IP, &#xC6D0;&#xACA9; &#xD3EC;&#xD2B8;, &#xD504;&#xB85C;&#xD1A0;&#xCF5C;, &#xADDC;&#xCE59; &#xC9C0;&#xC18D;&#xC2DC;&#xAC04;&#xC774; &#xD3EC;&#xD568;&#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xCDE8;&#xC57D;&#xC810;&#xC740; SOAP &#xC694;&#xCCAD;&#xC5D0; &#xB530;&#xB77C; &#xC0C8;&#xB85C;&#xC6B4; &#xD3EC;&#xD2B8;&#xB97C; &#xB9E4;&#xD551;&#xD558;&#xB294; <code>upnp_portmap_add</code> &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-comment">/* Add a new port mapping entry */</span><span class="hljs-keyword">int</span>upnp_portmap_add(        UPNP_CONTEXT    *context,        <span class="hljs-keyword">char</span>            *remote_host,        <span class="hljs-keyword">unsigned</span> <span class="hljs-keyword">short</span>  external_port,        <span class="hljs-keyword">char</span>            *protocol,        <span class="hljs-keyword">unsigned</span> <span class="hljs-keyword">short</span>  internal_port,        <span class="hljs-keyword">char</span>            *internal_client,        <span class="hljs-keyword">unsigned</span> <span class="hljs-keyword">int</span>    enable,        <span class="hljs-keyword">char</span>            *description,        <span class="hljs-keyword">unsigned</span> <span class="hljs-keyword">long</span>   duration){        UPNP_PORTMAP_CTRL *portmap_ctrl;        UPNP_PORTMAP *<span class="hljs-built_in">map</span>;        <span class="hljs-comment">/* Get control body */</span>        portmap_ctrl = (UPNP_PORTMAP_CTRL *)(context-&gt;focus_ifp-&gt;focus_devchain-&gt;devctrl);        <span class="hljs-comment">/* data validation */</span>        <span class="hljs-keyword">if</span> (strcasecmp(protocol, <span class="hljs-string">&quot;TCP&quot;</span>) != <span class="hljs-number">0</span> &amp;&amp;                strcasecmp(protocol, <span class="hljs-string">&quot;UDP&quot;</span>) != <span class="hljs-number">0</span>) {                upnp_syslog(LOG_ERR, <span class="hljs-string">&quot;add_portmap:: Invalid protocol&quot;</span>);                <span class="hljs-keyword">return</span> SOAP_ARGUMENT_VALUE_INVALID;        }...        <span class="hljs-comment">/* Update database */</span>        <span class="hljs-built_in">map</span>-&gt;external_port  = external_port;        <span class="hljs-built_in">map</span>-&gt;internal_port  = internal_port;        <span class="hljs-built_in">map</span>-&gt;enable         = enable;        <span class="hljs-built_in">map</span>-&gt;duration           = duration;        <span class="hljs-built_in">map</span>-&gt;book_time          = time(<span class="hljs-number">0</span>);        <span class="hljs-built_in">strcpy</span>(<span class="hljs-built_in">map</span>-&gt;remote_host,        remote_host);        <span class="hljs-built_in">strcpy</span>(<span class="hljs-built_in">map</span>-&gt;protocol,           protocol);        <span class="hljs-built_in">strcpy</span>(<span class="hljs-built_in">map</span>-&gt;internal_client,    internal_client);        <span class="hljs-built_in">strcpy</span>(<span class="hljs-built_in">map</span>-&gt;description,        description);...        <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;}</code></pre><p><code>upnp_portmap_add</code>&#xB294; &#xC218;&#xC2E0;&#xD55C; &#xC694;&#xCCAD;&#xC5D0; &#xB300;&#xD55C; &#xC720;&#xD6A8;&#xC131;&#xC744; &#xAC80;&#xC99D;&#xD558;&#xACE0; &#xAE30;&#xC874;&#xC5D0; &#xC124;&#xC815;&#xB41C; port map&#xC774; &#xC5C6;&#xC73C;&#xBA74; &#xC0C8; port map &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xD560;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;. &#xC0C8;&#xB85C;&#xC6B4; port map &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xC124;&#xC815;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; <code>strcpy()</code> &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xAE38;&#xC774; &#xAC80;&#xC99D;&#xC744; &#xD558;&#xC9C0; &#xC54A;&#xC544; Heap Buffer Overflow&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/cve/">cve</category>
      
      <category domain="https://hackyboiz.github.io/tags/bof/">bof</category>
      
      <category domain="https://hackyboiz.github.io/tags/buffer-overflow/">buffer overflow</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      <category domain="https://hackyboiz.github.io/tags/vulnerability/">vulnerability</category>
      
      <category domain="https://hackyboiz.github.io/tags/broadcom/">broadcom</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/16/l0ch/2021-10-16/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] Proxy Server</title>
      <link>https://hackyboiz.github.io/2021/10/15/poosic/proxy-server/</link>
      <guid>https://hackyboiz.github.io/2021/10/15/poosic/proxy-server/</guid>
      <pubDate>Fri, 15 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xD504;&amp;#xB85D;&amp;#xC2DC; &amp;#xC11C;&amp;#xBC84;&amp;#xB294; proxy&amp;#xB77C;&amp;#xB294; &amp;#xB2E8;&amp;#xC5B4;&amp;#xAC00; &amp;#x2018;&amp;#xB300;&amp;#xB9AC;&amp;#xC790;&amp;#x2019;</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xB294; proxy&#xB77C;&#xB294; &#xB2E8;&#xC5B4;&#xAC00; &#x2018;&#xB300;&#xB9AC;&#xC790;&#x2019;&#xB77C;&#xB294; &#xB73B;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB2E4;&#xC2DC;&#xD53C;, &#xBB34;&#xC5B8;&#xAC00;&#xB97C; &#xB300;&#xC2E0; &#xD574;&#xC8FC;&#xB294; &#xB300;&#xB9AC;&#xC790; &#xC11C;&#xBC84;&#xC785;&#xB2C8;&#xB2E4;. &#xC11C;&#xBE44;&#xC2A4; &#xC81C;&#xACF5;&#xC744; &#xC6D0;&#xD558;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC640; &#xC11C;&#xBE44;&#xC2A4; &#xC81C;&#xACF5;&#xC744; &#xD558;&#xB294; &#xC11C;&#xBC84;&#xCE21;&#xC758; &#xC911;&#xAC04;&#xC5D0; &#xB07C;&#xC5B4;&#xC11C; &#xC911;&#xACC4;&#xC790; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="&#xD504;&#xB85D;&#xC2DC;-&#xC11C;&#xBC84;&#xC758;-&#xC874;&#xC7AC;-&#xC774;&#xC720;"><a href="#&#xD504;&#xB85D;&#xC2DC;-&#xC11C;&#xBC84;&#xC758;-&#xC874;&#xC7AC;-&#xC774;&#xC720;" class="headerlink" title="&#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xC758; &#xC874;&#xC7AC; &#xC774;&#xC720;"></a>&#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xC758; &#xC874;&#xC7AC; &#xC774;&#xC720;</h3><p>&#xC65C; &#xC9C1;&#xC811; &#xD1B5;&#xC2E0;&#xC744; &#xD558;&#xC9C0;&#xC54A;&#xACE0; &#xAD73;&#xC774; &#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xB97C; &#xACBD;&#xC720;&#xD560;&#xAE4C;&#xC694;?</p><p>&#xCCAB; &#xBC88;&#xC9F8; &#xC774;&#xC720;&#xB294; &#xBCF4;&#xC548;&#xC5D0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xBA74; &#xBCF4;&#xC548;&#xC0C1; &#xC9C1;&#xC811; &#xD1B5;&#xC2E0;&#xC774; &#xBD88;&#xAC00;&#xB2A5; &#xD558;&#xB354;&#xB77C;&#xB3C4; &#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xC758; &#xB300;&#xB9AC; &#xD1B5;&#xC2E0;&#xC744; &#xD1B5;&#xD574; &#xD1B5;&#xC2E0;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, &#xC11C;&#xBC84; &#xC785;&#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xBD88;&#xD544;&#xC694;&#xD55C; &#xC678;&#xBD80;&#xC758; &#xC561;&#xC138;&#xC2A4; &#xC5C6;&#xC774; &#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xC5D0; &#xB300;&#xD55C; &#xC561;&#xC138;&#xC2A4;&#xB9CC; &#xC2E0;&#xACBD;&#xC4F0;&#xBA74; &#xB418;&#xAE30;&#xB54C;&#xBB38;&#xC5D0; &#xC9D1;&#xC911;&#xC801;&#xC73C;&#xB85C; &#xAD00;&#xB9AC;&#xD558;&#xAE30;&#xAC00; &#xD3B8;&#xD574;&#xC9D1;&#xB2C8;&#xB2E4;.</p><p>&#xB450; &#xBC88;&#xC9F8; &#xC774;&#xC720;&#xB294; &#xD6A8;&#xC728;&#xC774; &#xB192;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xC758; &#xCE90;&#xC2DC; &#xAE30;&#xB2A5;&#xC744; &#xC774;&#xC6A9;&#xD574; &#xC694;&#xCCAD;&#xB41C; &#xB0B4;&#xC6A9;&#xB4E4;&#xC744; &#xC800;&#xC7A5;&#xD574; &#xB193;&#xB294;&#xB2E4;&#xBA74; &#xB2E4;&#xC2DC; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xD574;&#xB2F9; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD544;&#xC694;&#xD558;&#xAC8C; &#xB41C;&#xB2E4;&#xBA74; &#xC11C;&#xBC84;&#xC5D0; &#xC694;&#xCCAD;&#xC744; &#xBCF4;&#xB0BC; &#xD544;&#xC694; &#xC5C6;&#xC774; &#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xBC14;&#xB85C; &#xCC98;&#xB9AC;&#xD574; &#xC804;&#xC1A1;&#xD560; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC11C;&#xBC84;&#xC5D0; &#xB300;&#xD55C; &#xBD80;&#xB2F4;&#xC774; &#xC801;&#xACE0; &#xB354;&#xC6B1; &#xBE60;&#xB974;&#xAC8C; &#xC804;&#xC1A1;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="&#xD504;&#xB85D;&#xC2DC;-&#xC11C;&#xBC84;&#xC758;-&#xC885;&#xB958;"><a href="#&#xD504;&#xB85D;&#xC2DC;-&#xC11C;&#xBC84;&#xC758;-&#xC885;&#xB958;" class="headerlink" title="&#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xC758; &#xC885;&#xB958;"></a>&#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xC758; &#xC885;&#xB958;</h3><p>&#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xB294; &#xD06C;&#xAC8C; 2&#xAC00;&#xC9C0;, &#xD3EC;&#xC6CC;&#xB4DC; &#xD504;&#xB85D;&#xC2DC;&#xC640; &#xB9AC;&#xBC84;&#xC2A4; &#xD504;&#xB85D;&#xC2DC;&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/15/poosic/proxy-server/image1.png" alt></p><p>&#xD3EC;&#xC6CC;&#xB4DC; &#xD504;&#xB85D;&#xC2DC;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xC11C;&#xBC84;&#xC5D0; &#xBB34;&#xC5B8;&#xAC00; &#xC694;&#xCCAD;&#xD560; &#xB54C; &#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xB97C; &#xD1B5;&#xD574; &#xC694;&#xCCAD;&#xD558;&#xACE0; &#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xB294; &#xC778;&#xD130;&#xB137;&#xC5D0; &#xC788;&#xB294; &#xC11C;&#xBC84;&#xC5D0; &#xC774;&#xB97C; &#xC804;&#xB2EC;&#xD574;&#xC8FC;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;. &#xC989;, &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xB0B4;&#xBD80;&#xB9DD;&#xC5D0; &#xC788;&#xB294; &#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC774; &#xD3EC;&#xC6CC;&#xB4DC; &#xD504;&#xB85D;&#xC2DC; &#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC774; &#xBC29;&#xC2DD;&#xC740; &#xC778;&#xD130;&#xB124; &#xC0C1;&#xC5D0; &#xC788;&#xB294; &#xC11C;&#xBC84;&#xAC00; &#xBC1B;&#xB294; &#xC694;&#xCCAD;&#xC790;&#xC758; ip&#xC8FC;&#xC18C;&#xB294; &#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xC758; ip&#xC8FC;&#xC18C;&#xAC00; &#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC11C;&#xBC84;&#xC5D0;&#xAC8C; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; &#xC815;&#xCCB4;&#xB97C; &#xAC10;&#xCD94;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xBC29;&#xC2DD;&#xC740; &#xC545;&#xC131; &#xCF54;&#xB4DC; &#xC720;&#xD3EC;&#xB4F1;&#xACFC; &#xAC19;&#xC740; &#xBD88;&#xBC95;&#xC801;&#xC778; &#xC77C;&#xC5D0; &#xC774;&#xC6A9;&#xB420;&#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB300;&#xBD80;&#xBD84; &#xD504;&#xB860;&#xD2B8; &#xD504;&#xB85D;&#xC2DC;&#xB294; &#xAC80;&#xCD9C;&#xD558;&#xC5EC; &#xCC28;&#xB2E8;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/15/poosic/proxy-server/image2.png" alt></p><p>&#xB9AC;&#xBC84;&#xC2A4; &#xD504;&#xB85D;&#xC2DC;&#xB294; &#xC778;&#xD130;&#xB137; &#xC0C1;&#xC5D0; &#xC788;&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xAC00; &#xBB34;&#xC5B8;&#xAC00;&#xB97C; &#xC694;&#xCCAD;&#xD560; &#xB54C; &#xC11C;&#xBC84;&#xC5D0; &#xC774;&#xB97C; &#xC804;&#xB2EC;&#xD574;&#xC8FC;&#xACE0; &#xC751;&#xB2F5;&#xC744; &#xBC1B;&#xC544;&#xAC00;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;. &#xC989;, &#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xAC00; &#xB0B4;&#xBD80;&#xB9DD;&#xC5D0; &#xC788;&#xB294; &#xC11C;&#xBE44;&#xC2A4; &#xC11C;&#xBC84;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC774; &#xB9AC;&#xBC84;&#xC2A4; &#xD504;&#xB85D;&#xC2DC; &#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xB9AC;&#xBC84;&#xC2A4; &#xD504;&#xB85D;&#xC2DC; &#xBC29;&#xC2DD;&#xC740; &#xD3EC;&#xC6CC;&#xB4DC; &#xD504;&#xB85D;&#xC2DC;&#xC640;&#xB294; &#xBC18;&#xB300;&#xB85C; &#xB0B4;&#xBD80;&#xB9DD;&#xC5D0; &#xC788;&#xB294; &#xC11C;&#xBE44;&#xC2A4; &#xC11C;&#xBC84;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC11C;&#xBE44;&#xC2A4; &#xC11C;&#xBC84;&#xC758; ip&#xC8FC;&#xC18C;&#xB97C; &#xAC10;&#xCDB0;&#xC8FC;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/poosic/">poosic</category>
      
      <category domain="https://hackyboiz.github.io/tags/proxy/">proxy</category>
      
      <category domain="https://hackyboiz.github.io/tags/proxy-server/">proxy server</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/15/poosic/proxy-server/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] Kernel Exploitation on Apple&#39;s M1 Chip</title>
      <link>https://hackyboiz.github.io/2021/10/14/j0ker/2021-10-14/</link>
      <guid>https://hackyboiz.github.io/2021/10/14/j0ker/2021-10-14/</guid>
      <pubDate>Thu, 14 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://github.com/ZecOps/public/blob/master/CVE-2021-307</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://github.com/ZecOps/public/blob/master/CVE-2021-30714/obts4_keynote.pdf">Kernel Exploitation on Apple&#x2019;s M1 Chip</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><p>M1 based Mac</p><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>&#xC560;&#xD50C; M1 &#xCE69; &#xAE30;&#xBC18;&#xC758; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xC5D0;&#xC11C; &#xCEE4;&#xB110; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD55C; <code>AppleAVE2</code> &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB294; IOKit &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xB85C; HJ264, HEVC &#xB4F1; &#xBE44;&#xB514;&#xC624; &#xC778;&#xCF54;&#xB529;&#xC744; &#xB2F4;&#xB2F9;&#xD558;&#xB294; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC624;&#xB298;&#xC740; &#xCCAB; &#xBC88;&#xC9F8;&#xC744; &#xAC00;&#xC838;&#xC640;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCDE8;&#xC57D;&#xC810; <code>Arbitrary Read</code> &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C;  <code>AppleAVE2Driver::EncodeFrame</code>&#xC5D0; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/14/j0ker/2021-10-14/1.png" alt></p><p>v28&#xC740; <code>user-kernel shared mapping memory</code>&#xC5D0;&#xC11C; &#xBC14;&#xB85C; &#xAC00;&#xC838;&#xC624;&#xBA74; &#xB530;&#xB85C; &#xC0AC;&#xC774;&#xC988;&#xB098; &#xC624;&#xBC84;&#xD50C;&#xB85C;&#xC6B0; &#xCCB4;&#xD06C;&#xB97C; &#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xC11C;&#xB294; <code>v28</code>&#xC744; &#xC624;&#xD504;&#xC14B;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; <code>clientbuf</code>&#xC5D0; &#xC788;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC624;&#xBC84;&#xB77C;&#xC774;&#xD2B8;&#xD558;&#xB294;&#xB370;, &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xC6D0;&#xD558;&#xB294; &#xACF3;&#xC5D0; &#xC6D0;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC4F8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xBA54;&#xBAA8;&#xB9AC; &#xCEE4;&#xB7FD;&#xC158;&#xC740; <code>AppleAVE2Driver::ProcessReadyCmd</code>&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xD568;&#xC218;&#xC5D0;&#xC11C;&#xB294; <code>clientbuf</code>&#xC758; &#xBC94;&#xC704; &#xC548;&#xC5D0; &#xC788;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xB123;&#xC744; &#xC218; &#xC788;&#xB294;&#xB370;, &#xC720;&#xC800;&#xC2A4;&#xD398;&#xC774;&#xC2A4;&#xC5D0; &#xBA54;&#xD551;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xCEE4;&#xB110;&#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xB123;&#xC74C;&#xC73C;&#xB85C;&#xC368; &#xD574;&#xB2F9; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xD1B5;&#xD574; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; <code>clientbuf&#x2192;cmd_nodeList</code> &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xC624;&#xBC84;&#xB77C;&#xC774;&#xD2B8;&#xD558;&#xBA74; <code>AppleAVE2Driver::ProcessReadyCmd</code>&#xC758; &#xC138;&#xBC88;&#xC9F8; &#xD30C;&#xB77C;&#xBBF8;&#xD130;(<code>v16</code>)&#xB97C; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/14/j0ker/2021-10-14/2.png" alt></p><p><img src="/2021/10/14/j0ker/2021-10-14/3.png" alt></p><p><code>v16</code>&#xC744; &#xC870;&#xC791;&#xD558;&#xC5EC; &#xC6D0;&#xD558;&#xB294; &#xC8FC;&#xC18C;&#xC758; 4&#xBC14;&#xC774;&#xD2B8;&#xB97C; &#xC77D;&#xC5B4;&#xC62C; &#xC218; &#xC788;&#xACE0; <code>AppleAVE2Driver::PreInitCreateContext</code> &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xD574;&#xB2F9; &#xAC12;&#xC744; &#xC720;&#xC800;&#xB79C;&#xB4DC;&#xB85C; &#xC77D;&#xC5B4;&#xC62C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/mac/">mac</category>
      
      <category domain="https://hackyboiz.github.io/tags/kernel/">kernel</category>
      
      <category domain="https://hackyboiz.github.io/tags/apple/">apple</category>
      
      <category domain="https://hackyboiz.github.io/tags/j0ker/">j0ker</category>
      
      <category domain="https://hackyboiz.github.io/tags/driver/">driver</category>
      
      <category domain="https://hackyboiz.github.io/tags/m1/">m1</category>
      
      <category domain="https://hackyboiz.github.io/tags/iokit/">iokit</category>
      
      <category domain="https://hackyboiz.github.io/tags/appleave2/">appleave2</category>
      
      <category domain="https://hackyboiz.github.io/tags/encoder/">encoder</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/14/j0ker/2021-10-14/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] File Descriptor</title>
      <link>https://hackyboiz.github.io/2021/10/13/y00n_nms/file-descriptor/</link>
      <guid>https://hackyboiz.github.io/2021/10/13/y00n_nms/file-descriptor/</guid>
      <pubDate>Wed, 13 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;blockquote&gt;
&lt;p&gt;&amp;#xC804;&amp;#xD654; &amp;#xD55C; &amp;#xD1B5;&amp;#xB9CC; &amp;#xD558;&amp;#xBA74; &amp;#xD544;&amp;#xC694;&amp;#xD55C; &amp;#xB17C;&amp;#xBB38;&amp;#xC744; &amp;#xBCF5;&amp;#xC0A</description>
        
      
      
      
      <content:encoded><![CDATA[<blockquote><p>&#xC804;&#xD654; &#xD55C; &#xD1B5;&#xB9CC; &#xD558;&#xBA74; &#xD544;&#xC694;&#xD55C; &#xB17C;&#xBB38;&#xC744; &#xBCF5;&#xC0AC;&#xD574; &#xC8FC;&#xB294; &#xACF3;&#xC774; &#xC788;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xADF8;&#xACF3;&#xC758; &#xB2E8;&#xACE8;&#xC190;&#xB2D8; &#xC601;&#xC218;&#xAC00; &#xC788;&#xB2E4;. &#xADF8;&#xB7F0;&#xB370; &#xC774; &#xB140;&#xC11D;&#xC740; &#xB9E4;&#xBC88; &#xB611;&#xAC19;&#xC740; &#xB17C;&#xBB38;&#xC758; &#xC77C;&#xBD80;&#xBD84;&#xC744; &#xBCF5;&#xC0AC;&#xD574; &#xB2EC;&#xB77C;&#xACE0; &#xD55C;&#xB2E4;. &#x201C;&#xC544;&#xC800;&#xC528;~ &#x2018;&#xACE0;&#xB3C4;&#xC758; &#xC815;&#xBCF4;&#xD654; &#xC0AC;&#xD68C;&#xAC00; &#xB418;&#xC5B4; &#xAC00;&#xBA74;&#xC11C;, &#xC778;&#xAC04;&#xC758; &#xC0B6;&#xC758; &#xC9C8;&#xACFC; &#xAD00;&#xACC4;&#xB41C; &#xBB38;&#xC81C;&#xB4E4;&#xC774; &#xC810;&#xC810; &#xB354; &#xADF8; &#xC911;&#xC694;&#xC131;&#xC774; &#xB354;&#xD574;&#xC9D0;&#xC5D0; &#xB530;&#xB77C; &#xAC10;&#xAC01;, &#xC9C0;&#xAC01;, &#xC0AC;&#xACE0;, &#xC131;&#xACA9;, &#xC9C0;&#xB2A5;, &#xC801;&#xC131; &#xB4F1;&#xC758; &#xC778;&#xAC04;&#xC801; &#xD2B9;&#xC9D5;&#xB4E4;&#xC774; &#xACE0;&#xB824;&#xB410;&#xC744; &#xB54C;&#xC758; &#xC778;&#xAC04;&#xC758; &#xC6D0;&#xB9AC;&#xC5D0; &#xB300;&#xD55C; &#xC5F0;&#xAD6C;&#x2019; &#xB77C;&#xB294; &#xB17C;&#xBB38; 26&#xCABD;&#xBD80;&#xD130; 30&#xCABD;&#xAE4C;&#xC9C0; &#xBCF5;&#xC0AC;&#xD574; &#xC8FC;&#xC138;&#xC694;&#x201D; &#xC774; &#xB140;&#xC11D;&#xC740; &#xBCF4;&#xD1B5; &#xC774;&#xB7F0; &#xC2DD;&#xC73C;&#xB85C; &#xD558;&#xB8E8;&#xC5D0;&#xB3C4; &#xC5EC;&#xB7EC; &#xBC88; &#xC8FC;&#xBB38;&#xC744; &#xD55C;&#xB2E4;. &#xC124;&#xC0C1;&#xAC00;&#xC0C1;&#xC73C;&#xB85C; &#xB9D0;&#xD558;&#xB294; &#xC18D;&#xB3C4;&#xB3C4; &#xB290;&#xB9B0; &#xD3B8;&#xC774;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xC544;&#xC800;&#xC528;&#xAC00; &#xB9D0;&#xC500;&#xD558;&#xC2DC;&#xAE38; &#x201C;&#xADF8; &#xB17C;&#xBB38;&#xC740; &#xC774;&#xC81C;&#xBD80;&#xD130; &#xB108;&#xC758; 18&#xBC88;&#xC774;&#xB2E4;! &#xADF8;&#xB0E5; &#xC800;&#xC758; 18&#xBC88; &#xB17C;&#xBB38; 26&#xCABD;&#xBD80;&#xD130; 30&#xCABD;&#xAE4C;&#xC9C0; &#xBCF5;&#xC0AC;&#xD574; &#xC8FC;&#xC138;&#xC694; &#xB77C;&#xACE0; &#xD574;&#xB77C;!&#x201D;&#xC601;&#xC218;&#xB294; &#xADF8; &#xC774;&#xD6C4;&#xB85C;&#xB3C4; &#xCD5C;&#xC18C; 50&#xC790;&#xAC00; &#xB118;&#xB294; &#xC81C;&#xBAA9;&#xC758; &#xB17C;&#xBB38;&#xB9CC; &#xBCF5;&#xC0AC; &#xC8FC;&#xBB38;&#xC744; &#xD55C;&#xB2E4;. &#xADF8; &#xB54C; &#xB9C8;&#xB2E4; &#xC544;&#xC800;&#xC528;&#xB294; &#xB17C;&#xBB38;&#xC5D0; &#xC0C8;&#xB85C;&#xC6B4; &#xBC88;&#xD638;&#xB97C; &#xD560;&#xB2F9;&#xD574; &#xC900;&#xB2E4;(&#xC911;&#xBCF5;&#xB418;&#xC9C0; &#xC54A;&#xB294;). &#xADF8;&#xB798;&#xC57C; &#xC601;&#xC218;&#xC640;&#xC758; &#xB300;&#xD654; &#xC18D;&#xC5D0;&#xC11C; &#xC2A4;&#xD2B8;&#xB808;&#xC2A4;&#xB97C; &#xB35C; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xB2E4;.</p></blockquote><p>&#xD30C;&#xC77C; &#xB514;&#xC2A4;&#xD06C;&#xB9BD;&#xD130;&#xC5D0; &#xB300;&#xD574; &#xAC00;&#xC7A5; &#xC27D;&#xAC8C; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xB294; &#xC2A4;&#xD1A0;&#xB9AC;&#xC785;&#xB2C8;&#xB2E4;. (&#xCD9C;&#xCC98;: <a href="https://mintnlatte.tistory.com/266">https://mintnlatte.tistory.com/266</a>)</p><p>&#xD30C;&#xC77C; &#xB514;&#xC2A4;&#xD06C;&#xB9BD;&#xD130;&#xB294; &#xC77C;&#xBC18; &#xD30C;&#xC77C;, &#xD130;&#xBBF8;&#xB110;, &#xB514;&#xBC14;&#xC774;&#xC2A4;, &#xC18C;&#xCF13; &#xB4F1; &#xC885;&#xB958;&#xC5D0; &#xC0C1;&#xAD00;&#xC5C6;&#xC774; &#xC5F4;&#xB9B0; &#xD30C;&#xC77C;&#xC744; &#xC2DD;&#xBCC4;&#xD558;&#xAE30; &#xC704;&#xD558;&#xC5EC; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBD80;&#xD638;&#xC5C6;&#xB294; &#xC815;&#xC218;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#xC5F4;&#xB824;&#xC788;&#xB294; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD574; &#xCD5C;&#xC18C;&#xD55C; &#xD558;&#xB098;&#xC758; &#xD30C;&#xC77C; &#xB514;&#xC2A4;&#xD06C;&#xB9BD;&#xD130;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xBA70;, &#xBCF8;&#xC9C8;&#xC801;&#xC73C;&#xB85C; &#xCEE4;&#xB110;&#xC774; &#xBCF4;&#xAD00;&#xD558;&#xB294; File Descriptor Table&#xC5D0; &#xB300;&#xD55C; &#xC778;&#xB371;&#xC2A4;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xD30C;&#xC77C; &#xB514;&#xC2A4;&#xD06C;&#xB9BD;&#xD130;&#xB294; Unix&#xC5D0;&#xC11C; &#xCC98;&#xC74C; &#xC0AC;&#xC6A9;&#xB418;&#xC5C8;&#xC73C;&#xBA70; Linux, macOS &#xBC0F; BSD&#xB97C; &#xD3EC;&#xD568;&#xD55C; &#xC6B4;&#xC601; &#xCCB4;&#xC81C;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. Windows&#xC5D0;&#xC11C; &#xD30C;&#xC77C; &#xC124;&#xBA85;&#xC790;&#xB294; file handle&#xC774;&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p><p>C&#xC5B8;&#xC5B4; &#xB4F1;&#xC758; &#xC5B8;&#xC5B4;&#xB294; fprintf, fscanf &#xB4F1;&#xC758; &#xD568;&#xC218;&#xC640; &#xAC19;&#xC740; I/O&#xC744; &#xC704;&#xD55C; &#xAE30;&#xB2A5;&#xC774; &#xC788;&#xC9C0;&#xB9CC;, UNIX &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC5D0;&#xC11C;&#xB294; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD574; &#xCEE4;&#xB110;&#xC5D0; &#xC9C1;&#xC811; &#xC2DC;&#xC2A4;&#xD15C; &#xD638;&#xCD9C;&#xC744; &#xC694;&#xCCAD;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xCEE4;&#xB110;&#xC740; &#xD638;&#xCD9C;&#xC5D0; &#xB300;&#xD55C; &#xC751;&#xB2F5;&#xC73C;&#xB85C; &#xD30C;&#xC77C; &#xB514;&#xC2A4;&#xD06C;&#xB9BD;&#xD130;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xD30C;&#xC77C; &#xB514;&#xC2A4;&#xD06C;&#xB9BD;&#xD130;&#xB97C; &#xC2E4;&#xC81C; &#xD558;&#xB4DC;&#xC6E8;&#xC5B4; &#xC7A5;&#xCE58;, &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C; &#xB610;&#xB294; &#xD30C;&#xC77C;&#xACFC; &#xAC19;&#xC740; &#xAE30;&#xBCF8; &#xAC1D;&#xCCB4;&#xC758; &#xCD94;&#xC0C1;&#xD654;&#xC640; &#xC5F0;&#xACB0;&#xD569;&#xB2C8;&#xB2E4;. &#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xD30C;&#xC77C; &#xB514;&#xC2A4;&#xD06C;&#xB9BD;&#xD130;&#xB97C; &#xCC38;&#xC870;&#xD558;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; &#xC77D;&#xAE30; &#xB610;&#xB294; &#xC4F0;&#xAE30; &#xD638;&#xCD9C;&#xC740; &#xAD81;&#xADF9;&#xC801;&#xC73C;&#xB85C; &#xC720;&#xC6A9;&#xD55C; &#xC791;&#xC5C5;&#xC744; &#xC218;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD574; &#xCEE4;&#xB110;&#xC5D0; &#xC758;&#xD574; &#xC62C;&#xBC14;&#xB978; &#xC704;&#xCE58;&#xB85C; &#xB77C;&#xC6B0;&#xD305;&#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xD30C;&#xC77C; &#xC5F4;&#xAE30;&#xB97C; &#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xC694;&#xCCAD;&#xD558;&#xBA74; &#xCEE4;&#xB110;&#xC740; 1) &#xC561;&#xC138;&#xC2A4; &#xAD8C;&#xD55C;&#xC744; &#xBD80;&#xC5EC;&#xD558;&#xACE0;, 2) &#xC804;&#xC5ED; &#xD30C;&#xC77C; &#xD14C;&#xC774;&#xBE14;&#xC5D0; &#xD56D;&#xBAA9;&#xC744; &#xB9CC;&#xB4E0; &#xB2E4;&#xC74C; 3) &#xD574;&#xB2F9; &#xD56D;&#xBAA9;&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xD30C;&#xC77C; &#xB514;&#xC2A4;&#xD06C;&#xB9BD;&#xD130;&#xB97C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xD56D;&#xBAA9;&#xC5D0;&#xB294; &#xD30C;&#xC77C;&#xC758; inode, &#xBC14;&#xC774;&#xD2B8; &#xC624;&#xD504;&#xC14B; &#xBC0F; &#xD574;&#xB2F9; &#xB370;&#xC774;&#xD130; &#xC2A4;&#xD2B8;&#xB9BC;&#xC5D0; &#xB300;&#xD55C; &#xC561;&#xC138;&#xC2A4; &#xAD8C;&#xD55C;(&#xC77D;&#xAE30; &#xC804;&#xC6A9;, &#xC4F0;&#xAE30; &#xC804;&#xC6A9; &#xB4F1;)&#xACFC; &#xAC19;&#xC740; &#xC815;&#xBCF4;&#xAC00; &#xD3EC;&#xD568;&#xB429;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/13/y00n_nms/file-descriptor/image.png" alt="image"></p><p>&#xCC98;&#xC74C; 3&#xAC1C;&#xC758; &#xD30C;&#xC77C; &#xB514;&#xC2A4;&#xD06C;&#xB9BD;&#xD130;(0~2)&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC73C;&#xBA70; &#xC774;&#xD6C4;&#xC5D0; &#xD30C;&#xC77C;&#xC774; &#xC624;&#xD508;&#xB418;&#xAC70;&#xB098; &#xC18C;&#xCF13; &#xC0DD;&#xC131; &#xB4F1;&#xC744; &#xC218;&#xD589;&#xD560; &#xB54C; 3&#xBC88;&#xBD80;&#xD130; &#xBD80;&#xC5EC;&#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xD45C;&#xC900; &#xC785;&#xB825;(stdin, 0) ex) Keyboard File Object</p><p>&#xD45C;&#xC900; &#xCD9C;&#xB825;(stdout, 1) ex) Monitor File Object</p><p>&#xD45C;&#xC900; &#xC624;&#xB958;(stderr, 2, &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xC624;&#xB958;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xCD9C;&#xB825;) ex) Monitor File Object</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/y00n-nms/">y00n_nms</category>
      
      <category domain="https://hackyboiz.github.io/tags/file-descriptor/">file descriptor</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/13/y00n_nms/file-descriptor/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021-39863: Adobe Acrobat Reader DC Heap overflow</title>
      <link>https://hackyboiz.github.io/2021/10/12/fabu1ous/2021-10-12/</link>
      <guid>https://hackyboiz.github.io/2021/10/12/fabu1ous/2021-10-12/</guid>
      <pubDate>Tue, 12 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://blog.exodusintel.com/2021/10/04/analysis-of-a-hea</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://blog.exodusintel.com/2021/10/04/analysis-of-a-heap-buffer-overflow-vulnerability-in-adobe-acrobat-reader-dc-2/?utm_source=feedly&amp;utm_medium=rss&amp;utm_campaign=analysis-of-a-heap-buffer-overflow-vulnerability-in-adobe-acrobat-reader-dc-2">Analysis of a Heap Buffer-Overflow Vulnerability in Adobe Acrobat Reader DC</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a><strong>Target</strong></h2><p>Acrobat Reader DC version 2021.005.20060 &#xC774;&#xC804;</p><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a><strong>Explain</strong></h2><p>Acrobat Reader DC&#xC758; IA32.api&#xC5D0;&#xC11C; Heap buffer-overflow &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. Adobe Reader&#xB294; PDF&#xC5D0; embed &#xB41C; JavaScript&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD558;&#xAE30; &#xC704;&#xD574; &#xBAA8;&#xB4C8;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xC911; &#xC778;&#xD130;&#xB137; &#xC811;&#xC18D;&#xACFC; &#xAD00;&#xB839;&#xB41C; &#xB3D9;&#xC791;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294; IA32.api &#xBAA8;&#xB4C8;&#xC5D0;&#xC11C; base URL&#xACFC; relative URL&#xC744; &#xD569;&#xCE58;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xD574;&#xB2F9; &#xCDE8;&#xC57D;&#xC810;&#xC740; base URL&#xACFC; relative URL&#xC758; &#xC778;&#xCF54;&#xB529; &#xBC29;&#xC2DD;&#xC774; &#xB2E4;&#xB97C; &#xB54C; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. base URL&#xACFC; relative URL&#xC758; &#xAE38;&#xC774;&#xB97C; &#xACC4;&#xC0B0;&#xD574; destination buffer&#xB97C; &#xD560;&#xB2F9;&#xD558;&#xACE0; &#xC778;&#xCF54;&#xB529; &#xBC29;&#xC2DD;&#xC5D0; &#xB530;&#xB77C; &#xB370;&#xC774;&#xD130;&#xB97C; 1byte &#xD639;&#xC740; 2byte&#xC529; &#xBCF5;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;. &#xBB38;&#xC81C;&#xB294; base URL&#xC758; &#xC778;&#xCF54;&#xB529; &#xBC29;&#xC2DD;&#xB9CC;&#xC744; &#xD655;&#xC778;&#xD558;&#xACE0; destination buffer&#xC758; &#xD06C;&#xAE30;&#xC640; &#xBCF5;&#xC0AC;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC744; &#xC120;&#xD0DD;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p><p>base URL&#xC758; &#xC778;&#xCF54;&#xB529; &#xBC29;&#xC2DD;&#xC774; Unicode&#xACE0; relative URL&#xC758; &#xC778;&#xCF54;&#xB529; &#xBC29;&#xC2DD;&#xC774; ANSI&#xC77C; &#xB54C; &#xC2E4;&#xC81C; relative URL&#xC758; &#xAE38;&#xC774;&#xC758; 2&#xBC30;&#xAC00; &#xB418;&#xB294; &#xAE38;&#xC774;&#xC758; &#xB370;&#xC774;&#xD130;&#xAC00; &#xBCF5;&#xC0AC;&#xB418;&#xACE0;, &#xC774;&#xB294; out-of-bound read&#xC774;&#xBA70; &#xB3D9;&#xC2DC;&#xC5D0; out-of-bound write&#xC785;&#xB2C8;&#xB2E4;. </p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/adobe/">adobe</category>
      
      <category domain="https://hackyboiz.github.io/tags/pdf/">pdf</category>
      
      <category domain="https://hackyboiz.github.io/tags/url/">url</category>
      
      <category domain="https://hackyboiz.github.io/tags/acrobat-reader/">acrobat reader</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/12/fabu1ous/2021-10-12/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[Research] Hip하게 Heap 정복하기 Part 2 - Segment Heap(2)</title>
      <link>https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/</link>
      <guid>https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/</guid>
      <pubDate>Sun, 10 Oct 2021 09:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;, &amp;#xBC31;&amp;#xC2E0; 2&amp;#xCC28; &amp;#xB9DE;&amp;#xACE0; &amp;#xC628; L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;&amp;#x2026;&amp;#x316</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;, &#xBC31;&#xC2E0; 2&#xCC28; &#xB9DE;&#xACE0; &#xC628; L0ch&#xC785;&#xB2C8;&#xB2E4;&#x2026;&#x3160;&#x3160;&#x3160; </p><p><img src="/2021/10/10/l0ch/segment-heap-part2/Untitled.png" alt="Untitled"></p><p>&#xC800;&#xBC88; Part 1&#xC62C;&#xB9B4; &#xB54C;&#xB3C4; &#xB611;&#xAC19;&#xC740; &#xC774;&#xC288;&#xB85C; &#xC77C;&#xC8FC;&#xC77C; &#xBC00;&#xB838;&#xB358; &#xAC83; &#xAC19;&#xC740;&#xB370;, &#xD0C0;&#xC774;&#xBC0D;&#xC774; &#xB610;&#xB610; &#xACB9;&#xCE58;&#xAC8C; &#xB410;&#xB124;&#xC694;.. <del>&#xC0B4;&#xB824;&#xC918;</del></p><p>&#xC544;&#xBB34;&#xD2BC; 3&#xC77C; &#xC804;&#xC5D0; &#xBC31;&#xC2E0;&#xC744; &#xB9DE;&#xACE0; &#xCCAB;&#xB0A0; &#xC774;&#xD2BF;&#xB0A0;&#xAE4C;&#xC9C0; &#xAC70;&#xC758; 24&#xC2DC;&#xAC04;&#xC744; &#xB0B4;&#xB9AC; &#xC790;&#xB2E4;&#xAC00; &#xC67C;&#xCABD; &#xD314; &#xBD80;&#xC5EC;&#xC7A1;&#xC73C;&#xBA70; &#xC4F4; &#xAE00;&#xC785;&#xB2C8;&#xB2E4; &#x314E;&#x314E;; </p><p><img src="/2021/10/10/l0ch/segment-heap-part2/Untitled%201.png" alt="Untitled"></p><blockquote><p>1&#xCC28; &#xC544;&#xD504;&#xBA74; 2&#xCC28;&#xB294; &#xC548;&#xC544;&#xD504;&#xB2E4;&#xBA70;!!!! &#xB0A0; &#xC18D;&#xC600;&#xC5B4;!!!</p></blockquote><p>&#xADF8;&#xB098;&#xB9C8; &#xBC31;&#xC2E0; &#xB9DE;&#xAE30; &#xC804;&#xC5D0; &#xAC70;&#xC758; &#xB2E4; &#xC791;&#xC131;&#xD574;&#xB194;&#xC11C; &#xD391;&#xD06C;&#xB294; &#xC548; &#xB0C8;&#xB124;&#xC694; &#xD734;~!  (&#xB610; &#xD391;&#xD06C; &#xB0C8;&#xC73C;&#xBA74; &#xC55E;&#xC73C;&#xB85C; &#xD55C; &#xB2EC; &#xB3D9;&#xC548; &#xC81C; &#xAE00;&#xB9CC; &#xC62C;&#xB77C;&#xAC14;&#xC744; &#xBED4;&#xD588;&#xC9C0; &#xBB50;&#xC608;&#xC694;.. &#x2192; &#xC8FD;&#xC74C;&#xC744; &#xC758;&#xBBF8;)</p><p>&#xC774;&#xC804; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C; &#xD799; &#xC0DD;&#xC131;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBD24;&#xC73C;&#xB2C8; &#xBC14;&#xB85C; &#xBE14;&#xB85D; &#xD560;&#xB2F9;&#xBD80;&#xD130; &#xC2DC;&#xC791;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xC8E0;!</p><h1 id="RtlpHpAllocateHeap"><a href="#RtlpHpAllocateHeap" class="headerlink" title="RtlpHpAllocateHeap()"></a>RtlpHpAllocateHeap()</h1><p><code>HeapAlloc()</code> &#xB610;&#xB294; <code>RtlAllocateHeap()</code>&#xC744; &#xD1B5;&#xD574; Heap Block&#xC744; &#xD560;&#xB2F9;&#xD560; &#xB54C; Segment Heap&#xC5D0; &#xC758;&#xD574; &#xAD00;&#xB9AC;&#xB418;&#xB294; &#xACBD;&#xC6B0; &#xD560;&#xB2F9; &#xC694;&#xCCAD;&#xC740; <code>RtlpHpAllocateHeap()</code> &#xC73C;&#xB85C; &#xB77C;&#xC6B0;&#xD305; &#xB418;&#xBA70; <code>RtlpHpAllocateHeap()</code> &#xC758; &#xD568;&#xC218; &#xC6D0;&#xD615;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-function">PVOID <span class="hljs-title">RtlpHpAllocateHeap</span><span class="hljs-params">(_SEGMENT_HEAP* HeapBase, SIZE_T UserSize, ULONG Flags, USHORT Unknown)</span></span></code></pre><p>&#xD568;&#xC218;&#xB294; AllocSize&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC801;&#xC808;&#xD55C; Segment Heap&#xC758; &#xD560;&#xB2F9; &#xAE30;&#xB2A5;&#xC744; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;. (&#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; AllocSize&#xB294; &#xD568;&#xC218;&#xC758; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB85C; &#xC804;&#xB2EC;&#xB418;&#xB294; <code>UserSize</code>&#xC774;&#xBA70; <code>UserSize</code>&#xAC00; 0&#xC778; &#xACBD;&#xC6B0; 1&#xC774; &#xB429;&#xB2C8;&#xB2E4;.)</p><p>&#xD06C;&#xAE30;&#xC5D0; &#xB530;&#xB978; &#xD560;&#xB2F9; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC740; <a href="https://hackyboiz.github.io/2021/09/19/l0ch/segment-heap-part1/#%EA%B0%9C%EC%9A%94-Segment-Heap">Segment Heap &#xAC1C;&#xC694;</a> &#xC5D0;&#xC11C; &#xADF8;&#xB9BC;&#xACFC; &#xAC19;&#xC774; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xC124;&#xBA85;&#xD588;&#xC5C8;&#xC8E0;? &#xB2E4;&#xC2DC; &#xB098;&#xC5F4;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p><ul><li>Backend</li><li>Variable Size Allocation(VS)</li><li>Low Fragmentation Heap(LFH)</li><li>Large Blocks Allocation</li></ul><p>&#xC774; &#xC911; &#xC774;&#xBC88; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; Backend&#xC640; VS&#xB97C;, &#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; LFH&#xC640; Large Block&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCFC; &#xAC74;&#xB370;&#xC694;, &#xBC31;&#xC5D4;&#xB4DC;&#xBD80;&#xD130; &#xBC14;&#xB85C; &#xB118;&#xC5B4;&#xAC00; &#xBD05;&#xC2DC;&#xB2E4;!</p><h1 id="Backend-Allocation"><a href="#Backend-Allocation" class="headerlink" title="Backend Allocation"></a>Backend Allocation</h1><p>&#xBC31;&#xC5D4;&#xB4DC;&#xB294; 131,073 (0x20001, 128kb) &#xBD80;&#xD130; 520,192 (0x7F000, 508kb) &#xAE4C;&#xC9C0;&#xC758; &#xD560;&#xB2F9; &#xC694;&#xCCAD;&#xC744; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D;&#xC5D0;&#xB294; &#xD5E4;&#xB354;&#xAC00; &#xC5C6;&#xACE0;  &#xD398;&#xC774;&#xC9C0; &#xD06C;&#xAE30; &#xB2E8;&#xC704;&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C; VS/LFH&#xC758; subsegment&#xB294; &#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D;&#xC758; &#xD2B9;&#xC218; &#xD0C0;&#xC785;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; VS&#xC640; LFH &#xBE14;&#xB85D;&#xC774; &#xD560;&#xB2F9;&#xB420; &#xB54C;&#xC5D0;&#xB3C4; &#xBC31;&#xC5D4;&#xB4DC;&#xAC00; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p><h2 id="Segment-Structure"><a href="#Segment-Structure" class="headerlink" title="Segment Structure"></a>Segment Structure</h2><p>&#xBC31;&#xC5D4;&#xB4DC;&#xB294; <code>NtAllocateVirtualMemory()</code> &#xB97C; &#xD1B5;&#xD574; &#xD560;&#xB2F9;&#xB41C; &#xAC00;&#xC0C1; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; 1MB(0x100000) &#xBE14;&#xB85D;&#xC778; Segment &#xAD6C;&#xC870;&#xCCB4;&#xC5D0;&#xC11C; &#xAD00;&#xB9AC;&#xB418;&#xBA70; &#xC774;&#xB807;&#xAC8C; &#xC0DD;&#xC131;&#xB41C; Segment&#xB294;  <code>_SEGMENT_HEAP</code> &#x2192; <code>SegContexts</code> &#x2192; <code>SegmentListHead</code> &#xD544;&#xB4DC;&#xC5D0;&#xC11C; &#xCC38;&#xC870;&#xD569;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/10/l0ch/segment-heap-part2/Untitled%202.png" alt="Untitled"></p><p>&#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC758; &#xCCAB; 0x2000 bytes &#xAC00; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD5E4;&#xB354;&#xAC00; &#xB418;&#xACE0; &#xB098;&#xBA38;&#xC9C0;&#xB294; &#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D; &#xD560;&#xB2F9;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xBA70; 0x2000 bytes&#xB97C; &#xC81C;&#xC678;&#xD55C; &#xB098;&#xBA38;&#xC9C0;&#xB294; &#xC608;&#xC57D; &#xC0C1;&#xD0DC;&#xB85C; &#xC874;&#xC7AC;&#xD558;&#xB2E4;&#xAC00; &#xD544;&#xC694;&#xC5D0; &#xB530;&#xB77C; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD5E4;&#xB354;&#xC5D0;&#xB294; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC758; &#xAC01; &#xD398;&#xC774;&#xC9C0; &#xC0C1;&#xD0DC;&#xB97C; &#xC124;&#xBA85;&#xD558;&#xB294; 256 bytes &#xD06C;&#xAE30;&#xC758; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code> &#xAD6C;&#xC870;&#xCCB4; &#xBC30;&#xC5F4;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC758; &#xB370;&#xC774;&#xD130; &#xBD80;&#xBD84;&#xC774; &#xC624;&#xD504;&#xC14B; 0x2000&#xC5D0;&#xC11C; &#xC2DC;&#xC791;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCCAB; &#xBC88;&#xC9F8; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code> &#xC704;&#xCE58;&#xC5D0;&#xB294; <code>_HEAP_PAGE_SEGMENT</code> &#xAD6C;&#xC870;&#xCCB4;&#xAC00; &#xB300;&#xC2E0; &#xC800;&#xC7A5;&#xB418;&#xACE0; &#xB450; &#xBC88;&#xC9F8; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code>&#xB294; &#xC0AC;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xACE0; &#xD558;&#xB124;&#xC694;..? &#xC774; &#xBD80;&#xBD84;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB294; &#xBA85;&#xD655;&#xD55C; &#xC774;&#xC720;&#xB97C; &#xCC3E;&#xC744; &#xC218;&#xB294; &#xC5C6;&#xC5C8;&#xC9C0;&#xB9CC; &#xB1CC;&#xD53C;&#xC15C;&#xB85C; <code>_HEAP_PAGE_SEGMENT</code>&#xC758; &#xD06C;&#xAE30;&#xAC00; 20 bytes&#xB97C; &#xB118;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC815;&#xB82C;&#xC744; &#xC704;&#xD574; &#xB0A8;&#xACA8;&#xB454; &#xACF5;&#xAC04;&#xC774;&#xC9C0; &#xC2F6;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/10/l0ch/segment-heap-part2/Untitled%203.png" alt="Untitled"></p><p>&#xADF8;&#xB9BC;&#xC73C;&#xB85C; &#xBCF4;&#xBA74; Segment&#xC758; &#xCC98;&#xC74C; &#xBD80;&#xBD84;&#xC740; <code>_HEAP_PAGE_SEGMENT</code>&#xC640; unused&#xB85C; &#xCC44;&#xC6CC;&#xC838; &#xC788;&#xACE0; 0x40&#xBD80;&#xD130; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code> &#xBC30;&#xC5F4;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xB124;&#xC694;. &#xC774;&#xD6C4; 0x2000 &#xC774;&#xD6C4; &#xACF5;&#xAC04;&#xC774; &#xC2E4;&#xC81C; &#xD398;&#xC774;&#xC9C0;&#xB85C; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p><p><code>_HEAP_PAGE_SEGMENT</code> &#xC640; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code> &#xC744; &#xC880; &#xB354; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p><h2 id="HEAP-PAGE-SEGMENT"><a href="#HEAP-PAGE-SEGMENT" class="headerlink" title="_HEAP_PAGE_SEGMENT"></a>_HEAP_PAGE_SEGMENT</h2><p><code>_HEAP_PAGE_SEGMENT</code> &#xAD6C;&#xC870;&#xCCB4;&#xC758; &#xD544;&#xB4DC;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">021</span>&gt; dt ntdll!_HEAP_PAGE_SEGMENT   +<span class="hljs-number">0x000</span> ListEntry        : _LIST_ENTRY   +<span class="hljs-number">0x010</span> Signature        : Uint8B   +<span class="hljs-number">0x018</span> SegmentCommitState : Ptr64 _HEAP_SEGMENT_MGR_COMMIT_STATE   +<span class="hljs-number">0x020</span> UnusedWatermark  : UChar   +<span class="hljs-number">0x000</span> DescArray        : [<span class="hljs-number">256</span>] _HEAP_PAGE_RANGE_DESCRIPTOR</code></pre><ul><li><code>ListEntry</code> : &#xAC01; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xB294; <code>SegmentListHead</code>&#xC758; Linked List &#xB178;&#xB4DC;</li><li><code>Signature</code> : &#xC8FC;&#xC18C;&#xAC00; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC758; &#xC77C;&#xBD80;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB428;<ul><li><code>(&#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xC8FC;&#xC18C; &gt;&gt; 0x14) ^ RtlpHeapKey ^ HeapBase(_SEGMENT_HEAP) ^ 0xA2E64EAD2E64EAD</code> &#xB85C; &#xACC4;&#xC0B0;&#xB428;</li></ul></li></ul><h2 id="HEAP-PAGE-RANGE-DESCRIPTOR"><a href="#HEAP-PAGE-RANGE-DESCRIPTOR" class="headerlink" title="_HEAP_PAGE_RANGE_DESCRIPTOR"></a>_HEAP_PAGE_RANGE_DESCRIPTOR</h2><p> <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code> &#xB294; &#xAC01; &#xD398;&#xC774;&#xC9C0; &#xC0C1;&#xD0DC;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xD544;&#xB4DC;&#xB4E4;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D;&#xC740; &#xC5EC;&#xB7EC; &#xD398;&#xC774;&#xC9C0;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC5B4; &#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xD398;&#xC774;&#xC9C0;&#xC758; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code>&#xC5D0;&#xB3C4; &#xC774;&#xB97C; &#xC54C;&#xB9B4; &#xC218; &#xC788;&#xB294; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xD544;&#xB4DC;&#xAC00; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">021</span>&gt; dt ntdll!_HEAP_PAGE_RANGE_DESCRIPTOR   +<span class="hljs-number">0x000</span> TreeNode         : _RTL_BALANCED_NODE   +<span class="hljs-number">0x000</span> TreeSignature    : Uint4B   +<span class="hljs-number">0x004</span> UnusedBytes      : Uint4B   +<span class="hljs-number">0x008</span> ExtraPresent     : Pos <span class="hljs-number">0</span>, <span class="hljs-number">1</span> Bit   +<span class="hljs-number">0x008</span> Spare0           : Pos <span class="hljs-number">1</span>, <span class="hljs-number">15</span> Bits   +<span class="hljs-number">0x018</span> RangeFlags       : UChar   +<span class="hljs-number">0x019</span> CommittedPageCount : UChar   +<span class="hljs-number">0x01a</span> Spare            : Uint2B   +<span class="hljs-number">0x01c</span> Key              : _HEAP_DESCRIPTOR_KEY+<span class="hljs-number">0x000</span> Key              : Uint4B      +<span class="hljs-number">0x000</span> EncodedCommittedPageCount : Pos <span class="hljs-number">0</span>, <span class="hljs-number">16</span> Bits      +<span class="hljs-number">0x000</span> LargePageCost    : Pos <span class="hljs-number">16</span>, <span class="hljs-number">8</span> Bits      +<span class="hljs-number">0x000</span> UnitCount        : Pos <span class="hljs-number">24</span>, <span class="hljs-number">8</span> Bits   +<span class="hljs-number">0x01c</span> Align            : [<span class="hljs-number">3</span>] UChar   +<span class="hljs-number">0x01f</span> Offset       : UChar   +<span class="hljs-number">0x01f</span> Size         : UChar</code></pre><ul><li><code>TreeNode</code> : free &#xB41C; &#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xD398;&#xC774;&#xC9C0;&#xC784;&#xC744; &#xB098;&#xD0C0;&#xB0C4;<ul><li><code>FreePageRanges</code>&#xC758; &#xB178;&#xB4DC;</li></ul></li><li><code>UnusedBytes</code> : &#xCCAB; &#xBC88;&#xC9F8; &#xD398;&#xC774;&#xC9C0;&#xC778; &#xACBD;&#xC6B0; <code>UserSize</code>&#xC640; &#xD560;&#xB2F9;&#xB41C; &#xBE14;&#xB85D; &#xD06C;&#xAE30;&#xC758; &#xC0AC;&#xC774;&#xC988; &#xCC28;&#xC774;, &#xC989; alignment&#xB85C; &#xC778;&#xD574; &#xD560;&#xB2F9;&#xB418;&#xC5C8;&#xC9C0;&#xB9CC; &#xC0AC;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xD06C;&#xAE30;&#xB97C; &#xB098;&#xD0C0;&#xB0C4;</li><li><code>RangeFlags</code> : &#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D;&#xC758; &#xD0C0;&#xC785;&#xACFC; &#xD398;&#xC774;&#xC9C0; state&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xBE44;&#xD2B8; &#xD544;&#xB4DC;<ul><li><code>0x01</code>: <code>PAGE_RANGE_FLAGS_LFH_SUBSEGMENT</code> &#xCCAB; &#xBC88;&#xC9F8; &#xD398;&#xC774;&#xC9C0;&#xC778; &#xACBD;&#xC6B0; LFH &#xD558;&#xC704; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC784;&#xC744; &#xB098;&#xD0C0;&#xB0C4;</li><li><code>0x02</code>: <code>PAGE_RANGE_FLAGS_COMMITED</code> &#xD398;&#xC774;&#xC9C0;&#xAC00; &#xCEE4;&#xBC0B;&#xB428;</li><li><code>0x04</code>: <code>PAGE_RANGE_FLAGS_ALLOCATED</code> &#xD398;&#xC774;&#xC9C0;&#xAC00; &#xD560;&#xB2F9;&#xB418;&#xAC70;&#xB098; &#xC0AC;&#xC6A9; &#xC911;&#xC784;</li><li><code>0x08</code>: <code>PAGE_RANGE_FLAGS_FIRST</code> &#xCCAB; &#xBC88;&#xC9F8; &#xD398;&#xC774;&#xC9C0;&#xC784;&#xC744; &#xD45C;&#xC2DC;</li><li><code>0x20</code>: <code>PAGE_RANGE_FLAGS_VS_SUBSEGMENT</code> &#xCCAB; &#xBC88;&#xC9F8; &#xD398;&#xC774;&#xC9C0;&#xC778; &#xACBD;&#xC6B0; VS &#xD558;&#xC704; &#xC138;&#xADF8;&#xBA3C;&#xD2B8;&#xC784;&#xC744; &#xB098;&#xD0C0;&#xB0C4;</li></ul></li><li><code>Key</code> : free &#xB41C; &#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D;&#xC758; &#xCCAB; &#xBC88;&#xC9F8; &#xD398;&#xC774;&#xC9C0;&#xC5D0;&#xB9CC; &#xC788;&#xC73C;&#xBA70; backend free tree&#xC5D0; free &#xB41C; &#xBE14;&#xB85D;&#xC744; &#xC0BD;&#xC785;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xD568;<ul><li><code>Key</code> - backend free tree&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; WORD &#xD06C;&#xAE30;&#xC758; &#xD0A4;. &#xC0C1;&#xC704; bytes&#xB294; <code>PageCount</code> &#xD544;&#xB4DC;/&#xD558;&#xC704; bytes&#xB294; <code>EncodedCommitCount</code> &#xD544;&#xB4DC;</li><li><code>EncodedCommitCount</code> - &#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D;&#xC758; &#xCEE4;&#xBC0B;&#xB41C; &#xD398;&#xC774;&#xC9C0; &#xC218;&#xC5D0; &#xB300;&#xD55C; Bitwise NOT</li><li><code>UnitCount</code> : &#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D;&#xC758; &#xD398;&#xC774;&#xC9C0; &#xC218;</li></ul></li><li><code>Offset</code> : &#xCCAB; &#xBC88;&#xC9F8; &#xD398;&#xC774;&#xC9C0;&#xAC00; &#xC544;&#xB2CC; &#xACBD;&#xC6B0; &#xCCAB; &#xBC88;&#xC9F8;  <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code> &#xC5D0;&#xC11C;&#xBD80;&#xD130;&#xC758; &#xC624;&#xD504;&#xC14B;</li><li><code>Size</code> : &#xCCAB; &#xBC88;&#xC9F8; &#xD398;&#xC774;&#xC9C0;&#xC778; &#xACBD;&#xC6B0; <code>Key.PageCount</code> &#xC640; &#xB3D9;&#xC77C;&#xD55C; &#xAC12;</li></ul><p>&#xC544;&#xB798; &#xADF8;&#xB9BC;&#xC740; 128kb(0x20100) &#xBC31;&#xC5D4;&#xB4DC; &#xD560;&#xB2F9;&#xD588;&#xC744; &#xB54C;&#xC758; Segment Heap&#xC758; &#xBAA8;&#xC2B5;&#xC785;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/10/l0ch/segment-heap-part2/Untitled%204.png" alt="Untitled"></p><p><code>0x00</code>&#xC5D0;&#xB294; <code>_HEAP_PAGE_SEGMENT</code>&#xAC00;, <code>0x01</code>&#xC740; unused&#xACE0; <code>0x02</code>&#xC758; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code>&#xC758;  <code>RagneFlags</code>&#xC5D0; First &#xBE44;&#xD2B8;&#xAC00; &#xC124;&#xC815;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p><p>Page&#xC758; &#xB2E8;&#xC704;&#xAC00; 0x1000&#xC774;&#xBBC0;&#xB85C; 0x20100 &#xD560;&#xB2F9;&#xC744; &#xC704;&#xD574;&#xC11C;&#xB294; #0x02&#xBD80;&#xD130; #0x22&#xAE4C;&#xC9C0; 21&#xAC1C;&#xC758; &#xD398;&#xC774;&#xC9C0;&#xB97C; &#xD560;&#xB2F9;&#xD574;&#xC918;&#xC57C; &#xD558;&#xACA0;&#xB124;&#xC694;. &#xCEE4;&#xBC0B;&#xB41C; &#xD398;&#xC774;&#xC9C0; &#xC804;&#xCCB4; &#xD06C;&#xAE30;&#xB294; 0x21000&#xC774;&#xBBC0;&#xB85C; &#xD560;&#xB2F9; &#xC694;&#xCCAD;&#xC744; &#xBC1B;&#xC740; 0x20100&#xC744; &#xBE7C;&#xBA74; <code>UnusedBytes : 0xF00</code>&#xC774; &#xB098;&#xC635;&#xB2C8;&#xB2E4;. </p><p>&#xCCAB; &#xBC88;&#xC9F8; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code> &#xC678;&#xC758; <code>RanageFlags</code>&#xC5D0;&#xB294; &#xC624;&#xD504;&#xC14B; &#xC815;&#xBCF4;&#xAC00; &#xC788;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h1 id="VARIABLE-SIZE-ALLOCATION"><a href="#VARIABLE-SIZE-ALLOCATION" class="headerlink" title="VARIABLE SIZE ALLOCATION"></a>VARIABLE SIZE ALLOCATION</h1><p>&#xAC00;&#xBCC0; &#xD06C;&#xAE30;(Variable Size, VS) &#xD560;&#xB2F9;&#xC740; &#xD06C;&#xAE30;&#xAC00; 1~131,072(0x20000) bytes&#xC778; &#xD560;&#xB2F9;&#xC5D0; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. VS &#xBE14;&#xB85D;&#xC740; 16 byte &#xB2E8;&#xC704;&#xB97C; &#xAC00;&#xC9C0;&#xBA70; &#xAC01;&#xAC01; &#xC2DC;&#xC791; &#xBD80;&#xBD84;&#xC5D0; &#xBE14;&#xB85D; &#xD5E4;&#xB354;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p><h2 id="VS-Subsegments"><a href="#VS-Subsegments" class="headerlink" title="VS Subsegments"></a>VS Subsegments</h2><p>VS &#xD560;&#xB2F9; &#xACFC;&#xC815;&#xC5D0;&#xC11C;&#xB294; VS subsegment&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xAE30; &#xC704;&#xD574; &#xBC31;&#xC5D4;&#xB4DC;&#xC5D0; &#xC758;&#xC874;&#xD569;&#xB2C8;&#xB2E4;. VS subsegment&#xB294; &#xCCAB; &#xBC88;&#xC9F8; <code>_HEAP_PAGE_RANGE_DESCRIPTOR</code> &#xC758; <code>RangeFlags</code>&#xC5D0; <code>PAGE_RANGE_FLAGS_VS_SUBSEGMENT(0x20)</code> &#xBE44;&#xD2B8;&#xAC00; &#xC124;&#xC815;&#xB41C; &#xD2B9;&#xC218;&#xD55C; &#xD0C0;&#xC785;&#xC758; &#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D;&#xC785;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/10/l0ch/segment-heap-part2/Untitled%205.png" alt="Untitled"></p><p>&#xADF8;&#xB9BC;&#xC744; &#xBCF4;&#xBA74; VS subsegment&#xB294; &#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D; &#xC790;&#xB9AC;&#xB97C; &#xCC28;&#xC9C0;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. VS &#xD560;&#xB2F9;&#xC744; &#xC704;&#xD574;&#xC11C;&#xB294; &#xBC31;&#xC5D4;&#xB4DC; &#xD560;&#xB2F9;&#xC774; &#xBA3C;&#xC800; &#xD544;&#xC694;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB124;&#xC694;.</p><h2 id="HEAP-VS-CONTEXT"><a href="#HEAP-VS-CONTEXT" class="headerlink" title="_HEAP_VS_CONTEXT"></a>_HEAP_VS_CONTEXT</h2><p><code>_HEAP_VS_CONTEXT</code> &#xAD6C;&#xC870;&#xCCB4;&#xB294; <code>_SEGMENT_HEAP</code>&#xC758; <code>VsContext</code> &#xD544;&#xB4DC;&#xC5D0;&#xC11C; &#xCC38;&#xC870;&#xD558;&#xBA70; &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; VS &#xBE14;&#xB85D;, VS subsegment &#xBC0F; VS &#xD560;&#xB2F9; state&#xC640; &#xAD00;&#xB828;&#xB41C; &#xAE30;&#xD0C0; &#xC815;&#xBCF4;&#xC5D0; &#xB300;&#xD55C; &#xD544;&#xB4DC;&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. </p><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">017</span>&gt; dt ntdll!_HEAP_VS_CONTEXT   +<span class="hljs-number">0x000</span> Lock             : Uint8B   +<span class="hljs-number">0x008</span> LockType         : _RTLP_HP_LOCK_TYPE   +<span class="hljs-number">0x010</span> FreeChunkTree    : _RTL_RB_TREE   +<span class="hljs-number">0x020</span> SubsegmentList   : _LIST_ENTRY   +<span class="hljs-number">0x030</span> TotalCommittedUnits : Uint8B   +<span class="hljs-number">0x038</span> FreeCommittedUnits : Uint8B   +<span class="hljs-number">0x040</span> DelayFreeContext : _HEAP_VS_DELAY_FREE_CONTEXT   +<span class="hljs-number">0x080</span> BackendCtx       : Ptr64 Void   +<span class="hljs-number">0x088</span> Callbacks        : _HEAP_SUBALLOCATOR_CALLBACKS   +<span class="hljs-number">0x0b0</span> Config           : _RTL_HP_VS_CONFIG   +<span class="hljs-number">0x0b4</span> Flags            : Uint4B</code></pre><ul><li><code>FreeChunkTree</code> : free &#xB41C; VS &#xBE14;&#xB85D;&#xC758; RB tree</li><li><code>SubsegmentList</code> : &#xBAA8;&#xB4E0; VS subsegement&#xC758; linked list</li><li><code>BackendCt</code> : &#xC0C1;&#xC704; <code>_SEGMENT_HEAP</code> &#xC5D0; &#xB300;&#xD55C; &#xD3EC;&#xC778;&#xD130;</li><li><code>Callbacks</code> : VS subsegment &#xAD00;&#xB9AC;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC778;&#xCF54;&#xB529;&#xB41C; &#xCF5C;&#xBC31;</li></ul><h2 id="HEAP-VS-SUBSEGMENT"><a href="#HEAP-VS-SUBSEGMENT" class="headerlink" title="_HEAP_VS_SUBSEGMENT"></a>_HEAP_VS_SUBSEGMENT</h2><p>VS subsegment&#xB294; VS &#xBE14;&#xB85D;&#xC774; &#xD560;&#xB2F9;&#xB418;&#xB294; &#xC704;&#xCE58;&#xC785;&#xB2C8;&#xB2E4;. VS subsegment&#xB294; <code>RtlpHpVsSubsegmentCreate()</code>&#xB97C; &#xD1B5;&#xD574; &#xD560;&#xB2F9; &#xBC0F; &#xCD08;&#xAE30;&#xD654;&#xB418;&#xBA70;  <code>_HEAP_VS_SUBSEGMENT</code> &#xD5E4;&#xB354;&#xB97C; &#xAC16;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">014</span>&gt; dt ntdll!_HEAP_VS_SUBSEGMENT   +<span class="hljs-number">0x000</span> ListEntry        : _LIST_ENTRY   +<span class="hljs-number">0x010</span> CommitBitmap     : Uint8B   +<span class="hljs-number">0x018</span> CommitLock       : Uint8B   +<span class="hljs-number">0x020</span> Size             : Uint2B   +<span class="hljs-number">0x022</span> Signature        : Pos <span class="hljs-number">0</span>, <span class="hljs-number">15</span> Bits   +<span class="hljs-number">0x022</span> FullCommit       : Pos <span class="hljs-number">15</span>, <span class="hljs-number">1</span> Bit</code></pre><ul><li><code>ListEntry</code> : &#xAC01; VS subsegment&#xB294; VS subsegment Linked List&#xC758; &#xB178;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</li><li><code>CommitBitmap</code> : VS subsegment &#xD398;&#xC774;&#xC9C0;&#xC758; &#xCEE4;&#xBC0B; &#xBE44;&#xD2B8;&#xB9F5;</li><li><code>Size</code> : 16bytes &#xBE14;&#xB85D;&#xC758; VS &#xD558;&#xC704; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD06C;&#xAE30;</li><li><code>Signature</code> : VS subsegemnt&#xAC00; &#xC190;&#xC0C1;&#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;(<code>Size  ^ 0xABED</code>)</li></ul><h2 id="HEAP-VS-CHUNK-HEADER"><a href="#HEAP-VS-CHUNK-HEADER" class="headerlink" title="_HEAP_VS_CHUNK_HEADER"></a>_HEAP_VS_CHUNK_HEADER</h2><p>&#xC0AC;&#xC6A9; &#xC911;&#xC778; VS &#xBE14;&#xB85D;&#xC5D0;&#xB294; 16 bytes &#xD06C;&#xAE30;&#xC758; &#xD5E4;&#xB354;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">014</span>&gt; dt ntdll!_HEAP_VS_CHUNK_HEADER -r   +<span class="hljs-number">0x000</span> Sizes            : _HEAP_VS_CHUNK_HEADER_SIZE      +<span class="hljs-number">0x000</span> MemoryCost       : Pos <span class="hljs-number">0</span>, <span class="hljs-number">16</span> Bits      +<span class="hljs-number">0x000</span> UnsafeSize       : Pos <span class="hljs-number">16</span>, <span class="hljs-number">16</span> Bits      +<span class="hljs-number">0x004</span> UnsafePrevSize   : Pos <span class="hljs-number">0</span>, <span class="hljs-number">16</span> Bits      +<span class="hljs-number">0x004</span> Allocated        : Pos <span class="hljs-number">16</span>, <span class="hljs-number">8</span> Bits      +<span class="hljs-number">0x000</span> KeyUShort        : Uint2B      +<span class="hljs-number">0x000</span> KeyULong         : Uint4B      +<span class="hljs-number">0x000</span> HeaderBits       : Uint8B   +<span class="hljs-number">0x008</span> EncodedSegmentPageOffset : Pos <span class="hljs-number">0</span>, <span class="hljs-number">8</span> Bits   +<span class="hljs-number">0x008</span> UnusedBytes      : Pos <span class="hljs-number">8</span>, <span class="hljs-number">1</span> Bit   +<span class="hljs-number">0x008</span> SkipDuringWalk   : Pos <span class="hljs-number">9</span>, <span class="hljs-number">1</span> Bit   +<span class="hljs-number">0x008</span> Spare            : Pos <span class="hljs-number">10</span>, <span class="hljs-number">22</span> Bits   +<span class="hljs-number">0x008</span> AllocatedChunkBits : Uint4B</code></pre><ul><li><code>Size</code> : &#xD06C;&#xAE30; &#xBC0F; &#xC0C1;&#xD0DC; &#xC815;&#xBCF4;&#xB97C; &#xCEA1;&#xC290;&#xD654;&#xD558;&#xB294; &#xC778;&#xCF54;&#xB529; &#xB41C; QWORD &#xD06C;&#xAE30;&#xC758; &#xD558;&#xC704; &#xAD6C;&#xC870;&#xCCB4;</li><li><code>EncodedSegmentPageOffset</code> : &#xD398;&#xC774;&#xC9C0;&#xC758; VS subsegment &#xC2DC;&#xC791;&#xBD80;&#xD130; &#xBE14;&#xB85D;&#xAE4C;&#xC9C0;&#xC758; &#xC624;&#xD504;&#xC14B;(&#xC778;&#xCF54;&#xB529; &#xB428;)</li><li><code>UnusedBytes</code> :  &#xC0AC;&#xC6A9;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xD06C;&#xAE30; &#xD50C;&#xB798;&#xADF8;</li></ul><h2 id="HEAP-VS-CHUNK-FREE-HEADER"><a href="#HEAP-VS-CHUNK-FREE-HEADER" class="headerlink" title="_HEAP_VS_CHUNK_FREE_HEADER"></a>_HEAP_VS_CHUNK_FREE_HEADER</h2><p>free &#xB41C; VS &#xBE14;&#xB85D;&#xC5D0;&#xB294; 32 bytes (0x20) &#xD5E4;&#xB354;&#xAC00; &#xC788;&#xC73C;&#xBA70; &#xCC98;&#xC74C; 8 bytes&#xB294; &#xC55E;&#xC11C; &#xBCF8;<code>_HEAP_VS_CHUNK_HEADER</code> &#xAD6C;&#xC870;&#xCCB4;&#xC640; &#xB3D9;&#xC77C;&#xD569;&#xB2C8;&#xB2E4;. &#xC624;&#xD504;&#xC14B; 0x08&#xC5D0;&#xC11C; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xB178;&#xB4DC; &#xD544;&#xB4DC;&#xB294; <code>VsContext.FreeChunkTree</code> &#xC5D0;&#xC11C; free &#xB41C; VS &#xBE14;&#xB85D; &#xB178;&#xB4DC; &#xC5ED;&#xD560;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">014</span>&gt; dt ntdll!_HEAP_VS_CHUNK_FREE_HEADER -r   +<span class="hljs-number">0x000</span> Header           : _HEAP_VS_CHUNK_HEADER      +<span class="hljs-number">0x000</span> Sizes            : _HEAP_VS_CHUNK_HEADER_SIZE         +<span class="hljs-number">0x000</span> MemoryCost       : Pos <span class="hljs-number">0</span>, <span class="hljs-number">16</span> Bits         +<span class="hljs-number">0x000</span> UnsafeSize       : Pos <span class="hljs-number">16</span>, <span class="hljs-number">16</span> Bits         +<span class="hljs-number">0x004</span> UnsafePrevSize   : Pos <span class="hljs-number">0</span>, <span class="hljs-number">16</span> Bits         +<span class="hljs-number">0x004</span> Allocated        : Pos <span class="hljs-number">16</span>, <span class="hljs-number">8</span> Bits         +<span class="hljs-number">0x000</span> KeyUShort        : Uint2B         +<span class="hljs-number">0x000</span> KeyULong         : Uint4B         +<span class="hljs-number">0x000</span> HeaderBits       : Uint8B      +<span class="hljs-number">0x008</span> EncodedSegmentPageOffset : Pos <span class="hljs-number">0</span>, <span class="hljs-number">8</span> Bits      +<span class="hljs-number">0x008</span> UnusedBytes      : Pos <span class="hljs-number">8</span>, <span class="hljs-number">1</span> Bit      +<span class="hljs-number">0x008</span> SkipDuringWalk   : Pos <span class="hljs-number">9</span>, <span class="hljs-number">1</span> Bit      +<span class="hljs-number">0x008</span> Spare            : Pos <span class="hljs-number">10</span>, <span class="hljs-number">22</span> Bits      +<span class="hljs-number">0x008</span> AllocatedChunkBits : Uint4B   +<span class="hljs-number">0x000</span> OverlapsHeader   : Uint8B   +<span class="hljs-number">0x008</span> Node             : _RTL_BALANCED_NODE...</code></pre><p>&#xC815;&#xB9AC;&#xD560;&#xAC8C; &#xB108;&#xBB34; &#xB9CE;&#xC544;&#xC11C; &#xBC8C;&#xC368;&#xBD80;&#xD130; &#xC5B4;&#xC9C8;&#xC5B4;&#xC9C8;&#xD558;&#xB124;&#xC694;.. &#xC544; &#xBC31;&#xC2E0; &#xB54C;&#xBB38;&#xC778;&#xAC00;? &#xADF8;&#xB798;&#xB3C4; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xAF2D; &#xC54C;&#xACE0; &#xB118;&#xC5B4;&#xAC00;&#xC57C; &#xD558;&#xB294; &#xBD80;&#xBD84;&#xC774;&#xB77C; &#xC5F4;&#xC2EC;&#xD788; &#xC815;&#xB9AC;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4; &#x3160;&#x3160;</p><p>&#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; LFH&#xC640; Large Block&#xAE4C;&#xC9C0; &#xC0B4;&#xD3B4;&#xBCF4;&#xACE0; &#xC5EC;&#xC720;&#xAC00; &#xB41C;&#xB2E4;&#xBA74; CTF&#xC5D0; &#xCD9C;&#xC81C;&#xB41C; Segment Heap &#xBB38;&#xC81C;&#xB97C; &#xC2AC;&#xCA4D; &#xC2A4;&#xD3EC; &#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD560;&#xAC8C;&#xC694;!</p><h1 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h1><p><a href="https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals-wp.pdf">https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals-wp.pdf</a></p><p><a href="https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals.pdf">https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals.pdf</a></p><p><a href="https://speakerdeck.com/scwuaptx/windows-kernel-heap-segment-heap-in-windows-kernel-part-1?slide=207">https://speakerdeck.com/scwuaptx/windows-kernel-heap-segment-heap-in-windows-kernel-part-1?slide=207</a></p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Research/">Research</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/windows/">windows</category>
      
      <category domain="https://hackyboiz.github.io/tags/heap/">heap</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      <category domain="https://hackyboiz.github.io/tags/research/">research</category>
      
      <category domain="https://hackyboiz.github.io/tags/segment-heap/">segment heap</category>
      
      <category domain="https://hackyboiz.github.io/tags/windows-10/">windows 10</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/10/l0ch/segment-heap-part2/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] Crucial’s MOD Utility LPE – CVE-2021-41285</title>
      <link>https://hackyboiz.github.io/2021/10/09/j0ker/2021-10-09/</link>
      <guid>https://hackyboiz.github.io/2021/10/09/j0ker/2021-10-09/</guid>
      <pubDate>Sat, 09 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://voidsec.com/crucial-mod-utility-lpe-cve-2021-4128</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://voidsec.com/crucial-mod-utility-lpe-cve-2021-41285/">https://voidsec.com/crucial-mod-utility-lpe-cve-2021-41285/</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul><li>Crucial Ballistix MOD Utility</li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>Crucial Ballistix MOD Utility&#xC758; <code>MODAPI.sys</code>&#xC5D0;&#xC11C; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC744; &#xD560; &#xC218; &#xC788;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC774; &#xACF5;&#xAC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xACF5;&#xAC1C;&#xB41C; &#xCDE8;&#xC57D;&#xC810;&#xB4E4;&#xC740; &#xBAA8;&#xB450; IOCTL &#xC694;&#xCCAD;&#xC744; &#xD1B5;&#xD574; &#xD2B8;&#xB9AC;&#xAC70;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ol><li>IO bus&#xC5D0; &#xB370;&#xC774;&#xD130; &#xB370;&#xC774;&#xD130; &#xC4F0;&#xAE30; &#xD639;&#xC740; &#xC77D;&#xC5B4;&#xC624;&#xAE30;<ul><li><code>0x9C406144: HalGetBusDataByOffset</code></li><li><code>0x9C40A148: HalSetBusDataByOffset</code></li><li>IO bus&#xC5D0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC368;&#xC11C; PCI &#xC124;&#xC815; &#xC815;&#xBCF4; &#xD639;&#xC740; &#xBCA4;&#xB354;&#xC758; &#xB370;&#xC774;&#xD130; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB4E4;&#xC744; &#xC218;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li><li>IO port&#xC5D0;&#xC11C; 1/2/4 &#xBC14;&#xC774;&#xD2B8; &#xC77D;&#xAE30; &#xD639;&#xC740; &#xC4F0;&#xAE30;<ul><li><code>0x9C40A0C8, 0x9C40A0D8 __outbyte, 0x9C40A0DC __outword, 0x9C40A0E0 __outdword</code></li><li><code>0x9C4060C4, 0x9C4060CC __inbyte, 0x9C4060D0 __inword, 0x9C4060D4 __indword</code></li><li>HDD&#xC640; GPU &#xB4F1; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xB4E4;&#xACFC; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xD1B5;&#xC2E0;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xB514;&#xC2A4;&#xD06C;&#xC5D0; &#xC9C1;&#xC811; &#xC4F0;&#xACE0; &#xC77D;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li><li>&#xC784;&#xC758; &#xBB3C;&#xB9AC;&#xC8FC;&#xC18C; &#xD560;&#xB2F9; &#xBC0F; &#xC720;&#xC800; &#xACF5;&#xAC04;&#xACFC; &#xB9E4;&#xD551;<ul><li><code>0x9C406104: MmMapIoSpace</code></li><li>&#xB7A8;&#xC5D0; &#xC788;&#xB294; &#xBB3C;&#xB9AC;&#xC8FC;&#xC18C;&#xB97C; &#xC720;&#xC800; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBA54;&#xBAA8;&#xB9AC;&#xB85C; &#xB9E4;&#xD551;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xD1B5;&#xD574; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C; &#xBC14;&#xB85C; &#xC815;&#xBCF4;&#xB97C; &#xCD94;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li><li>MSR &#xC4F0;&#xAE30;<ul><li>Model-Specific Registers(MSRs)&#xB294; &#xC8FC;&#xB85C; CPU &#xC815;&#xBCF4;&#xB97C; &#xAC00;&#xC838;&#xC624;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xC911; <code>MSR _LSTAR</code>&#xC740; &#xC720;&#xC800;&#xBAA8;&#xB4DC;&#xC5D0;&#xC11C; &#xCEE4;&#xB110;&#xBAA8;&#xB4DC;&#xB85C; &#xC804;&#xD658;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xB418;&#xB294;&#xB370;, &#xC774; &#xB54C; <code>MSR _LSTAR</code> &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC758; &#xB0B4;&#xC6A9;&#xC744; &#xC77D;&#xACE0; &#xD574;&#xB2F9; &#xC8FC;&#xC18C;&#xB85C; call &#xD569;&#xB2C8;&#xB2E4;. <code>MSR _LSTAR</code>&#xB97C; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xC2E4;&#xD589; &#xD750;&#xB984;&#xC744; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li><code>0x9C402084: __readmsr</code></li><li><code>0x9C402088: __writemsr</code></li><li>MSR&#xC744; &#xC77D;&#xACE0; &#xC4F8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li></ol>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/lpe/">lpe</category>
      
      <category domain="https://hackyboiz.github.io/tags/eop/">eop</category>
      
      <category domain="https://hackyboiz.github.io/tags/j0ker/">j0ker</category>
      
      <category domain="https://hackyboiz.github.io/tags/driver/">driver</category>
      
      <category domain="https://hackyboiz.github.io/tags/cve-2021-41285/">cve-2021-41285</category>
      
      <category domain="https://hackyboiz.github.io/tags/ioctl/">ioctl</category>
      
      <category domain="https://hackyboiz.github.io/tags/3rd-party-driver/">3rd party driver</category>
      
      <category domain="https://hackyboiz.github.io/tags/arbitrary-read-write/">arbitrary read write</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/09/j0ker/2021-10-09/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] Redirection</title>
      <link>https://hackyboiz.github.io/2021/10/08/poosic/redirection/</link>
      <guid>https://hackyboiz.github.io/2021/10/08/poosic/redirection/</guid>
      <pubDate>Fri, 08 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xB9AC;&amp;#xB2E4;&amp;#xC774;&amp;#xB809;&amp;#xC158;&amp;#xC740; &amp;#xB300;&amp;#xBD80;&amp;#xBD84;&amp;#xC758; CLI(Command Line Interpreter)&amp;#xC5D0;&amp;#xC11C; &amp;#xC0AC;&amp;</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xC158;&#xC740; &#xB300;&#xBD80;&#xBD84;&#xC758; CLI(Command Line Interpreter)&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xBA85;&#xB839;&#xC785;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xBA85;&#xB839;&#xC5B4;&#xB294; &#xD45C;&#xC900; &#xC785;&#xCD9C;&#xB825;&#xC5D0; &#xB300;&#xD55C; &#xBC29;&#xD5A5;&#xC744; &#xBC14;&#xAFD4; &#xD30C;&#xC77C;&#xB85C; &#xC785;&#xB825;&#xC744; &#xBC1B;&#xAC70;&#xB098; &#xD30C;&#xC77C;&#xB85C; &#xCD9C;&#xB825;&#xC744; &#xD558;&#xB3C4;&#xB85D; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="&#xBA85;&#xB839;&#xC5B4;"><a href="#&#xBA85;&#xB839;&#xC5B4;" class="headerlink" title="&#xBA85;&#xB839;&#xC5B4;"></a>&#xBA85;&#xB839;&#xC5B4;</h3><pre><code class="hljs bash">&#xBA85;&#xB839;&#xC5B4;1 &gt; &#xD30C;&#xC77C;&#xBA85;&#xB839;&#xC5B4;1 &gt;&gt; &#xD30C;&#xC77C;&#xBA85;&#xB839;&#xC5B4;1 &lt; &#xD30C;&#xC77C;</code></pre><p><code>&gt;</code>&#xB294; &#xD45C;&#xC900; &#xCD9C;&#xB825; &#xC7AC;&#xC9C0;&#xC815; &#xBA85;&#xB839;&#xC5B4;&#xB85C;&#xC368;, &#xBA85;&#xB839;&#xC5B4;&#xC758; &#xC2E4;&#xD589; &#xACB0;&#xACFC;&#xB97C; &#xD45C;&#xC900; &#xCD9C;&#xB825;&#xC774; &#xC544;&#xB2CC; &#xC7AC;&#xC9C0;&#xC815;&#xD55C; &#xACF3;&#xC73C;&#xB85C; &#xBCF4;&#xB0B4; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;. <code>&gt;&gt;</code>&#xB294; &#xB611;&#xAC19;&#xC740; &#xD45C;&#xC900; &#xCD9C;&#xB825; &#xC7AC;&#xC9C0;&#xC815; &#xBA85;&#xB839;&#xC5B4;&#xC9C0;&#xB9CC;, &#xC2E4;&#xD589; &#xACB0;&#xACFC;&#xB97C; &#xC7AC;&#xC9C0;&#xC815;&#xD55C; &#xD30C;&#xC77C;&#xC758; &#xB4A4;&#xCABD;&#xC5D0; &#xC774;&#xC5B4;&#xC11C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p><p><code>&lt;</code>&#xB294; &#xC774;&#xC640; &#xBC18;&#xB300;&#xB85C; &#xD45C;&#xC900; &#xC785;&#xB825; &#xC7AC;&#xC9C0;&#xC815; &#xBA85;&#xB839;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;. &#xBA85;&#xB839;&#xC5B4;&#xC758; &#xC785;&#xB825;&#xC73C;&#xB85C;&#xC368; &#xD45C;&#xC900; &#xC785;&#xB825;&#xACFC; &#xC5F0;&#xACB0;&#xB41C; &#xD0A4;&#xBCF4;&#xB4DC; &#xB300;&#xC2E0; &#xC7AC;&#xC9C0;&#xC815;&#xD55C; &#xACF3;&#xC744; &#xC785;&#xB825;&#xC73C;&#xB85C; &#xBC1B;&#xC544; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC544;&#xB798; &#xC2E4;&#xC81C; &#xC0AC;&#xC6A9; &#xC608;&#xC2DC;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/08/poosic/redirection/image1.png" alt></p><p> cat &#xBA85;&#xB839;&#xC5B4;&#xC640; &#xD14D;&#xC2A4;&#xD2B8; &#xD30C;&#xC77C;&#xB85C; &#xAD6C;&#xD604;&#xD55C; &#xAC04;&#xB2E8;&#xD55C; &#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xC158;&#xC758; &#xC608;&#xC2DC;&#xC785;&#xB2C8;&#xB2E4;. cat &#xBA85;&#xB839;&#xC5B4;&#xB85C; &#xD45C;&#xC900; &#xCD9C;&#xB825;&#xC744; &#xD1B5;&#xD574; &#xD654;&#xBA74;&#xC5D0; &#xCD9C;&#xB825;&#xB418;&#xB358; &#x201C;We are Hackyboiz!&#x201D;&#xB77C;&#xB294; &#xBB38;&#xC7A5;&#xC744; hackyboizt.txt&#xB85C; &#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xC158;&#xC2DC;&#xCF1C; &#xCD9C;&#xB825; &#xACB0;&#xACFC;&#xB97C; &#xC800;&#xC7A5;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xD6C4; &#xB2E4;&#xC2DC; hackyboiz.txt &#xD30C;&#xC77C;&#xC744; &#xB9AC;&#xB2E4;&#xC774;&#xB809;&#xC158;&#xC2DC;&#xCF1C; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC744; &#xC785;&#xB825;&#xC73C;&#xB85C; &#xBC1B;&#xC544; cat &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC2E4;&#xD589;&#xC2DC;&#xCF30;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/10/08/poosic/redirection/image2.png" alt></p><p>&#xC774;&#xD6C4; <code>&gt;&gt;</code> &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xC800;&#xC7A5;&#xB41C; &#x201C;We are Hackyboiz!&#x201D;&#xB77C;&#xB294; &#xBB38;&#xC7A5;&#xC740; &#xC704;&#xC5D0;&#xC11C; &#xC124;&#xBA85;&#xD558;&#xC600;&#xB4EF;&#xC774; &#xD30C;&#xC77C;&#xC758; &#xB4B7; &#xBD80;&#xBD84;&#xC5D0; &#xD45C;&#xC900; &#xCD9C;&#xB825;&#xC758; &#xACB0;&#xACFC;&#xAC00; &#xC774;&#xC5B4;&#xC11C; &#xC800;&#xC7A5;&#xB418;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/poosic/">poosic</category>
      
      <category domain="https://hackyboiz.github.io/tags/redirection/">redirection</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/08/poosic/redirection/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021-34856: Parallels Desktop에서 발견된 취약점</title>
      <link>https://hackyboiz.github.io/2021/10/07/l0ch/2021-10-07/</link>
      <guid>https://hackyboiz.github.io/2021/10/07/l0ch/2021-10-07/</guid>
      <pubDate>Thu, 07 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://trenchant.io/pwn2own-2021-parallels-desktop-guest</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://trenchant.io/pwn2own-2021-parallels-desktop-guest-to-host-escape/">PWN2OWN 2021: PARALLELS DESKTOP GUEST TO HOST ESCAPE</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul><li>Parallels desktop</li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>macOS/Chrome OS&#xC6A9; &#xAC00;&#xC0C1;&#xD654; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC778; Parallels Desktop&#xC5D0;&#xC11C; Guest &#xBA38;&#xC2E0;&#xC5D0;&#xC11C; Host &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#xC784;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xCDE8;&#xC57D;&#xC810;&#xC740; Guest &#xC640; Host &#xAC04; &#xBC18;&#xAC00;&#xC0C1;&#xD654; I/O&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xC778;&#xD130;&#xD398;&#xC774;&#xC2A4;&#xC778; VirtIO&#xC758; VGA &#xB514;&#xBC14;&#xC774;&#xC2A4; &#xB4DC;&#xB77C;&#xC774;&#xBC84; &#xD568;&#xC218; <code>PciVirtIOWriteMM/PciVirtIOReadMM</code> &#xC5D0; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xD574;&#xB2F9; &#xD568;&#xC218;&#xB4E4;&#xC740; Guest&#xAC00; &#xC81C;&#xC5B4; &#xAC00;&#xB2A5;&#xD55C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC804;&#xC5ED; &#xBCC0;&#xC218;&#xC5D0; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c">MOV dword ptr [R9 + DAT_00048b04], EBX  <span class="hljs-comment">//Guest supplied data</span>...MOV  R9, R14MOV  EAX, dword ptr [R9 + DAT_00048b04]MOV  dword ptr [R9 + RAX*<span class="hljs-number">0x4</span> + <span class="hljs-number">0x48af8</span>], EBX</code></pre><p>&#xC800;&#xC7A5;&#xB41C; &#xB370;&#xC774;&#xD130;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC5D0; Guest &#xB370;&#xC774;&#xD130;&#xB97C; &#xC4F0;&#xAE30; &#xC704;&#xD55C; index&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294;&#xB370;, index &#xAC12;&#xC744; &#xC800;&#xC7A5;&#xD560; &#xB54C; &#xBC94;&#xC704; &#xAC80;&#xC0AC;&#xB97C; &#xD558;&#xC9C0; &#xC54A;&#xC544; data &#xC139;&#xC158;&#xC5D0; out-of-bounds write&#xAC00; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC545;&#xC6A9;&#xD558;&#xBA74; port I/O &#xAC00; &#xC218;&#xD589;&#xB420; &#xB54C;  bss &#xC139;&#xC158;&#xC758; <code>io_port_handler</code> &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xC218;&#xC815;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370;, &#xD574;&#xB2F9; &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB85C; &#xBC1B;&#xC544; &#xC77D;&#xAE30;/&#xC4F0;&#xAE30;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB294;  <code>AhciIdpIndexInPortFunc</code>&#xC640; <code>AhciIdpIndexOutPortFunc</code> &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xAC01;&#xAC01; aribtrary read/write &#xD504;&#xB9AC;&#xBBF8;&#xD2F0;&#xBE0C;&#xB97C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xACB0;&#xACFC;&#xC801;&#xC73C;&#xB85C; &#xD558;&#xC774;&#xD37C;&#xBC14;&#xC774;&#xC800;&#xC5D0;&#xC11C; &#xC258;&#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xACE0; Host&#xB85C; escape&#xD574; &#xC784;&#xC758; &#xCF54;&#xB4DC; &#xC2E4;&#xD589;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/cve/">cve</category>
      
      <category domain="https://hackyboiz.github.io/tags/parallels/">parallels</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      <category domain="https://hackyboiz.github.io/tags/macos/">macos</category>
      
      <category domain="https://hackyboiz.github.io/tags/cve-2021-34856/">cve-2021-34856</category>
      
      <category domain="https://hackyboiz.github.io/tags/out-of-bounds/">out of bounds</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/07/l0ch/2021-10-07/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] C&amp;C Server</title>
      <link>https://hackyboiz.github.io/2021/10/06/y00n_nms/command-control-server/</link>
      <guid>https://hackyboiz.github.io/2021/10/06/y00n_nms/command-control-server/</guid>
      <pubDate>Wed, 06 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;C&amp;amp;C &amp;#xC11C;&amp;#xBC84;&amp;#xB294;  Command &amp;amp; Control &amp;#xC11C;&amp;#xBC84;, C2 &amp;#xC11C;&amp;#xBC84;, &amp;#xBA85;&amp;#xB839;&amp;#xC81C;&amp;#xC5B4; &amp;#xC11C;&amp;</description>
        
      
      
      
      <content:encoded><![CDATA[<p>C&amp;C &#xC11C;&#xBC84;&#xB294;  Command &amp; Control &#xC11C;&#xBC84;, C2 &#xC11C;&#xBC84;, &#xBA85;&#xB839;&#xC81C;&#xC5B4; &#xC11C;&#xBC84; &#xB4F1; &#xB2E4;&#xC591;&#xD558;&#xAC8C; &#xBD88;&#xB9AC;&#xBA70; &#xC0AC;&#xC774;&#xBC84; &#xACF5;&#xACA9;&#xC5D0;&#xC11C; &#xB450;&#xB1CC; &#xC5ED;&#xD560;&#xC744; &#xD55C;&#xB2E4;&#xACE0; &#xC54C;&#xB824;&#xC838; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>C&amp;C &#xC11C;&#xBC84;&#xB294; &#xAC10;&#xC5FC;&#xB41C; PC(&#xC880;&#xBE44; PC)&#xC5D0;&#xC11C; &#xD574;&#xCEE4;&#xAC00; &#xC6D0;&#xD558;&#xB294; &#xACF5;&#xACA9;&#xC744; &#xC218;&#xD589;&#xD558;&#xB3C4;&#xB85D; &#xC6D0;&#xACA9;&#xC9C0;&#xC5D0;&#xC11C; &#xBA85;&#xB839;&#xC744; &#xB0B4;&#xB9AC;&#xAC70;&#xB098; &#xC545;&#xC131;&#xCF54;&#xB4DC;&#xB97C; &#xC81C;&#xC5B4;&#xD558;&#xB294; &#xC11C;&#xBC84;&#xC785;&#xB2C8;&#xB2E4;. &#xC880;&#xBE44; PC&#xAC00; &#xB418;&#xBA74; C&amp;C &#xC11C;&#xBC84;&#xC758; &#xBA85;&#xB839;&#xC744; &#xBC1B;&#xC544; &#xD574;&#xCEE4;&#xAC00; &#xC790;&#xC2E0;&#xC758; PC&#xCC98;&#xB7FC; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD574;&#xCEE4;&#xC758; &#xACF5;&#xACA9; &#xBA85;&#xB839;&#xC744; &#xC218;&#xD589;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xB610;&#xD55C; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xAD00;&#xB828; &#xAE30;&#xC0AC;&#xC5D0;&#xC11C; &#xBE60;&#xC9C0;&#xC9C0; &#xC54A;&#xACE0; &#xB098;&#xC624;&#xB294; &#xD0A4;&#xC6CC;&#xB4DC;&#xB85C;, &#xCD5C;&#xADFC; &#xB274;&#xC2A4;&#xB97C; &#xBCF4;&#xBA74; &#x2018;&#xAC10;&#xC5FC; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; HVNC&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xBA74; &#xC9C0;&#xC815;&#xB41C; &#xBA85;&#xB839;&#xC81C;&#xC5B4;(C&amp;C) &#xC11C;&#xBC84;&#xC5D0; &#xC811;&#xC18D;&#xD558;&#xBA70;, C&amp;C &#xC11C;&#xBC84;&#xC5D0;&#xC11C; VNC&#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;(HVNC &#xAE30;&#xC900;&#xC73C;&#xB85C;&#xB294; &#xC11C;&#xBC84;)&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xB300;&#xAE30;&#xD558;&#xB358; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC6D0;&#xACA9; &#xC81C;&#xC5B4;&#xAC00; &#xAC00;&#xB2A5;&#xD574;&#xC9C4;&#xB2E4;.&#x2019; &#xB77C;&#xB294; &#xB0B4;&#xC6A9;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. (<a href="https://www.boannews.com/media/view.asp?idx=100986">[&#xBCF4;&#xC548;&#xB274;&#xC2A4;] &#xBD81;&#xD55C; &#xD574;&#xCEE4;&#xADF8;&#xB8F9; &#xAE40;&#xC218;&#xD0A4;, &#xC6D0;&#xACA9;&#xC81C;&#xC5B4; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xC774;&#xC6A9;&#xD55C; &#xB610; &#xB2E4;&#xB978; &#xACF5;&#xACA9; &#xAC10;&#xD589;</a>)</p><p>&#xCC38;&#xACE0;&#xB85C; HVNC(Hidden Virtual Network Computing)&#xC740; &#xD53C;&#xD574;&#xC790;&#xAC00; &#xD654;&#xBA74;&#xC774; &#xC81C;&#xC5B4;&#xB418;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC744; &#xC778;&#xC9C0;&#xD558;&#xC9C0; &#xBABB;&#xD55C; &#xCC44; &#xD574;&#xCEE4;&#xAC00; &#xC6D0;&#xACA9;&#xC73C;&#xB85C; &#xB2E4;&#xB978; &#xCEF4;&#xD4E8;&#xD130;&#xB97C; &#xC81C;&#xC5B4;&#xD560; &#xC218; &#xC788;&#xB294; &#xD654;&#xBA74; &#xC81C;&#xC5B4; &#xC2DC;&#xC2A4;&#xD15C;&#xC785;&#xB2C8;&#xB2E4;.</p><p>5&#xB144; &#xC804;&#xC758; 2016&#xB144; 4&#xBD84;&#xAE30;&#xC5D0;&#xB294; C&amp;C &#xC11C;&#xBC84;&#xC758; &#xC57D; 59%&#xAC00; &#xD55C;&#xAD6D;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xAC83;&#xC73C;&#xB85C; &#xC870;&#xC0AC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/y00n-nms/">y00n_nms</category>
      
      <category domain="https://hackyboiz.github.io/tags/c-c-server/">c&amp;c server</category>
      
      <category domain="https://hackyboiz.github.io/tags/c2-sever/">c2 sever</category>
      
      <category domain="https://hackyboiz.github.io/tags/command-control-server/">command control server</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/06/y00n_nms/command-control-server/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021-1810: Gatekeeper bypass</title>
      <link>https://hackyboiz.github.io/2021/10/05/fabu1ous/2021-10-05/</link>
      <guid>https://hackyboiz.github.io/2021/10/05/fabu1ous/2021-10-05/</guid>
      <pubDate>Tue, 05 Oct 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://labs.f-secure.com/blog/analysis-of-cve-2021-1810-</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://labs.f-secure.com/blog/analysis-of-cve-2021-1810-gatekeeper-bypass/">Analysis of CVE-2021-1810 Gatekeeper bypass</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a><strong>Target</strong></h2><p>macOS &lt; Big Sur 11.3</p><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a><strong>Explain</strong></h2><p>macOS&#xC758; file quarantine &#xAE30;&#xB2A5;, Gatekeeper&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC785;&#xB2C8;&#xB2E4;. Gatekeeper&#xB294; macOS &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xC0C8;&#xB86D;&#xAC8C; &#xC124;&#xCE58;&#xB418;&#xB294;, &#xD639;&#xC740; &#xCC98;&#xC74C; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xD30C;&#xC77C;&#xC5D0; &#xB300;&#xD55C; Code signature &#xAC80;&#xC0AC;&#xC640; Notarization&#xC744; &#xC218;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. &#xC989;, &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC758; &#xCD9C;&#xCC98;&#xC640; &#xBCC0;&#xC870; &#xC5EC;&#xBD80;&#xB97C; &#xAC80;&#xC0AC;&#xD558;&#xACE0; &#xC815;&#xC801; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574; &#xC545;&#xC131; &#xD589;&#xC704;&#xB97C; &#xD0D0;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;.</p><p>macOS&#xC758; &#xC774;&#xB7F0; file quarantine &#xAE30;&#xB2A5;&#xC740; file system&#xC758; &#xD655;&#xC7A5; attribute&#xC5D0; &#xC758;&#xC874;&#xD569;&#xB2C8;&#xB2E4;. file&#xC758; &#xD655;&#xC7A5; attribute&#xB780; &#xBAA8;&#xB4E0; macOS &#xC5D0;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xD30C;&#xC77C;&#xC5D0; &#xC124;&#xC815;&#xD560; &#xC218; &#xC788;&#xB294; &#xC791;&#xC740; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;&#xB97C; &#xB73B;&#xD558;&#xBA70;, &#xADF8;&#xC911; <code>com.apple.quarantine</code>&#xC740; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC774; Gatekeeper&#xC758; &#xAC80;&#xC0AC;&#xAC00; &#xD544;&#xC694;&#xD558;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC2DC; &#xB9D0;&#xD558;&#xBA74;, <code>com.apple.quarantine</code> attribute&#xAC00; &#xC124;&#xC815;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xD30C;&#xC77C;&#xC740; Gatekeeper&#xC758; &#xAC80;&#xC0AC;&#xB97C; &#xBC1B;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Safari&#xB97C; &#xD3EC;&#xD568;&#xD55C; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xC6F9; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB4E4;&#xC740; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC; &#xB418;&#xB294; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC5D0; <code>com.apple.quarantine</code> attribute&#xB97C; &#xC124;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. zip&#xD30C;&#xC77C;&#xC758; &#xACBD;&#xC6B0; &#xC555;&#xCD95;&#xC744; &#xD480;&#xAC8C; &#xB418;&#xBA74; zip&#xD30C;&#xC77C; &#xB0B4;&#xBD80;&#xC758; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C; &#xB610;&#xD55C; <code>com.apple.quarantine</code> attribute&#xB97C; &#xC0C1;&#xC18D;&#xBC1B;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC5EC;&#xB7EC; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB97C; &#xC911;&#xCCA9;&#xC2DC;&#xCF1C; &#xAE4A;&#xC740; directory hiearchy&#xB97C; &#xAC16;&#xB294; zip&#xD30C;&#xC77C;&#xC758; path name&#xC774; &#xB108;&#xBB34; &#xAE38;&#xBA74; zip &#xB0B4;&#xBD80;&#xC758; &#xD30C;&#xC77C; &#xC77C;&#xBD80;&#xAC00; <code>com.apple.quarantine</code>&#xC744; &#xC0C1;&#xC18D;&#xBC1B;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ol><li>path name&#xC774; &#xB108;&#xBB34; &#xAE38;&#xBA74; Safari&#xAC00; &#xC555;&#xCD95;&#xC744; &#xD480;&#xC9C0; &#xBABB;&#xD574; &#xB0B4;&#xBD80; &#xD30C;&#xC77C;&#xB4E4;&#xC758; attribute&#xB97C; &#xC124;&#xC815;&#xD558;&#xC9C0; &#xBABB;&#xD569;&#xB2C8;&#xB2E4;.</li><li>path name&#xC774; &#xB108;&#xBB34; &#xAE38;&#xBA74; macOS finder&#xC758; Archive utiliy&#xAC00; &#xC555;&#xCD95;&#xC744; &#xD480; &#xB54C; &#xC77C;&#xBD80; &#xD30C;&#xC77C;&#xC5D0; attribute&#xB97C; &#xC0C1;&#xC18D;&#xC2DC;&#xD0A4;&#xC9C0; &#xBABB;&#xD569;&#xB2C8;&#xB2E4;.</li></ol>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/mac/">mac</category>
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/safari/">safari</category>
      
      <category domain="https://hackyboiz.github.io/tags/finder/">finder</category>
      
      <category domain="https://hackyboiz.github.io/tags/quarantine/">quarantine</category>
      
      <category domain="https://hackyboiz.github.io/tags/gatekeeper/">gatekeeper</category>
      
      
      <comments>https://hackyboiz.github.io/2021/10/05/fabu1ous/2021-10-05/#disqus_thread</comments>
      
    </item>
    
  </channel>
</rss>
